{"id":"0a8051da6de03bb4790d08edd4cd000d","source":"Cointelegraph","title":"Mt. Gox makes second $900M+ move in a week as Bitcoin taps $76K","url":"https:\/\/cointelegraph.com\/news\/mt-gox-makes-second-billion-dollar-transfer-as-bitcoin-tanks-to-76000","content":" Mt. Gox moved a batch of Bitcoin worth over $930 million on March 11 as the bankrupt crypto exchange vies to fully repay customers by Oct. 31. \nDefunct crypto exchange Mt. Gox moved almost a billion worth of Bitcoin, the second large BTC transfer in a week, as Bitcoin’s price fell to a four-month low on March 11.\nOf the 11,833 Bitcoin (BTC) moved, 11,501 ($905.1 million) were sent into a new wallet, while the remaining 332 Bitcoin ($26.1 million) were transferred to a warm wallet, according to blockchain analytics firm Lookonchain, citing Arkham Intelligence data. \nThe transfer cost Mt. Gox just $2.13.\nTransaction details of Mt. Gox’s $931 million transfer. Source: Arkham Intelligence\nIt comes less than a week after Mt. Gox moved 12,000 Bitcoin worth a little over $1 billion on March 6. Arkham noted that $15 million of those funds were sent to BitGo — one of the custodians facilitating Mt. Gox’s creditor repayments.\nBlockchain analytics firm Spot On Chain said the 332 Bitcoin that recently went into the warm wallet may also be moved to assist with the repayments.\nThe movement coincided with a 2.4% price fall for Bitcoin to $76,784 over 30 minutes, CoinGecko data shows, retreating to November prices when the market was rallying on the back of US President Donald Trump’s election win.\nWhile Bitcoin recovered from the slump to $79,275 soon after, Maelstrom chief investment officer Arthur Hayes advised investors to “be fucking patient” in a March 11 X post in which he predicted Bitcoin would bottom around the $70,000 mark.\nSource: Arthur Hayes\nRelated: Bitcoin may benefit from US stablecoin dominance push\nMt. Gox’s main wallets now only hold 24,411 Bitcoin — worth $1.94 billion — after the exchang started offloading around $9.2 billion worth of Bitcoin in June 2024, Spot On Chain data shows.\nMt. Gox’s change in Bitcoin holdings since 2015. Source: Spot On Chain\nLast October, the defunct crypto exchange extended its deadline to fully repay its creditors, saying it would do so by Oct. 31, 2025.Mt. Gox was the largest Bitcoin exchange between 2010 and 2014 — handling around 70-80% of Bitcoin trades before it collapsed from a hack that saw up to 850,000 Bitcoin stolen from the Tokyo-based platform.\nMagazine: Train AI agents to make better predictions… for token rewards\n","date":1741691701602,"authors":[],"image_url":"","scraped_at":"2025-03-11T11:15:01.602986"}