{"id":"0ba2a491986556cf2d52501af28c364d","source":"Cointelegraph","title":"Strategy’s Bitcoin stash still up over $7B despite market downturn","url":"https:\/\/cointelegraph.com\/news\/strategy-bitcoin-stash-up-7-billion-500k-btc-holdings","content":" Michael Saylor’s Strategy holds almost 500,000 Bitcoin worth over $41 billion at current market prices. \nSoftware intelligence firm turned Bitcoin investment behemoth Strategy remains $7.8 billion in profit on its Bitcoin holdings despite the cryptocurrency’s recent drop to $80,000.\nOn March 10, Bitcoin (BTC) recorded its largest weekly decline on record, shedding more value in the past seven days than at any other time in its trading history. Cointelegraph Markets Pro data shows that BTC went from $93,379 on March 3 to a low of $80,610 on March 10, a 13.6% drop in Bitcoin prices in one week. At the time of writing, Bitcoin had recovered slightly to trade at around $82,000. \nDespite the market downturn, Michael Saylor’s Strategy remained ahead on its BTC purchases. The company held 499,096 BTC, purchased at an average of $66,423 per token. In total, Strategy has spent $33.1 billion on Bitcoin purchases, while its holdings are now valued at $41.2 billion — a 24% unrealized gain even amid the correction.\nStrategy’s Bitcoin investments highlight the importance of the dollar-cost averaging tactic in investing. Instead of buying at a lump sum, the company divided its BTC purchases at different times and continued to buy the tokens despite the prices. \nWhile Strategy’s Bitcoin holdings remain in the green, other companies that recently entered the Bitcoin market are seeing losses.\nAccording to Bitcoin holdings tracker BitcoinTreasuries.NET, healthcare tech and software firm Semler Scientific, which started holding BTC on May 28, is down by 6.25% on its purchases. \nThe company holds 3,192 BTC bought at an average price of $87,850. This means that its BTC purchased with over $280 million is now only worth around $262 million. \nRelated: Michael Saylor pushes US gov’t to purchase up to 25% of Bitcoin supply\nMetaplanet, dubbed “Asia’s Strategy,” is slightly down on its Bitcoin holdings. The company started to add Bitcoin to its balance sheet in April 2023, copying Strategy’s playbook. \nMetaplanet holds 2,888 bought at an average price of $83,049. It’s down by over $2 million, nearly 1%, on its Bitcoin investments. \nAccording to blockchain analytics firm Lookonchain, Strategy has spent $23 billion on Bitcoin purchases since November 2024. However, with the recent price drop, the BTC acquired during this period is now worth only about $20 billion, implying an unrealized loss of over $3 billion on these recent acquisitions.\nStrategy’s Bitcoin purchases since November 2024. Source: Lookonchain\nMagazine: Mystery celeb memecoin scam factory, HK firm dumps Bitcoin: Asia Express\n","date":1741616530052,"authors":[],"image_url":"","scraped_at":"2025-03-10T14:22:10.052144"}