{"id":"0d112b4ce972ef89e5c89052502a0ce1","source":"Cointelegraph","title":"Mantra unveils $108M fund to back real-world asset tokenization, DeFi","url":"https:\/\/cointelegraph.com\/news\/mantra-108-m-fund-rwa-tokenization-defi-startups","content":" The $108,888,888 fund will operate an “open-arms policy,” welcoming real-world asset tokenization and DeFi projects at all developmental stages. \nThe Mantra blockchain network has launched a $108,888,888 ecosystem fund aimed at accelerating the growth of startups focused on real-world asset (RWA) tokenization and decentralized finance (DeFi), amid rising demand for stable, asset-backed digital products.\nMantra, a layer-1 (L1) blockchain built for tokenized RWAs, launched the Mantra Ecosystem Fund (MEF) to accelerate the growth and adoption of projects and startups building on its network, according to an April 7 announcement shared with Cointelegraph.\nMantra said it will deploy the capital over the next four years among “high-potential blockchain projects” worldwide, with investment opportunities sourced through Mantra’s network of partners. The fund’s backers include a wide range of institutional partners including Laser Digital, Shorooq, Brevan Howard Digital, Valor Capital, Three Point Capital and Amber Group.\nRelated: 0G Foundation launches $88M fund for AI-powered DeFi agents\nMantra CEO John Patrick Mullin said the fund will operate an “open-arms policy, welcoming projects at any developmental stage globally with a particular focus on RWA’s and DeFi.” Mullin told Cointelegraph:\nMantra aims to become the underlying infrastructure layer for tokenized asset issues worldwide, Mullin said.\nSource: Mantra\nThe launch of the fund comes a month after Mantra became the first DeFi platform to obtain a virtual asset service provider (VASP) license under Dubai’s Virtual Assets Regulatory Authority (VARA).\nRelated: Stablecoin rules needed in US before crypto tax reform, experts say\nThe timing of the fund’s launch aligns with growing institutional interest in RWAs, which are seen by some as a hedge against crypto market volatility and broader economic uncertainty.\nGlobal fears and uncertainty around US President Donald Trump’s tariffs have impacted investor sentiment across markets.\nDespite a broader market slump triggered by US tariff-related concerns, the value of tokenized RWAs recently surged to a record high. According to data from RWA.xyz, total RWA market capitalization reached more than $19.6 billion as of early April, up from $17 billion in early February.\nRWA global market dashboard. Source: RWA.xyz\nIndustry watchers previously told Cointelegraph that Bitcoin’s lack of upside momentum may drive RWAs to a $50 billion all-time high before the end of 2025.\nThe world’s largest asset manager, BlackRock, has also signaled support for the RWA space.\nBlackRock BUIDL capital deployed by chain. Source: Token Terminal, Leon Waidmann\nBlackRock’s USD Institutional Digital Liquidity Fund (BUIDL) saw an over three-fold increase in the three weeks leading up to March 26, from $615 million to $1.87 billion.\nMagazine: Financial nihilism in crypto is over — It’s time to dream big again\n","date":1744039771319,"authors":[],"image_url":"","scraped_at":"2025-04-07T15:29:31.319418"}