{"id":"13bb70cf1e366fa890e4cab6a955bb4c","source":"Cointelegraph","title":"European lawmakers silent on US Bitcoin reserve amid digital euro push","url":"https:\/\/cointelegraph.com\/news\/european-lawmakers-silent-trump-bitcoin-reserve-amid-cbdc-push","content":" European lawmakers have yet to respond to Trump’s Bitcoin reserve order as the ECB pushes ahead with its digital euro plans for an October 2025 launch. \nEuropean lawmakers have remained silent on the United States’ Strategic Bitcoin Reserve order, a landmark policy shift favoring early adopters of Bitcoin due to its economic model.\nUS President Donald Trump’s March 7 executive order outlined a plan to create a Bitcoin reserve using cryptocurrency seized in criminal cases rather than purchasing Bitcoin (BTC) on the market.\nDespite the significance of this move, European policymakers have yet to make any major public statements regarding Bitcoin reserves, raising questions about their stance on integrating BTC into national reserves.\nThis may signal a lack of European Bitcoin reserve-related efforts due to the lengthy process of adding new national reserve assets, according to Anastasija Plotnikova, co-founder and CEO of blockchain regulatory firm Fideum. She said:\n“[The] ECB [European Central Bank] historically and currently is very critical of BTC as a reserve asset, so it effectively closes the doors to all EU member states,” Plotnikova added.\nMeanwhile, European lawmakers are preparing to launch the digital euro, a central bank digital currency (CBDC).\nRelated: US Bitcoin reserve marks ‘real step’ toward global financial integration\nEuropean lawmakers’ silence on Trump’s Bitcoin reserve order is likely due to its focus on the digital euro, according to James Wo, the founder and CEO of venture capital firm DFG.\n“This stems from the ECB’s firm stance against holding Bitcoin in its reserves, as reiterated by ECB President Christine Lagarde,” Wo told Cointelegraph, adding:\nRelated: Bitcoin reserve backlash signals unrealistic industry expectations\nDespite skepticism, ECB President Christine Lagarde is pushing ahead with the digital euro’s rollout, expected in October 2025. Lagarde has emphasized that the CBDC will coexist with cash and offer privacy protections to address concerns about government overreach.\n“The European Union is looking to launch the digital euro, our central bank digital currency, by October this year,” Lagarde said during a press conference, adding:\nSource: Cointelegraph\nThe United States and the European Union are taking opposite approaches to digital assets. While the EU is working to integrate a centralized digital currency, Trump has taken a firm stance against CBDCs.\nWhile CBDCs have been praised for their potential to increase financial inclusion, critics have raised concerns about their surveillance capabilities and the potential for government overreach.\nIn July 2023, Brazil’s central bank published the source code for its CBDC pilot, and it took just four days for people to notice the surveillance and control mechanisms embedded within its code, allowing the central bank to freeze or reduce user funds within CBDC wallets.\nMagazine: SCB tips $500K BTC, SEC delays Ether ETF options, and more: Hodler’s Digest, Feb. 23 – Mar. 1\n","date":1741616515255,"authors":[],"image_url":"","scraped_at":"2025-03-10T14:21:55.255144"}