{"id":"18685324be3310752ea222e37c937be6","source":"Cointelegraph","title":"Bitcoin price risks drop to $71K as Trump tariffs hurt US business outlook","url":"https:\/\/cointelegraph.com\/news\/bitcoin-71k-target-tariffs-deal-rare-us-business-outlook-slump","content":" Bitcoin may see a \"sizeable bounce\" at $71,000 if US trade tariffs result in further BTC price pressure, new analysis predicts. \nBitcoin (BTC) faces “very high risk” conditions from US trade tariffs, which could spark a slump to $71,000.\nIn his latest analysis, Charles Edwards, the founder of quantitative Bitcoin and digital asset fund Capriole Investments, warned about the impact of “higher than expected” US trade tariffs.\nBitcoin reacted noticeably worse than US stocks after President Donald Trump announced worldwide reciprocal trade tariffs on April 2.\nBTC\/USD fell up to 8.5% on the day, while the S&P 500 managed to end the Wall Street trading session 0.7% higher.\nEdwards said that US business expectations are reflecting the type of uncertainty seen only three times since the turn of the millennium.\n“Consider this as tariffs come in higher than expected. The Philly Fed Business Outlook survey is showing expectations today comparable to 2000, 2008 and 2022,” he told X followers.\nAn accompanying chart showed the Philadelphia Fed’s Business Outlook Survey (BOS) back under 15 for the first time since the start of 2024. Late 2022 was the pit of the most recent crypto bear market when BTC\/USD reversed at $15,600.\nPhiladelphia Fed Business Outlook Survey vs. S&P 500. Source: Charles Edwards\/X\nIn Capriole’s latest market update on March 31, Edwards acknowledged that BOS data can produce unreliable signals regarding market sentiment but argued that it should not be ignored.\n“While no guarantee of the future outlook (this metric does have false signals) this is a data reading we have had before at very high risk zones (year 2000, 2008 and 2022), telling us to keep a very open mind,” he wrote, adding: \nFor Bitcoin, a key level to watch in the tariff aftermath is $91,000, with Capriole suggesting that US macroeconomic moves would “decide the ultimate technical trend from here.”\n“All else equal, a daily close above $91K would be a strong bullish reclaim signal,” the update explained alongside the weekly BTC\/USD chart. \nBTC\/USD 1-day chart (screenshot). Source: Capriole Investments\nAs Cointelegraph reported, a silver lining for crypto and risk assets could come in the form of increasing global liquidity.\nRelated: Bitcoin sales at $109K all-time high 'significantly below' cycle tops — Glassnode\nIn the US, the Fed has already begun to loosen tight financial policy, with bets on a return to so-called quantitative easing (QE) varying.\n“How long until the Powell printer starts humming?” Edwards queried.\nM2 money supply, meanwhile, is due for an “influx,” something which has historically spawned major BTC price upside.\n“The BIG takeaway (the most important observation) is that a big M2 influx is coming. The exact date is less important,” analyst Colin Talks Crypto predicted in an X thread this week.\nA comparative chart hinted at a potential BTC price rebound by the start of May.\nUS M2 money supply vs BTC\/USD chart. Source: Colin Talks Crypto\/X\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\n","date":1743724109807,"authors":[],"image_url":"","scraped_at":"2025-04-03T23:48:29.807677"}