{"id":"1b0b3b2cdb351648a39e0afe31ffc197","source":"Cointelegraph","title":"Crypto firms spent $134M on 2024 US elections, raising influence concerns","url":"https:\/\/cointelegraph.com\/news\/crypto-firms-134m-election-spending-regulatory-concerns","content":" Some industry watchers say political donations are necessary for the emergence of more regulatory clarity around cryptocurrencies. \nCryptocurrency companies spent more than $134 million on the 2024 US elections, fueling concerns about their growing political influence and potential risks to regulatory stability, according to a report by the Center for Political Accountability (CPA).\nThe growing connection of crypto firms with US politics is raising newfound concerns for regulators, investors and the wider financial system, according to a report released by the Center for Political Accountability (CPA).\nCryptocurrency firms shelled out a cumulative $134 million on the 2024 US elections in “unchecked political spending,” which presents some critical challenges, the March 7 report stated.\n“While the companies making these contributions may be seeking a favorable regulatory environment, these political donations further erode public trust and expose companies to legal, reputational, and business risks that cannot be ignored,” the report added.\nCryptocurrency regulation has taken center stage over the past week following a historic executive order from US President Donald Trump to create a Strategic Bitcoin (BTC) Reserve ahead of the first White House Crypto Summit on March 7.\nSource: politicalaccountability.net\nFairshake, a political action committee (PAC) backed by major crypto firms including Coinbase, Ripple and Andreessen Horowitz, was one of the largest contributors, spending more than $40 million to support candidates aligned with pro-crypto policies.\nFairshake and affiliated PACs were active in key congressional races, attempting to shape legislation favorable to digital assets.\n“As the industry continues to seek influence through vast contributions and opaque financial maneuvers, the risks of instability, regulatory backlash, and public distrust only grow,” the report said.\nFairshake donations. Source: politicalaccountability.net\nThe influx of crypto money into politics did not go unnoticed by regulators. In August 2024, the consumer advocacy group Public Citizen filed a complaint with the Federal Election Commission (FEC), alleging that Coinbase’s corporate contributions to Fairshake and the Congressional Leadership Fund constituted a violation of federal election law due to their status as a federal contractor.\nRelated: Bitcoin reserve backlash signals unrealistic industry expectations\nCoinbase has committed an additional $25 million to Fairshake for the 2026 midterm election cycle.\nCoinbase commits $25 million to Fairshake. Source: Coinbase\n“The stakes are too high for us to stand on the sidelines, and that’s why we at Coinbase are proud to help do our part,” the company wrote in an October 2024 blog post.\nRelated: Bitcoin risks deeper drop if $75K support fails amid macro concerns\nDespite the risks highlighted by the report, some regulatory experts see the donations as necessary for advancing more innovation-friendly regulations.\n“As someone deeply involved in crypto, I see this spending as necessary for regulatory clarity, crucial for stability and growth,” according to Anndy Lian, author and intergovernmental blockchain expert:\nStill, risks, including “regulatory capture,” where the interests of large firms take priority, may present challenges and erode crypto investor trust. Still, this is part of the organic growth of the emerging crypto industry, Lian said, adding:\nThe debate over crypto’s role in politics follows the high-profile collapse of the Libra (LIBRA) token, a memecoin endorsed by Argentine President Javier Milei. The project’s insiders allegedly siphoned over $107 million worth of liquidity in a rug pull, triggering a 94% price collapse within hours and wiping out $4 billion.\nOver 100 governmental fraud complaints have been opened in Argentina since the Libra memecoin’s scandal, illustrating the risks of a country’s executive branch promoting “any kind of unregulated security,” the CPA’s report states.\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n","date":1741616533493,"authors":[],"image_url":"","scraped_at":"2025-03-10T14:22:13.493314"}