{"id":"1c4e18f9a2aa0ae6996b36157ffd6e5f","source":"Cointelegraph","title":"Michael Saylor pushes US gov’t to purchase up to 25% of Bitcoin supply","url":"https:\/\/cointelegraph.com\/news\/strategy-michael-saylor-bitcoin-purchase-us-government-donald-trump","content":" Strategy founder Michael Saylor says the US government should aim to hold a quarter of Bitcoin’s entire supply by 2035, when 99% of all BTC will have been issued. \nStrategy founder Michael Saylor has proposed that the United States government acquire up to 25% of Bitcoin’s total supply over the next decade for its Strategic Bitcoin Reserve.\n“Acquire 5-25% of the Bitcoin network in trust for the nation through consistent, programmatic daily purchases between 2025 and 2035, when 99% of all BTC will have been issued,” Saylor wrote in a document titled “A Digital Assets Strategy to Dominate the 21st Century Global Economy.” \nSaylor presented the document to US President Donald Trump, government executives, and global crypto leaders at the White House Crypto Summit on March 7.\nHe explained that the government should stick to a “Never sell your Bitcoin” policy, predicting that by 2045, the Strategic Bitcoin Reserve could generate over $10 trillion annually, and serve as a “perpetual source of prosperity” for Americans.\nUp until 2045, Saylor said the Reserve could generate between $16 trillion and $81 trillion for the US Treasury, potentially easing the national debt.\nSource: Michael Saylor\nEarlier that day, Trump signed an executive order establishing a “Strategic Bitcoin Reserve” and a “Digital Asset Stockpile,” initially funded with cryptocurrency seized in criminal cases.\nWhile it didn’t include an immediate plan to buy more Bitcoin, the order stated that the Treasury and Commerce secretaries would develop “budget-neutral strategies” for acquiring more Bitcoin, ensuring no added costs for taxpayers.\nIf the US government acquired 25% of Bitcoin’s total supply, it would hold 5.25 million BTC — far more than the 1 million BTC (5% of the supply) that Wyoming Senator Cynthia Lummis proposed in the Bitcoin Act introduced in July 2024.\nRelated: Michael Saylor’s Strategy bags first Bitcoin purchase under new name\nMeanwhile, Saylor has continued accumulating Bitcoin, having purchased an additional $2 billion worth on Feb. 24. This brings Strategy’s total holdings to nearly 500,000 BTC.\nThe acquisition came after Strategy raised another $2 billion in a senior convertible note offering to purchase more Bitcoin.\nMagazine: SEC’s U-turn on crypto leaves key questions unanswered\n","date":1741531236079,"authors":[],"image_url":"","scraped_at":"2025-03-09T14:40:36.079548"}