{"id":"1c6b8a852f0e2f43daeb0705bf4b287b","source":"Cointelegraph","title":"Crypto plunges as Trump tariff ‘medicine’ brutalizes global stock markets","url":"https:\/\/cointelegraph.com\/news\/crypto-plunges-nasdaq-dow-stock-futures-fall-on-open","content":" US President Donald Trump told reporters he wasn’t intentionally engineering a market sell-off, but “sometimes you have to take medicine to fix something.” \nCryptocurrency prices tumbled as the US stock futures market opened sharply lower on April 6 as the Trump administration doubled down on its global tariff strategy.\nThe Trump administration hit all countries with a 10% tariff starting April 5, with some slapped at higher rates, including China at 34%, the European Union at 20%, and Japan at 24%.\nBitcoin (BTC) dropped over 6% in the last 24 hours and was trading around $77,883. Meanwhile, Ether (ETH) shed over 12% in the same time frame and was trading at $1,575, according to CoinGecko. The total crypto market cap dropped over 8% to $2.5 trillion. \nPrices have clawed back some losses since. Bitcoin has recovered 1.4% to $78,500. Meanwhile, Ether regained $1,594.\nSource: Autism Capital\nAt the same time, the Crypto Fear & Greed Index, which measures market sentiment for Bitcoin and other cryptocurrencies, returned a score of 23 in its latest April 7 update, which is considered extreme fear.\nIn a statement, Charlie Sherry, head of finance at Australian crypto exchange BTC Markets, said the drop is unsurprising because global markets are generally more illiquid on Sundays. \n“As a result, a few large sell-offs can have a disproportionate impact, pushing prices down quickly,” he said. \nSome traders, however, predict a Bitcoin breakout could be around the corner. BitMEX co-founder Arthur Hayes has also speculated that while the tariffs are rattling markets, they could result in a Bitcoin rally. \nThe US Stock Futures market has also opened down. \nFutures tied to the S&P 500 dropped nearly 4%, according to Google Finance. Meanwhile, the tech-heavy Nasdaq lost, and the Dow Jones Industrial Average futures sank by over 8%. \nTrading resource the Kobeissi Letter said in an April 6 post to X that the drop in US stock market futures puts S&P 500 futures in ”bear market territory,” adding that the US stock market has now erased an average of $400 billion per trading day for the last 32 days. \nSource: Kobeissi Letter\nTom Dunleavy, a managing partner at venture capital firm MV Global, said it could be the “worst three-day move for US stocks of all time” if “tonight’s futures hold.” \nCrypto-friendly billionaire investor Bill Ackman speculates that US President Donald Trump could postpone the tariffs to allow countries to make counteroffers or deals.\nIn an April 6 statement on his social media platform, Truth Social, Trump doubled down on the tariffs, saying the US has massive financial deficits with China, the European Union and many others, which the levies will solve.\nRelated: ‘National emergency’ as Trump’s tariffs dent crypto prices\n“The only way this problem can be cured is with TARIFFS, which are now bringing tens of billions of dollars into the USA. They are already in effect, and a beautiful thing to behold,” he said.\nHe also told reporters aboard Air Force One that he wasn't intentionally trying to cause a market sell-off but added that “sometimes you have to take medicine to fix something.” \nAt the same time, US National Economic Council Director Kevin Hassett said in an April 6 interview with ABC's This Week program that more than 50 countries have reached out to the president to negotiate fresh trade deals.\n“They’re doing that because they understand that they bear a lot of the tariff,” he said. \nUS Treasury Secretary Scott Bessent urged US trading partners in an April 2 interview with Bloomberg against taking retaliatory steps, arguing “this is the high end of the number” for tariffs if they don't try to add more levies in response. \nMagazine: Financial nihilism in crypto is over — It’s time to dream big again\n","date":1744039790877,"authors":[],"image_url":"","scraped_at":"2025-04-07T15:29:50.877660"}