{"id":"1f5403b3d897ebd73d2096caab34765d","source":"Cointelegraph","title":"Bitcoiner speculates ‘massive’ bot spam briefly took down Bitcoin mailing list","url":"https:\/\/cointelegraph.com\/news\/bitcoiner-speculates-massive-bot-spam-caused-google-briefly-ban-bitcoin-mailing-list","content":" The Bitcoin Development Mailing List on Google Groups was banned for several hours, and one moderator thinks it may have been an intentional attack. \nOne of Bitcoin’s key communication tools used to discuss potential protocol changes was knocked out for several hours starting on April 2, with one moderator speculating it may have been a targeted attack assisted by bots. \nFor several hours across April 2 and 3, Bitcoin core developers and researchers were unable to interact on Google Groups after Google banned the group for spam. \n“Bitcoin Development Mailing List has been identified as containing spam, malware, or other malicious content,” Google’s warning stated at the time.\nThe Bitcoin Development Mailing List’s warning before the ban was lifted. Source: Google\nBitcoin Core developer Bryan Bishop told Cointelegraph that the ban may have been triggered by individuals or bots mass-reporting the Bitcoin mailing list from multiple accounts.\nIt’s a common tactic by attackers looking to ban or censor a community, Bishop said, noting that similar incidents occur on YouTube, X and TikTok fairly often.\nGoogle Workspace Support’s X account confirmed that the issue had been resolved on April 3 at 2:23 am UTC in response to one of the Bitcoin mailing list’s other moderators, Ruben Somsen.\nBitcoin advocate and head of Block Inc, Jack Dorsey, also called attention to the ban, urging Google CEO Sundar Pichai to investigate the issue.\nRelated: Bitcoin creator Satoshi Nakamoto may be wealthier than Bill GatesMailing lists typically involve one moderator email sending information to subscribers in a group to discuss and collaborate on a topic or shared interest.\nThe Bitcoin mailing list is used by Bitcoin core developers and researchers to discuss potential protocol changes to Bitcoin, which secures more than $1.6 trillion worth of value for network users around the world.\nIt has become one of the main Bitcoin mailing lists since the network’s pseudonymous creator, Satoshi Nakamoto, shared Bitcoin’s white paper on the Cryptography Mailing List on Oct. 31, 2008.\nDespite the incident, Bishop said the Bitcoin mailing list moderators have no intention of moving away from communicating via email:\nThe Bitcoin mailing list officially migrated to Google Groups in February 2024. \nSource: Bryan Bishop\nBefore that, the mailing list was hosted on the Linux Foundation, Oregon State University Open Source Lab’s infrastructure and SourceForge.net.\nBishop suggested that a Bitcoin forum shouldn't be limited to one particular platform, pointing out that there are several other platforms where Bitcoin developments are discussed, including GitHub and the decentralized social network Nostr.\nMagazine: 10 crypto theories that missed as badly as ‘Peter Todd is Satoshi’\n","date":1743688070716,"authors":[],"image_url":"","scraped_at":"2025-04-03T13:47:50.716145"}