{"id":"24a9f31cd4ab81b30e504a1fdf17acc9","source":"Cointelegraph","title":"El Salvador acquired over 13 BTC since March 1, despite IMF deal","url":"https:\/\/cointelegraph.com\/news\/el-salvador-acquires-13-btc-past-week-despite-imf-deal","content":" President Nayib Bukele shows no sign of abandoning the BTC treasury strategy as Bitcoin continues to gain international legitimacy. \nEl Salvador acquired 13 Bitcoin (BTC) since March 1, despite International Monetary Fund (IMF) pressure on the country's public sector to stop accumulating the decentralized store of value asset.\nAccording to the El Salvador Bitcoin Office, the country's Bitcoin treasury holds a total of over 6,105 BTC, valued at more than $527 million at current prices.\nThe Central American country typically acquires BTC at a steady pace of 1 coin every 24 hours. However, on March 3, El Salvador purchased 5 BTC in a single day.\nEl Salvador struck a deal with the IMF in December 2024 for a $1.4 billion loan from the organization. As part of that deal, the government of El Salvador agreed to rescind the status of BTC as legal tender in the country and scale back public sector involvement with Bitcoin.\nEl Salvador Bitcoin holdings. Source: El Salvador Bitcoin Office\nRelated: How can Bukele still stack Bitcoin after IMF loan agreement?\nEl Salvador's Congress amended its Bitcoin laws in January 2025 to comply with the IMF loan agreement. Lawmakers repealed the previous version of the law in a 55-2 vote.\nDespite the repeal, the government continued stacking Bitcoin, purchasing two BTC in a single day on Feb. 1 and continuing its daily accumulation of the digital currency.\nOn March 3, the IMF issued a new request pressuring El Salvador to stop accumulating BTC and stipulated that the country could not issue debt or tokenized securities tied to Bitcoin.\nPresident Nayib Bukele responded to the IMF pressure and said that El Salvador will continue buying BTC — characterizing the IMF's continued pressure as \"whining.\"\nSource: Nayib Bukele\n“If it didn’t stop when the world ostracized us and most 'bitcoiners' abandoned us, it won’t stop now, and it won’t stop in the future,\" Bukele emphatically stated.\nThe government of El Salvador's unapologetic pro-Bitcoin stance caused several major crypto firms to announce that they are relocating to the Central American country.\nOn Jan. 7, Bitfinex Derivatives announced it was relocating from Seychelles to El Salvador. Stablecoin issuer Tether followed suit on Jan. 13 by announcing it was moving its headquarters to El Salvador.\nMagazine: El Salvador’s national Bitcoin chief has been orange-pilling Argentina\n","date":1741531242574,"authors":[],"image_url":"","scraped_at":"2025-03-09T14:40:42.574971"}