{"id":"260be52c88ad1238aced9645e5d5ea7c","source":"Cointelegraph","title":"Wall Street’s one-day loss tops the entire crypto market cap","url":"https:\/\/cointelegraph.com\/news\/united-states-stock-market-decline-market-cap-crypto-wall-street","content":" Even some crypto skeptics pointed out that Bitcoin isn’t sliding anywhere near as much as the stock market has recently. \nThe United States stock market lost more in value over the April 4 trading day than the entire cryptocurrency market is worth, as fears over US President Donald Trump's tariffs continue to ramp up.\nOn April 4, the US stock market lost $3.25 trillion — around $570 billion more than the entire crypto market's $2.68 trillion valuation at the time of publication.\nAmong the Magnificent-7 stocks, Tesla (TSLA) led the losses on the day with a 10.42% drop, followed by Nvidia (NVDA) down 7.36% and Apple (AAPL) falling 7.29%, according to TradingView data.\nThe significant decline across the board signals that the Nasdaq 100 is now \"in a bear market\" after falling 6% across the trading day, trading resource account The Kobeissi Letter said in an April 4 X post. This is the largest daily decline since March 16, 2020.\n\"US stocks have now erased a massive -$11 TRILLION since February 19 with recession odds ABOVE 60%,\" it added. The Kobessi Letter said Trump's April 2 tariff announcement was \"historic\" and if the tariffs continue, a recession will be \"impossible to avoid.\"\nSource: Anthony Scaramucci\nOn April 2, Trump signed an executive order establishing reciprocal tariffs on trading partners and a 10% baseline tariff on all imports from all countries. \nTrump said the reciprocal tariffs will be roughly half the rate US trading partners impose on American goods.\nRelated: Bitcoin bulls defend $80K support as 'World War 3 of trade wars' crushes US stocks\nMeanwhile, the crypto industry has pointed out that while the stock market continues to decline, Bitcoin (BTC) remains stronger than most expected.\nCrypto trader Plan Markus pointed out in an April 4 X post that while the entire stock market “is tanking,” Bitcoin is holding. \nSource: Jeff Dorman\nEven some crypto skeptics have pointed out the contrast between Bitcoin's performance and the US stock market during the recent period of macro uncertainty.\nStock market commentator Dividend Hero told his 203,200 X followers that he has \"hated on Bitcoin in the past, but seeing it not tank while the stock market does is very interesting to me.\"\nMeanwhile, technical trader Urkel said Bitcoin \"doesn't appear to care one bit about tariff wars and markets tanking.\" Bitcoin is trading at $83,749 at the time of publication, down 0.16% over the past seven days, according to CoinMarketCap data.\nMagazine: XRP win leaves Ripple a 'bad actor' with no crypto legal precedent set\n","date":1743851158581,"authors":[],"image_url":"","scraped_at":"2025-04-05T11:05:58.581793"}