{"id":"26837b4d1a85b91f32a670c9c4a0743b","source":"Cointelegraph","title":"Bitcoin price retakes $80K as US stocks avoid 'Black Monday' meltdown","url":"https:\/\/cointelegraph.com\/news\/bitcoin-price-retakes-80-k-as-us-stocks-avoid-black-monday-meltdown","content":" Bitcoin appears to find its footing, rallying above $80,000 and copying stocks by bouncing back from its initial tariff-induced losses. \nBitcoin (BTC) sought a relief rally into the April 7 Wall Street open as US stocks rebounded from a 4%+ loss.\nBTC\/USD 1-hour chart. Source: Cointelegraph\/TradingView\nData from Cointelegraph Markets Pro and TradingView showed the area around $80,000 forming a focus for BTC\/USD after the pair hit five-month lows.\nThe fallout from US trade tariffs continued to ricochet across global markets, with Asia stocks closing the day with considerable losses.\nAt the same time, reports of a potential 90-day pause in the tariffs going live, against a background of negotiations with over 50 US trading partners, helped pare losses in futures markets ahead of the open and allowed the S&P 500 and Nasdaq Composite Index to avert a ”Black Monday” 1987-style implosion.\n“Nasdaq futures were down nearly -7% at their lowest point last night,” trading resource The Kobeissi Letter noted in part of ongoing coverage on X.\nKobeissi nonetheless acknowledged that the S&P 500 had fallen more than 20% from its February all-time highs, opening in “bear market territory” for the first time since 2022.\nS&P 500 1-day chart. Source: Cointelegraph\/TradingView\nContinuing, trading firm QCP Capital called international engagement over tariffs “remarkable.”\n“Yet as the world scrambles to secure a seat at the table, markets are likely to remain on edge,” it concluded in its latest bulletin to Telegram channel subscribers. \nFed target rate probability comparison for May FOMC meeting. Source: CME Group\nData from CME Group’s FedWatch Tool continued to show shifting market expectations on interest rate cuts by the Federal Reserve, with the upcoming meeting in June now favored as a deadline.\nBitcoin meanwhile attempted to solidify support in the mid-$70,000 range, having come within spitting distance of old all-time highs from March 2024.\nRelated: Black Monday 2.0? 5 things to know in Bitcoin this week\nIn its latest observations, onchain analytics firm Glassnode revealed the lows coinciding with the realized price of large tranches of the BTC supply.\n“For now, $BTC seems to have found support at $74K. This aligns with the first major supply cluster below $80K - over 50K $BTC at $74.2K,” it reported on X. \nBitcoin supply cost basis data. Source: Glassnode\/X\nGlassnode added that between the lows and $70,000 was another 175,000 BTC of “cost basis clusters.”\n“The single largest level within this range is $71.6k, holding ~41k $BTC. The next more substantial support sits at $69.9k, where ~68k $BTC are held,” it confirmed.\nAs Cointelegraph reported, $69,000 and the area nearby is seen as a reliable long-term BTC price support zone which is statistically unlikely to break down.\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\n","date":1744039759895,"authors":[],"image_url":"","scraped_at":"2025-04-07T15:29:19.895796"}