{"id":"2a0abf444c286a4fc02534da110cbd42","source":"Cointelegraph","title":"Michael Saylor’s Strategy to raise up to $21B to purchase more Bitcoin","url":"https:\/\/cointelegraph.com\/news\/michael-saylor-strategy-raise-21-billion-purchase-bitcoin","content":" Currently holding around 499,000 BTC, Michael Saylor’s Strategy plans to keep stacking Bitcoin with its new “ATM Program.” \nMichael Saylor’s Strategy, the world’s largest public corporate Bitcoin holder, is looking to raise up to $21 billion in fresh capital to purchase more BTC.\nOn March 10, Strategy officially announced that it entered into a new sales agreement that would allow the firm to issue and sell shares of its 8% Series A perpetual strike preferred stock to raise funds for general corporate purposes, including potential Bitcoin (BTC) acquisitions.\nAs part of the agreement deal, dubbed the “ATM Program,” Strategy expects to make sales “in a disciplined manner over an extended period,” taking into account the trading price and volumes of the perpetual strike preferred stock at the time of sale.\n“Strategy intends to use the net proceeds from the ATM Program for general corporate purposes, including the acquisition of Bitcoin and for working capital,” the firm said in the filing with the Securities and Exchange Commission (SEC).\nThe announcement comes amid Strategy holding 499,096 BTC ($41.2 billion), which it acquired for an aggregate amount of $33.1 billion at an average price of $66,423 per BTC.\nThe company previously disclosed plans to issue and sell shares of its class A common stock to raise up to $21 billion in equity and $21 billion in fixed-income securities over the next three years in order to accumulate more Bitcoin under its “21\/21 plan.”\nThis is a developing story, and further information will be added as it becomes available.\nMagazine: Crypto has 4 years to grow so big ‘no one can shut it down’: Kain Warwick, Infinex\n","date":1741616522560,"authors":[],"image_url":"","scraped_at":"2025-03-10T14:22:02.560808"}