{"id":"2b82b542fc133422bdf83b934b1df78e","source":"Cointelegraph","title":"Crypto ETPs shed $240M last week amid US trade tariffs — CoinShares","url":"https:\/\/cointelegraph.com\/news\/crypto-etp-shed-240-million-us-trade-tariffs-coinshares","content":" Year-to-date outflows from crypto ETPs by Grayscale are now bigger than all Bitcoin inflows in 2025 so far, totaling roughly $1.4 billion. \nCryptocurrency exchange-traded products (ETPs) saw renewed outflows last week, with $240 million in investor capital pulled, according to an April 7 report from digital asset manager CoinShares.\nThe outflows reversed two consecutive weeks of inflows that totaled $870 million, leaving total digital asset ETP holdings at about $133 billion, CoinShares reported.\nThe new outflows likely reflect investor caution in response to global trade tariffs imposed by the United States and concerns over their potential threat to global economic growth, CoinShares head of research James Butterfill said.\nWeekly crypto ETP flows since late 2024. Source: CoinShares\nBitcoin (BTC) ETPs led the downturn, with $207 million in weekly outflows. As a result, monthly flows turned negative for the first time this year, with $138 million in net outflows in the past 30 days.\nDespite monthly outflows turning red, Bitcoin ETPs still maintain a significant amount of inflows year-to-date, totaling $1.3 billion, according to CoinShares data.\nFlows by asset (in millions of US dollars). Source: CoinShares\nEther (ETH)-linked ETPs also saw $38 million in weekly outflows but continued to hold $279 million in YTD inflows.\nMulti-asset ETPs and short Bitcoin ETPs saw $144 million and $26 billion in YTD outflows, respectively, despite minor inflows last week.\nCryptocurrency ETPs by major crypto investment firm Grayscale Investments led the losses among issuers last week, with $95 million withdrawn from its products.\nGrayscale’s year-to-date outflows now stand at $1.4 billion, the highest among all ETP providers tracked, according to CoinShares data.\nRelated: Grayscale launches two new Bitcoin outcome-oriented products\nFlows by issuer (in millions of US dollars). Source: CoinShares\nMeanwhile, iShares ETFs by BlackRock still maintained $3.2 billion in YTD inflows after seeing $56 million in outflows last week.\nCrypto ETPs by ProShares and ARK Invest are the only two other major issuers that still have inflows YTD, amounting to $398 million and $146 million, respectively.\nMagazine: Bitcoin heading to $70K soon? Crypto baller funds SpaceX flight: Hodler’s Digest, March 30 – April 5\n","date":1744039774081,"authors":[],"image_url":"","scraped_at":"2025-04-07T15:29:34.081146"}