{"id":"2e146482a6eadc0e3d9e7d62aa7a43bf","source":"Cointelegraph","title":"Bitcoin DeFi surge may boost BTC demand and adoption — Binance","url":"https:\/\/cointelegraph.com\/news\/bitcoin-demand-skyrocket-2-700-bitcoin-defi-surge","content":" The growing BTCFi sector and potential interest rate cuts on the horizon may create more demand for Bitcoin as a productive, yield-bearing asset. \nThe value locked in Bitcoin-based decentralized finance (BTCFi) has surged by more than 2,700% over the past year, potentially transforming Bitcoin from a passive store of value into a productive, yield-bearing asset, according to new research from Binance.\nBTCFi is a new technological paradigm that aims to bring decentralized finance capabilities to Bitcoin’s base layer. It is one of the fastest-growing crypto sectors, reaching a total value locked (TVL) of over $8.6 billion.\nThe growing value of BTCFi, “along with potential interest rate cuts, may reinforce positive sentiment for Bitcoin in the medium and long term,” Binance Research wrote in a report shared with Cointelegraph.\nBitcoin DeFi, total value locked, 2025 chart. Source: Binance Research\nIf the BTCFi sector’s growth trajectory continues, it could open up “new opportunities for Bitcoin holders to generate yield through lending, liquidity provision, and other DeFi mechanisms,” a Binance spokesperson told Cointelegraph, adding:\nRelated: Bitcoin price can hit $250K in 2025 if Fed shifts to QE: Arthur Hayes\nInterest in BTCFi surged after April 2024’s Bitcoin halving, which introduced the Runes protocol, the first fungible token standard on the Bitcoin blockchain.\nSeveral Bitcoin-native projects have helped accelerate the trend. \nBabylon introduced Bitcoin (BTC) staking for the first time in the network’s history, enabling holders to earn passive income from their assets.\nHermetica launched the first Bitcoin-backed synthetic dollar, USDh, which debuted with a 25% yield for investors.\nRelated: Crypto trader turns $2K PEPE into $43M, sells for $10M profit\nLong-term Bitcoin holders have restarted their BTC accumulation after the BTC supply held by long-term holders bottomed in February.\nBTC supply held by long-term holders. Source: Glassnode, Binance Research\nLong-term holders are wallets that have been holding BTC for at least 155 days. Growing accumulation from long-term holders has reduced the available Bitcoin supply on exchanges, which may eventually lead to a supply shock-driven price rally.\nThe growing accumulation trend among long-term holders aligns with a “significant period of adoption for Bitcoin,” due to the establishment of the US strategic Bitcoin reserve and growing institutional interest, according to the research report.\nSource: Margo Martin\nOn March 7, US President Donald Trump signed an executive order to create a strategic Bitcoin reserve using BTC seized from government criminal cases.\nTrump signed the historic Bitcoin reserve order a day ahead of hosting the first White House Crypto Summit, which received mixed reactions from the crypto community.\nMagazine: Bitcoiner sex trap extortion? BTS firm’s blockchain disaster: Asia Express\n","date":1743784136113,"authors":[],"image_url":"","scraped_at":"2025-04-04T16:28:56.113328"}