{"id":"3271329d1e6b2ee41a54e55a029001bf","source":"Cointelegraph","title":"Here’s why chasing trends can be a costly mistake: X Spaces with VCs","url":"https:\/\/cointelegraph.com\/news\/heres-why-chasing-trends-can-be-a-costly-mistake-x-spaces-with-vcs","content":" DePIN, decentralized AI, the shift from EVM blockchains and regulatory changes under the new US administration are key trends to follow in 2025. And venture capitalists already took a position. \n\nRestructuring business models in traditional organizations, AI is increasingly adopted in Web3 as well, with new integrations announced each day. Is this a lasting trend that will provide value and opportunities for years to come, or just another passing hype?\nCointelegraph Accelerator recently hosted a roundtable discussion on X Spaces, bringing together venture capitalists to find an answer. Nikola Santoni, partner at Lemniscap; Ivan Li, founding partner at Comma3 Ventures and Michael Zajko, co-founder of Lattice, shared insights on the current state of the crypto investments, key trends and factors that will shape the landscape in 2025.\n🔥 Missed our Web3 & crypto AMA? Here’s the TL|DR:✅ Top industry verticals for 2025✅ Most promising startups to watch✅ Biggest barriers to mass adoption🎙️ Catch the recap our X Spaces w\/ @comma3vc, @Lemniscap & @MikeZajko🔗 Listen now: https:\/\/t.co\/qNHr1rvNiD\nNikola Santoni began by emphasizing the importance of assessing future demand rather than chasing current trends. “Obviously, the intersection of crypto and AI, with AI agents, has accelerated tremendously, which is impossible to ignore. But what stands out is how quickly the narratives and attention spans are changing, from retail investors to the media to institutional investors. This is what we need to be aware of when investing.”\nShedding light on Lemniscap’s approach, Santoni said the company focuses on identifying natural market demand and teams with potential for product development. “We tend to build conviction very early on. A key consideration is whether the product you originally envisioned makes sense in the long run,” he stated.\nAgreeing on the point, Michael Zajko said, “To be successful, you need to invest before something becomes a hot trend, not after.” He noted that venture investments typically have a 5-7-year timeline and pointed to some examples like DeFi Summer, where investing at the peak would have meant missing out on earlier opportunities like Uniswap and Aave.\n\"We are investing in something that may not be available for several years. This trend has played out year after year with DeFi, NFTs, gaming and now decentralized physical infrastructure networks (DePIN). We have been big proponents of DePIN, and there are many exciting projects,” Zajko explained, continuing: “But the path to market and token launch for a really high-quality project is much longer because they’re using real-world infrastructure. Some of the DePIN tokens are coming to market this year, and there’s going to be a lot of exciting opportunities in that space.”\nIvan Li echoed the same sentiment, saying, “It’s risky to chase all the chains. If you’re a trader in the open market, you can chase these narrative changes in the short term because there’s a lot of liquidity. But in primary investments, there is no liquidity, so it is a very risky game. The long timelines - three years to TGE and another year for lock-ups and vesting - only add to the risk. The key is to invest before a project gets off the ground.”\nLi said Comma3 Ventures doesn’t see a bright future for EVM-based blockchains and keeps the focus on somewhere else. “I suggest everyone take a closer look at Move-based blockchains like SUI. If you compare SUI to EVM, it’s like today’s Tesla to Ferrari 30 years ago. Our portfolio at Comma3 Ventures currently covers about 85-90% of the total value locked up in the entire SUI ecosystem.”\nZajko mentioned that the excitement around AI is largely due to its rapid development within Web2, but most AI-related projects in crypto today take a simplistic approach. “It’s a good way to speculate, and frankly, there’s still a very strong product-market fit in crypto for anything you can speculate on,” he said.\n“What stands out to me is that developers are taking a more cautious approach. I think they’re looking at what actually works and delivers long-term value rather than just launching a token for retail speculation. A lot of these projects won’t come out right away, but I do expect to see more advanced AI agents this year that do things that aren’t just tweeting,” Zajko added.\nAccording to the co-founder, AI can be divided into two main areas: “Enterprise AI includes decentralized compute projects like io.net and Render Network. Then you have the more retail-focused projects that are still in development. And there are a number of more platform-oriented projects that haven’t launched tokens on the enterprise side, like Ritual or Sentient. So I would expect to see a reemergence of that category. They’re coming out in the second half of the year, and their tokens should bring new energy to decentralized AI.”\nLi emphasized the double-edged nature of regulation, saying, “Without a clear legal framework, there will be issues with AML, taxes and even the ability to take innovative risks within a proper structure, which is a huge risk for founders and investors. On the other hand, regulation also opens the door to institutional capital, even from conservative sources such as pension funds.”\nFor Li, regulation is also a matter of global competition: \"It's a kind of game theory between countries. If the US regulates crypto and collects taxes, but the rules are too restrictive, people will move and innovate elsewhere. We could have problems with entrepreneurs leaving, and that's something to consider.\"\nZajko sees positive changes in the industry, especially with a more crypto-friendly approach from the new U.S. administration: \"With the new administration and new members of the SEC, and with enforcement actions like those against OpenSea and Coinbase being dropped, teams are starting to go back to the tactics and strategies they've always wanted to use, ones that are really beneficial to the space — like token sales, which are what made crypto. And teams are going back to them and selling to retail participants at attractive entry prices.\"\nHe highlighted the increasing institutional adoption of Bitcoin, saying, \"You're already seeing government reserves and government treasuries being proposed to deposit in Bitcoin. The people who are making these decisions right now tend to be from an older generation. It's not so much that they need to be convinced; it's just that over time, they will pass out of power and younger people who are already comfortable with digital assets will take over. Whether the current leadership eventually embraces digital assets or simply transitions out of their roles, the outcome seems inevitable.\"\n\"It's just a matter of when, not if,\" Zajko concluded.\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice. \n","date":1741691717084,"authors":[],"image_url":"","scraped_at":"2025-03-11T11:15:17.084050"}