{"id":"34c35ca8a74861a6d9a5204084db8b40","source":"Cointelegraph","title":"Darknet marketplace wallet with over $400M BTC awakens after 9 years","url":"https:\/\/cointelegraph.com\/news\/darknet-marketplace-wallet-400m-btc-awakens-9-years","content":" The wallet went dormant with 5,000 BTC after the marketplace, which facilitated drug and weapons sales, went down in April 2016. \nA crypto wallet holding over $400 million in Bitcoin (BTC) linked to the darknet marketplace Nucleus has awakened after nine years, according to Arkham Intelligence. On March 7, the entity controlling the wallet moved $77.5 million in BTC to three new addresses, leaving $365 million in the primary wallet.\nThe wallet had been dormant since April 2016, when the marketplace shut down with  5,000 BTC from vendor and customer deposits. At the time, the funds were worth roughly $2.1 million, according to Arkham’s tracker.\nRelated: Who is the mysterious Bitcoin creator, Satoshi Nakamoto?\nNucleus was one of many darknet marketplaces that proliferated around that time, facilitating the sale of drugs, weapons and other contraband. While the official story surrounding its shutdown was that it was hacked, conspiracy theories swirled. Some thought that the Nucleus site admins were executing an exit scam, while others believed that the admins had been arrested.\nTransactions on Nucleus, like for many other darknet marketplaces, were made largely in Bitcoin, as the cryptocurrency was harder to track and, therefore, offered some level of anonymity for those engaged in such activities.\nThe reawakening of Nucleus’ wallet came a day after US President Donald Trump signed an executive order creating a strategic Bitcoin reserve in the United States. The BTC for the reserve will initially come from crypto already seized through forfeitures, although there is room for “budget-neutral” acquisitions of more coins.\nSince the beginning of 2023, the price of Bitcoin has risen significantly. It jumped from less than $17,000 per coin in January 2023 and has since hit an all-time high of around $108,000.\nDuring this bull run, many dormant wallets have awakened, some dating to the 2010s, like the Nucleus marketplace wallet. In July 2023, an 11-year dormant wallet with 1,037 BTC awoke, with the owner moving the entire stash.\nIn 2024, other dormant wallets followed. In May 2024, three Satoshi-era wallets awoke, with one moving 687 BTC and two others moving 1,000 BTC, worth $61 million at the time. In June 2024, a whale transferred 8,000 BTC from a five-year dormant wallet, and in September 2024, five miner wallets from the Satoshi era awakened after 15 years and started to move their coins.\nThere may be an interesting development on the horizon as well: Tether CEO Paolo Ardoino said that quantum computing could lead to hackers breaking into early Bitcoin wallets, leading to more presumed “lost” coins coming back into circulation.\nMagazine: Bitcoin vs. the quantum computer threat — Timeline and solutions (2025–2035)\n","date":1741454987092,"authors":[],"image_url":"","scraped_at":"2025-03-08T17:29:47.092807"}