{"id":"3646b3a6fd4593a23065156ab4dba471","source":"Cointelegraph","title":"West Virginia's BTC reserve bill is 'freedom' from a CBDC — State Senator","url":"https:\/\/cointelegraph.com\/news\/west-virginia-s-btc-reserve-bill-freedom-from-a-cbdc-state-senator","content":" West Virginia's Bitcoin bill seeks to allow the state treasurer to invest up to 10% of state funds in BTC, stablecoins and precious metals. \nWest Virginia’s Bitcoin (BTC) strategic reserve bill would give the state more sovereignty from the federal government and freedom from a potential central bank digital currency (CBDC), State Senator Chris Rose told Cointelegraph in an exclusive interview.\n“You hear these rumors that there are people at the federal government that will want to have a central bank digital currency,” Rose said. “And people don’t want that. People want decentralized currency. They want freedom.”\nThe bill, introduced in February, seeks to allow the state treasury to invest up to 10% of public funds in precious metals like gold and silver, stablecoins, or any digital asset that has had a $750 million market capitalization or higher over the last 12 months. Currently, the only digital asset with such a market cap is Bitcoin.\nWest Virginia State Senator Chris Rose. Source: Cointelegraph\nRose, the bill's sponsor, said that the reason they decided on the market cap requirement was to allow the state to have exposure to cryptocurrency, but not to get trapped “in any things like memecoins.”\nAdopting Bitcoin on the state level would “give us a little more state sovereignty,” Rose added. “And I think that’s one reason why you see a lot of people who normally buy [Bitcoin] for themselves want to see their state government do the same.”\nHe added that a 10% allocation of state funds would be a “good way to introduce [Bitcoin] to the state” while avoiding any fear from people who don’t understand digital assets. “It’s a good way to cap that where they feel comfortable, but also give us at least a decent exposure as well.”\nRose said that one of the roadblocks to getting the bill passed is fear, in particular among those who don't understand cryptocurrency. “Just like any other state, we have people who understand it. We also have people that don’t understand it, and people are always afraid of what they don’t know.”\nHe added that “once they understand it, they realize it’s a very powerful investment tool and freedom tool for every one of us to adopt.”\nExcerpt of West Virginia Bitcoin reserve bill. Source: West Virginia Legislature\nWest Virginia Governor Patrick Morrisey, who has envisioned a future state economy powered by crypto and other tech, won’t be a roadblock, Rose said. And the state treasurer, whom Rose consulted before introducing the bill, won’t either.\nHowever, according to WVNews, a West Virginia publication, some lawmakers and financial experts remain skeptical. Investing state funds into Bitcoin may be risky due to the asset’s volatility and price swings, which can cause financial instability and make Bitcoin a controversial choice for state investments.\nAlthough Bitcoin strategic reserve bills have been popping up in state legislatures around the United States, some bills have failed to pass or have scrapped key provisions, including some of those in traditionally conservative states.\nCurrently, 47 strategic Bitcoin reserve bills have been introduced in 26 states according to Bitcoin Laws. While, in most of the states, the bills have only been introduced or referred to committees, some have made headway in three: Arizona, Oklahoma, and Texas.\nRelated: Texas Senate passes Bitcoin strategic reserve bill\nRose clarified that the 10% of state funds allocated to precious metals, stablecoins, or Bitcoin would be sourced from two key areas.\n“It would be the assets under the pensions fund and under the severance tax fund,” Rose said. “They would be able to divest some of those ETF funds into these assets. We wanted to keep it separate from the petty cash fund, which is day-to-day, just paying the bills of the state. We wanted to keep it to our longer-term assets,” he added.\nMagazine: X Hall of Flame, Benjamin Cowen: Bitcoin dominance will fall in 2025\n","date":1743703815732,"authors":[],"image_url":"","scraped_at":"2025-04-03T18:10:15.732589"}