{"id":"372e7281568a0c81a9e190f201a3308d","source":"Cointelegraph","title":"Trump firing Powell would be a ‘very bad precedent to set’ — Pompliano","url":"https:\/\/cointelegraph.com\/news\/united-states-donald-trump-jerome-powell-consequences-firing-federal-reserve","content":" Anthony Pompliano agrees with critics claiming the Federal Reserve isn’t truly independent but says firing its chair will just make things worse. \nCrypto entrepreneur Anthony Pompliano says that US President Donald Trump shouldn’t follow through on his recent threat to fire the head of the US Federal Reserve, saying it would set a dangerous precedent — especially considering the true motive behind it.\n“I do not believe that the President of the United States should come in and unilaterally fire the Fed President,” Pompliano said in a video posted on X on April 18.\nPompliano said, “Where you have a disagreement and then the firing, I think that’s not really the area that we want to go into.”\nIt comes after Trump took to his social media platform Truth Social to accuse Fed chair Jerome Powell of being too slow to cut interest rates. “Powell’s termination cannot come fast enough!” Trump said on April 17.\nPompliano explained that while the Fed is meant to operate independently, he agrees with critics who argue it’s not truly independent. “The Fed, I think, is highly politicized, even though they pretend not to be,” he said.\nPompliano acknowledged his own criticism of the Fed, saying he's not exactly a fan, but emphasized that even if the Fed has made mistakes, responding in kind isn't the right approach.\n“I still think that just because somebody else is doing something wrong doesn't mean that you should do something wrong,” Pompliano said.\nUS Senator Elizabeth Warren recently warned that if Trump eventually moves to fire Powell, it could undermine investor confidence in the integrity of US capital markets and trigger a financial crash. \n“A big part of our economy strong, and a big part of the world economy strong, is the idea that the big pieces move independently of politics,” Warren said during an appearance on CNBC.\nRelated: Fed’s Powell reasserts support for stablecoin legislation\nLower interest rates often lead to increased liquidity, which has historically led to higher prices of perceived riskier assets like Bitcoin and other cryptocurrencies.\nIt comes not long after Powell said establishing a stablecoins legal framework was a “good idea.” \nIn an April 16 panel at the Economic Club of Chicago, Powell said, “The climate is changing, and you’re moving into more mainstreaming of that whole sector, so Congress is again looking [...] at a legal framework for stablecoins.”\nMagazine: Your AI’ digital twin’ can take meetings and comfort your loved ones\n","date":1745068601307,"authors":[],"image_url":"","scraped_at":"2025-04-19T13:16:41.307841"}