{"id":"3906a6941966894813cd88a0ec3a2071","source":"Cointelegraph","title":"US will use stablecoins to ensure dollar hegemony — Scott Bessent","url":"https:\/\/cointelegraph.com\/news\/us-stablecoins-ensure-dollar-hegemony-scott-bessent","content":" President Trump and Scott Bessent both called for a comprehensive regulatory framework on stablecoins and a clear regulatory environment. \nUnited States Treasury Secretary Scott Bessent said the US government will use stablecoins to ensure that the US dollar remains the world’s global reserve currency during the White House Crypto Summit on March 7.\nBessent reiterated the Trump administration’s promise to end the war on crypto and committed to rolling back previous IRS guidance and punitive regulatory measures. Bessent then turned his attention to stablecoins and said:\nPresident Trump told the summit that he hopes lawmakers will get a comprehensive stablecoin regulatory bill to his desk before the August Congressional recess.\nPresident Trump delivers address to White House Crypto Summit. Source: The Associated Press\nThe President was also critical of the Biden administration for selling portions of the seized Bitcoin (BTC), which he said amounted to billions in losses through premature selling.\nMany of the attendees of the first White House Crypto Summit remarked on the historic nature of the event, which cements a seismic shift in the US government’s stance toward the digital asset industry.\nAttendees of the White House Crypto Summit. Source: The Associated Press\nRelated: Trump’s crypto summit ‘not going to have anything on taxes’ — White House official\nOvercollateralized stablecoins, which use short-term US Treasury bills and cash deposits to back their digital fiat tokens and thus drive demand for US debt instruments, have been pitched as a way to extend US dollar dominance.\nFederal Reserve Governor Christopher Waller also voiced support for using stablecoins to prop up the dollar in February 2024.\nWaller argued that the corrosive effect of cryptocurrencies on the market share of the US dollar would be mitigated by stablecoin demand.\nTreasury Secretary Scott Bessent says stablecoins will ensure US dollar hegemony at the White House Crypto Summit. Source: The Associated Press\nIn February 2025, Waller reiterated his stance that stablecoins could help preserve the dollar's status as the global reserve currency by overcoming capital controls in foreign countries and enhancing payment rails.\nAs part of this effort to leverage stablecoins to defend the US dollar, US representatives French Hill and Bryan Steil introduced a stablecoin bill titled the Stable Act of 2025 to establish a comprehensive regulatory framework for dollar-pegged digital fiat tokens.\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n","date":1741454983757,"authors":[],"image_url":"","scraped_at":"2025-03-08T17:29:43.757332"}