{"id":"3a592b3e4fe5932cbd6f9bf3c67e4b2a","source":"Cointelegraph","title":"Crypto bull market ‘hasn't started yet’ — LONGITUDE panel","url":"https:\/\/cointelegraph.com\/news\/crypto-bull-market-hasnt-started-yet-longitude-panel","content":" Messari CEO Eric Turner says the crypto bull market will ramp up in the third quarter of 2025. \nCrypto’s worst quarter since the FTX crisis has many investors worried about the end of the bull market, but according to an industry panel, Bitcoin and altcoins’ parabolic moves haven’t even begun yet. \nIn a panel discussion at the LONGITUDE by Cointelegraph event in Paris, France, MN Capital founder Michael van de Poppe said he thinks the bull market is “actually getting started from this point.” \nWhile it’s hard to believe that following Bitcoin’s (BTC) recent plunge below $80,000 on global tariff woes, “we know from history” that chaotic sell-offs create favorable conditions for a reversal, he said.\nVan de Poppe drew parallels between the current market dump and the COVID-19 crash in 2020, when Bitcoin plunged by nearly 40% in a single day.\n“That was the actual bottom, and since then, Bitcoin went 20x,” said van de Poppe. \nCointelegraph Managing Editor Gareth Jenkinson, left, moderates a panel with three crypto experts in Paris, France, on April 7. Source: Cointelegraph\nMessari CEO Eric Turner agreed, saying, “We never had a bull market,” but rather “two sides of the market.” \n“We had Bitcoin where all the flows went into [exchange-traded funds]” and “then you have pockets of things,” such as the memecoin frenzy and other short-term trends, he said.\n“I actually think the real question is, when does the bull market come? If you ask me, that’s going to be Q3, Q4 of this year,” said Turner.\nBeyond short-term price action, it helps to look at the big picture, especially in the United States, said John Patrick Mullin, the co-founder and CEO of Mantra. Mullin said he’s “excited” about all of the favorable policy tailwinds coming from the United States, including the Executive Branch.\nRelated: VC Roundup: 8-figure funding deals suggest crypto bull market far from over\nUS President Donald Trump is overseeing an overhaul of crypto regulations in Washington, with lawmakers moving closer to passing landmark stablecoin and market structure bills. \nTrump has also appointed pro-crypto leaders to various positions, chief among them being Paul Atkins, who recently moved one step closer to securing the nomination as chair of the Securities and Exchange Commission.\nHowever, these positive developments have failed to kickstart the bull market or bring meaningful capital flows into the industry, largely because Trump’s other agenda items — namely, tackling perceived trade imbalances — have triggered growth fears. \nTrump’s “Liberation Day” tariffs on April 2 were perceived by many investors as an egregious attempt to rewrite the terms of global trade, as they went beyond the 10% universal tariff proposed initially. \nSource: Andrea Junker\nThe tariff announcement triggered the largest exodus from US stocks since the COVID-19 pandemic. \nHowever, if past crises like COVID-19 are anything to go by, the US Federal Reserve will likely step in at some point to backstop the market should things get progressively worse.\n“[...] If you go back in time with another crisis and at some point the Fed steps in to lower the rates and to print money to stimulate the internal economy,” van de Poppe said during the panel discussion.\n“So, it’s going to happen. The question is when,” said van de Poppe.\nMagazine: Bitcoin heading to $70K soon? Crypto baller funds SpaceX flight: Hodler’s Digest, March 30 – April 5\n","date":1744105263943,"authors":[],"image_url":"","scraped_at":"2025-04-08T09:41:03.943039"}