{"id":"3bc2f070255d18ba676f158397602c7b","source":"Cointelegraph","title":"Alabama, Minnesota lawmakers join US states pushing for Bitcoin reserves","url":"https:\/\/cointelegraph.com\/news\/minnesota-alabama-bitcoin-investment-bills","content":" Bills to create Bitcoin reserves have been introduced in 26 states, with Arizona currently the closest to passing a law. \nLawmakers in the US states of Minnesota and Alabama filed companion bills to identical existing bills that if passed into law, would allow each state to buy Bitcoin.\nThe Minnesota Bitcoin Act, or HF 2946, was introduced to the state’s House by Republican Representative Bernie Perryman on April 1, following an identical bill introduced on March 17 by GOP state Senator Jeremy Miller.\nMeanwhile, on the same day in Alabama, Republican state Senator Will Barfoot introduced Senate Bill 283, while a bi-partisan group of representatives led by Republican Mike Shaw filed the identical House Bill 482, which allows for the state to invest in crypto, but essentially limits it to Bitcoin (BTC).\nMinnesota’s Bitcoin Act would allow the state’s investment board to invest state assets in Bitcoin and other cryptocurrencies and permit state employees to add crypto to retirement accounts.\nIt would also exempt crypto gains from state income taxes and give residents the option to pay state taxes and fees with Bitcoin.\nSource: Bitcoin Laws\nThe twin Alabama bills don’t explicitly identify Bitcoin, but would limit the state’s crypto investment into assets that have a minimum market value of $750 billion, a criterion that only Bitcoin currently meets.\nIntroducing identical bills is not uncommon in the US and is typically done to speed up the bicameral legislative process so laws can pass more quickly.\nBills to create a Bitcoin reserve have been introduced in 26 US states, with Arizona currently the closest to passing a law to make one, according to data from the bill tracking website Bitcoin Laws.\nArizona currently leads in the US state Bitcoin reserve race. Source: Bitcoin Laws\nPennsylvania was one of the first US states to introduce a Bitcoin reserve bill, in November 2024. However, the initiative was reportedly eventually rejected, with similar bills also killed in Montana, North Dakota, South Dakota and Wyoming.\nRelated: North Carolina bills would add crypto to state’s retirement system \nMontana, North Dakota, Pennsylvania, South Dakota and Wyoming are the five states thathave  rejected Bitcoin reserve initiatives. Source: Bitcoin Laws\nAccording to a March 3 report by Barron’s, “red states” like Montana have faced setbacks to the Bitcoin reserve initiatives amid political confrontations between the Democratic Party and the Republican Party.\nAdditional reporting by Helen Partz.\nMagazine: Financial nihilism in crypto is over — It’s time to dream big again\n\n\n","date":1743703801690,"authors":[],"image_url":"","scraped_at":"2025-04-03T18:10:01.690488"}
