{"id":"3f736f81be92ca52a376ed7a2aa8c204","source":"Cointelegraph","title":"Fed not cutting rates 'at all' in 2025 may trigger a bear market — Analyst","url":"https:\/\/cointelegraph.com\/news\/federal-reserve-rate-cuts-delay-may-trigger-bear-market-analyst","content":" Network economist Timothy Peterson's model suggests Bitcoin could bottom at $57,000 in the next bear market, but he said it’s unlikely as too many investors \"hover over Bitcoin like vultures.\" \nNetwork economist Timothy Peterson warns that if the US Federal Reserve holds off on rate cuts in 2025, it may cause a broader market downturn, potentially dragging Bitcoin back toward $70,000.\n“What it needs is a trigger. I think that trigger may be as simple as the Fed not cutting rates at all this year,” Peterson said in a March 8 X post. Peterson’s comment comes just a day after Federal Reserve chair Jerome Powell reiterated that he's in no hurry to adjust interest rates.\n\"We do not need to be in a hurry and are well-positioned to wait for greater clarity,” Powell said in a speech in New York on March 7.\nSource: Timothy Peterson\nPeterson, who is the author of the paper “Metcalfe’s Law as a Model for Bitcoin’s Value,” estimated how low the Nasdaq could fall to predict Bitcoin’s (BTC) potential bottom in “the next bear market.”\nUsing Peterson’s Nasdaq lowest price forward model, he estimated that once the bear market begins, the Nasdaq would decline 17% over roughly seven months before finding a bottom.\nApplying a “1.9” times multiplier to that amount for Bitcoin’s decline, he estimated a 33% decline in Bitcoin, bringing it down to $57,000 from its current price at publication, $86,199, according to CoinMarketCap data.\nSource: Timothy Peterson\nHowever, he said Bitcoin likely won’t drop that far, expecting a floor price closer to the low $70,000 range based on historical trends from 2022.\n“Traders and opportunists hover over Bitcoin like vultures,” he said, explaining that once the market expects Bitcoin to hit $57,000, “it won’t get there because there are always some investors who step in because the price is ‘low enough.”\n“I remember in 2022 when everyone said the bottom would be $12k.  It only went to $16k, 25% higher than expected,” he said before pointing out that the 25% increase from $57,000 is $71,000. \nThe last time Bitcoin traded near the $71,000 price level was on Nov. 6, after Donald Trump won the US election, before rallying for a month and reaching $100,000 by Dec. 5.\nRelated: Bitcoin investors share mixed reactions to White House Crypto Summit\nIn January 2025, BitMEX co-founder Arthur Hayes echoed a similar price prediction.\n“I am calling for a $70k to $75k correction in BTC a mini financial crisis, and a resumption of money printing that will send us to $250k by the end of the year,” Hayes said in a Jan. 27 X post.\nIn December 2024, crypto mining firm Blockware Solutions said Bitcoin’s “bear case” for 2025 would be $150,000, assuming the Federal Reserve reverses course on interest rate cuts.\nMagazine: Meet lawyer Max Burwick — ‘The ambulance chaser of crypto’\n","date":1741531239412,"authors":[],"image_url":"","scraped_at":"2025-03-09T14:40:39.412784"}