{"id":"3fc6137fb4ad435b08efb98e9389adf5","source":"Cointelegraph","title":"How long will Bitcoin’s price consolidation last?","url":"https:\/\/cointelegraph.com\/news\/how-long-will-the-bitcoin-consolidation-last","content":" Bitcoin’s price consolidation looks set to continue as neutral funding rates and macroeconomic uncertainty highlight indecisiveness among traders. \nBitcoin (BTC) price has been consolidating in a wide range between $80,000 to $88,500 since March 12. \nData suggests that Bitcoin’s consolidation may continue for some time, with onchain indicators pointing to the continuation of the “broader downtrend.” The key question that remains is when Bitcoin’s consolidation will end.\nBTC\/USD daily chart. Source: Cointelegraph\/TradingView\nOne of the clearest signs that there is more choppy price action ahead for Bitcoin is the presence of muted funding rates in the BTC futures markets.\nKey points:\nFunding rates are periodic payments made between long and short traders in perpetual futures contracts to keep prices aligned with the spot market.\nWhen this metric turns negative, it means short sellers are paying long holders, indicating that bearish sentiment dominates.\nBTC funding rates have been oscillating around 0% since late February, indicating indecisiveness dominates the market.\nBTC perpetual futures funding rates across all exchanges. Source: Glassnode\nWhen funding rates are zero, the cost of holding positions is minimal, reducing pressure on traders to exit longs or shorts and leading to price consolidation.\nCommenting on the funding rate, crypto analyst Axel Adler Junior said that Bitcoin’s average funding rate on major exchanges “has dropped into negative territory,” currently sitting just above zero.\nAccording to the analyst, positive signals from the US Federal Reserve and the Trump administration could renew fresh inflows into the market, “potentially triggering the start of a new rally.”\nSeveral onchain metrics suggest Bitcoin’s April 2 rally to $87,500 was just a “relief rally within a broader downtrend rather than the beginning of a sustained reversal,” according to market intelligence firm Glassnode.\nIn its latest market report, Glassnode found that the 90-day simple moving average of Bitcoin’s Realized Profit\/Loss Ratio had declined significantly since January, despite repeated rallies in the $76,000–$80,000 range.\nThese brief profit-driven surges have failed to end the ongoing consolidation, suggesting that the “macro picture remains one of generally weaker liquidity and deteriorating investor profitability,” it said.\nBitcoin: Realized profit and loss ratio. Source: Glassnode\nAn accompanying chart shows data from the onchain volume-weighted prices metric, which calculates a price level weighted by the volume of coins moved onchain over a specific timeframe.\nUsing this, Glassnode can compare when and how much capital was actually moved in the last 1 month compared to the last 6 months, giving a direct reflection of market trends.\nThe recent cross-over of the short-term 1-month average below the long-term 6-month price indicates an onchain “death cross,” Glassnode said.\nBitcoin: Realized price inter-cycle cohort age. Source: Glassnode\nAnticipation of a breakout in BTC price lingers in the background, as suggested by Bitcoin’s volatility indicator.\nKey points:\nTightening Bollinger Bands conditions indicate that a breakout might be very close.\nThe weekly Bollinger Bandwidth is at an extremely oversold level, touching its lower green line.\nThe width of the Bollinger Bands is as tight as it was between July 2024 and November 2024 when it consolidated between $55,000 and $69,000, the 2021 all-time high.\nBTC\/USD then rallied 60% from $67,500 in October 2026 to its previous high of $106,000 reached in December 2024.\nThe indicator was also this tight between July 2023 and October 2023, preceding a 176% rally in BTC price from $24,400 to $73,800 on March 14, 2024.\nBTC\/USD daily chart. Source: Cointelegraph\/TradingView\nIf history repeats itself, Bitcoin could soon break out of consolidation to stage a massive upward move over the next few weeks.\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1743703788319,"authors":[],"image_url":"","scraped_at":"2025-04-03T18:09:48.319853"}