{"id":"461cdf1b145c2de1f0fb97fde28aa9a3","source":"Cointelegraph","title":"Bitcoin drops 8%, US markets shed $2T in value — Should traders expect an oversold bounce?","url":"https:\/\/cointelegraph.com\/news\/bitcoin-drops-8-us-markets-shed-2-t-in-value-should-traders-expect-an-oversold-bounce","content":" Crypto and stock markets took heavy losses throughout the US trading session. Should traders expect a relief rally due to oversold conditions? \nBitcoin (BTC) and US stock markets all sold off sharply after US President Donald Trump shook up financial markets by announcing a list of reciprocal tariffs on several countries. \nOn April 3, the S&P 500 saw a 4.2% drop at market open, its most significant single-day decline since June 2020. The Dow Jones Industrial Average fell 3.41%, to 40,785.41 from 42,225.32, while the Nasdaq Composite dropped 5.23%. Overall, $1.6 trillion in value was wiped out from US stock at the market open. \nBitcoin’s value dropped by 8%, but a positive is bulls seem capable of defending the $80,000 support level. These steep declines essentially stem from uncertainty surrounding the new tariffs and amplify investors’ concerns about impending recession.\nSource: X\nData from CoinGecko suggests that the total crypto market has dropped 6.8% over the past 24 hours and it seems unlikely that a relief rally is viable in the short-term.\nRelated: Bitcoin price risks drop to $71K as Trump tariffs hurt US business outlook\nAccording to CoinGlass, in the past 24 hours, more than 200,000 traders were liquidated, with the total amount exceeding $573.4 million. The largest liquidation occurred on Binance, with an ETH\/USDT position worth $11.97 million being force closed.\nTotal crypto liquidation chart. Source: CoinGlass\nMeanwhile, Bitcoin’s open interest dropped below $50 billion, reducing market leverage. Joao Wedson, CEO of Alphractal, mentioned that the liquidation heatmaps indicate heavy leverage around $80,000, raising the potential for a potential drop to $64K-$65K if Bitcoin breaks this level with high trading volume.\nBitcoin liquidation maps. Source: X\nRelated: Trump 'Liberation Day' tariffs create chaos in markets, recession concerns\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1743722076567,"authors":[],"image_url":"","scraped_at":"2025-04-03T23:14:36.567676"}