{"id":"4a2f60c8c01f78fa55f1cd10a10d8a09","source":"Cointelegraph","title":"‘We’ve decided Bitcoin is scarce, it’s valuable’ for US strategic reserve — David Sacks","url":"https:\/\/cointelegraph.com\/news\/bitcoin-scarce-valuable-us-strategic-reserve-david-sacks","content":" Regarding ETH, SOL, XRP and ADA, “The president just mentioned the top five cryptocurrencies by market cap, so I think people are just reading into this a little bit too much,” said Sacks. \nWhite House crypto czar David Sacks has further elaborated on the US government’s decision to treat Bitcoin as a special reserve asset, calling it a “scarce” digital resource that could benefit the country over the long term. \nIn a March 7 interview with Bloomberg Technology, Sacks said, “We’ve decided that Bitcoin is scarce, it’s valuable, and that it’s strategic for the United States to hold on to this as a long-term reserve asset.”\nSacks was referring specifically to the roughly 200,000 Bitcoin (BTC) currently in the US government’s possession. However, he acknowledged that the exact number of BTC held by the government is unknown because there’s never been a comprehensive audit.\n“We’re going to do a full government-wide audit to find out what digital assets we actually have so they can be safeguarded and moved into a strategy that maximizes their long-term value,” he said.\nDavid Sacks said the US government will build a strategic digital asset stockpile. Source: Bloomberg Technology \nPresident Donald Trump’s March 6 executive order calling for a strategic Bitcoin reserve and digital asset stockpile directed federal agencies to conduct a full audit of their cryptocurrency holdings. \nRegarding the digital asset stockpile, “The difference there is that the secretary of the treasury [Scott Bessent] will exercise responsible stewardship over those assets, and he has the discretion to rebalance the portfolio or to sell items in that portfolio, but that’s not true for Bitcoin,” said Sacks.\nWith the Bitcoin reserve, the “goal is long-term preservation,” he said. “With the stockpile, the goal is [...] portfolio management, in essence.”\nSacks said the digital asset portfolio strategy could include the sale or even staking of digital assets based on the treasury secretary’s discretion. \nSacks didn’t single out any particular altcoin and cautioned against reading too much into President Trump’s March 2 announcement declaring Ether (ETH), Solana (SOL), XRP (XRP) and Cardano (ADA) as being part of the stockpile.\n“The president just mentioned the top five cryptocurrencies by market cap, so I think people are just reading into this a little bit too much,” said Sacks. Ultimately, a decision on which assets to include will depend on the government-wide audit.\nSource: David Sacks\nRelated: David Sacks laments US government’s sale of Bitcoin\nTrump’s executive order and Sacks’ commentary failed to provide a short-term boost to Bitcoin and crypto prices, but that could be about to change as markets fully dissect the significance of the latest US policy developments. \nJoe Kelly, CEO of Bitcoin financial services company Unchained, told Cointelegraph, “Markets may still exercise caution until we see the scale and strategy behind this accumulation, but the bigger picture isn’t about short-term price movements.” He added:\nAurelie Barthere, principal research analyst at Nansen, singled out one sentence from the executive order fact sheet as being “mildly bullish for BTC” in the short term: “The Secretaries of Treasury and Commerce are authorized to develop budget-neutral strategies for acquiring additional Bitcoin.”\n“Does this mean some potential asset swapping, say from euro to Japanese yen to Bitcoin?” asked Barthere. \nBeyond the executive order hype, Barthere said Bitcoin’s price action is being influenced by macroeconomic conditions, including the economy and potential changes to Federal Reserve policy.\n“The recent Bitcoin price pullback was unavoidable, as I forecasted at the beginning of the year, as the broader financial market needed to digest the impacts of Trump’s tariffs policy,” said CK Zheng, former global head of risk for Credit Suisse and founder of ZX Squared Capital. \n“I believe Bitcoin is currently in the process of bottoming out in the near term and will rebound through 2025 as more pro-crypto rules and regulations roll out,” Zheng said.\nZheng believes the strategic Bitcoin reserve may serve as a catalyst for future nation-state adoption. \nMagazine: Legal issues surround the FBI’s creation of fake crypto tokens\n","date":1741454990895,"authors":[],"image_url":"","scraped_at":"2025-03-08T17:29:50.895322"}