{"id":"4b6ceb348e8c48782b011cbcf718e0eb","source":"Cointelegraph","title":"First Trust launches Bitcoin strategy ETFs","url":"https:\/\/cointelegraph.com\/news\/first-trust-launches-bitcoin-strategy-etfs","content":" Exchange-traded funds offering structured exposure to Bitcoin's performance are becoming popular among traditional investors. \nFirst Trust Advisors has launched two Bitcoin (BTC) strategy exchange-traded funds (ETFs) designed to provide investors with Bitcoin exposure while capping losses and earning yield, the asset manager said. \nThe move comes amid an outpouring of funds seeking to enhance Bitcoin’s appeal to traditional investors by offering tailored exposure to the cryptocurrency’s performance.\nThe FT Vest Bitcoin Strategy Floor15 ETF (BFAP) is designed to track Bitcoin’s performance up to a capped upside while limiting drawdown risk to approximately 15%, First Trust said in an announcement.\n“Over the past few years, investors have shown a remarkably strong appetite for bitcoin-linked ETFs, but the potential for sharp drawdowns has kept many on the sidelines,” Ryan Issakainen, an ETF strategist at First Trust, said in a statement.\nFirst Trust launched two new Bitcoin strategy funds. Source: First Trust\nThe FT Vest Bitcoin Strategy & Target Income ETF (DFII) is an actively managed fund aiming to offer partial Bitcoin exposure while generating a yield that beats short-dated US Treasurys by at least 15%, according to the asset manager. \nThe DFII fund “will seek to take advantage of bitcoin’s high volatility to generate income by selling call options,” Issakainen said. The BFAP fund also uses financial derivatives to hedge downside risk. \nOptions are contracts granting the right to buy or sell — “call” or “put,” in trader parlance — an underlying asset at a certain price. \nRelated: Trump-linked Strive files for ‘Bitcoin Bond’ ETF\nLaunched in January 2024, Bitcoin ETFs emerged as one of last year’s hottest investment products. \nAs of April 4, spot BTC ETFs collectively manage approximately $93 billion in assets, according to data from Bitbo. \nBitcoin ETFs saw outflows after US President Trump announced tariffs. Source: Farside Investors\nOther types of ETFs designed to offer tailored exposure to Bitcoin’s performance are also gaining popularity. \nOn April 2, Grayscale — a cryptocurrency-focused asset manager — launched two Bitcoin strategy ETFs. Like First Trust’s ETFs, they use financial derivatives to optimize for downside risk management and income generation. \nIn March, asset manager Bitwise launched an ETF holding stocks of companies with large Bitcoin treasuries. \nSpot BTC ETFs saw nearly $100 million in outflows on April 3 amid the heightened market volatility following US President Donald Trump’s tariff announcement of sweeping tariffs on April 2. \nMagazine: Bitcoin ATH sooner than expected? XRP may drop 40%, and more: Hodler’s Digest, March 23 – 29\n\n\n","date":1743851173691,"authors":[],"image_url":"","scraped_at":"2025-04-05T11:06:13.691514"}