{"id":"4fb680e4078b548c7a968a1395ff7120","source":"Cointelegraph","title":"Bitcoin bulls defend $80K support as ‘World War 3 of trade wars’ crushes US stocks","url":"https:\/\/cointelegraph.com\/news\/bitcoin-bulls-defend-80-k-support-as-world-war-3-of-trade-wars-crushes-us-stocks","content":" Bitcoin bulls aim to hold the $80,000 level to prevent BTC from following the record-breaking losses seen across US equities markets. \nBitcoin (BTC) price dodged the chaotic volatility that crushed equities markets on the April 4 Wall Street open by holding above the $82,000 level.\nBTC\/USD 1-hour chart. Source: Cointelegraph\/TradingView\nData from Cointelegraph Markets Pro and TradingView showed erratic moves on Bitcoin’s lower timeframes as the daily high near $84,700 evaporated as BTC price dropped by $2,500 at the start of the US trading session.\nFears over a prolonged US trade war and subsequent recession fueled market downside, with the S&P 500 and Nasdaq Composite Index both falling another 3.5% after the open.\nS&P 500 1-day chart. Source: Cointelegraph\/TradingView\nIn ongoing market coverage, trading resource The Kobeissi Letter described the tariffs as the start of the “World War 3” of trade wars.”\nBREAKING: President Trump just now, \"WE CAN'T LOSE!!!\"A long trade war is ahead of us. https:\/\/t.co\/babI1cf5wi pic.twitter.com\/6KCsHp0a8v\n“Two-day losses in the S&P 500 surpass -8% for a total of -$3.5 trillion in market cap. This is the largest 2-day drop since the pandemic in 2020,” it reported.\nThe Nasdaq 100 made history the day prior, recording its biggest single-day points loss ever.\nThe latest US jobs data in the form of the March nonfarm payrolls print, which beat expectations, faded into insignificance with markets already panicking.\nMarket expectations of interest rate cuts from the Federal Reserve nonetheless edged higher, with the odds for such a move coming at the Fed’s May meeting hitting 40%, per data from CME Group’s FedWatch Tool.\nFed target rate probabilities comparison for May FOMC meeting. Source: CME Group\nAs Bitcoin managed to avoid a major collapse, market commentators sought confirmation of underlying BTC price strength.\nRelated: Bitcoin sellers 'dry up' as weekly exchange inflows near 2-year low\nFor popular trader and analyst Rekt Capital, longer-timeframe cues remained encouraging.\n#BTC Bitcoin is already recovering and on the cusp of filling this recently formed CME Gap$BTC #Crypto #Bitcoin https:\/\/t.co\/ZDvsF6ldCz pic.twitter.com\/PSbAESmqnY\n“Bitcoin is also potentially forming the very early signs of a brand new Exaggerated Bullish Divergence,” he continued, looking at relative strength index (RSI) behavior on the daily chart.\nBTC\/USD 1-day chart with RSI data. Source: Rekt Capital\/X\nFellow trader Cas Abbe likewise observed comparatively resilient trading on Bitcoin amid the risk-asset rout.\n“It didn't hit a new low yesterday despite stock market having their worst day in 5 years,” he noted to X followers. \nBTC\/USDT perpetual futures 1-day chart. Source: Cas Abbe\/X\nEarlier, Cointelegraph reported on BTC price bottom targets now including old all-time highs of $69,000 from 2021.\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\n","date":1743784115116,"authors":[],"image_url":"","scraped_at":"2025-04-04T16:28:35.116524"}