{"id":"51a97eafd262a768383bfed3fc978d3b","source":"Cointelegraph","title":"$2T fake tariff news pump shows ‘market is ready to ape’","url":"https:\/\/cointelegraph.com\/news\/fake-tariff-news-pump-shows-market-ready-to-ape","content":" Markets rallied after mainstream media outlets shared a fake news story about a three-month tariff pause, and some say this is a good sign. \nRecent fake news that US President Donald Trump was considering a 90-day pause in tariffs shows the potential for a strong market rebound should a real one take place, according to observers. \nA fake news post on X on April 7 from the verified “Walter Bloomberg” account claimed that the White House was considering a 90-day pause on tariffs following an interview with Kevin Hassett, one of Donald Trump’s economic advisers. \n“Hassett: Trump is considering a 90-day pause in tariffs for all countries except China,” read the now-deleted post from the user, who is not affiliated with Bloomberg News. \nThe account, which has a verified badge and 852,000 followers, caused quite a stir after the rumor was mistakenly aired as a banner on CNBC and then amplified by Reuters.\nThe S&P 500 spiked more than 8% from its low on the day in reaction, the Nasdaq added 9.5% in less than an hour and the Dow Jones pumped 7%, adding trillions to stock markets. \nBitcoin (BTC) prices saw a similar spike, with the asset pumping 6.5% to top $80,000 briefly before falling back again. \nThe official White House “Rapid Response” account quickly posted on X that this was fake news, and markets began to dump again. \nWhile the rumor was debunked as fake, crypto YouTuber Lark Davis said that the episode revealed some critical things about the market. \nThe market is ready to accept prolonged China negotiations as long as most deals can be resolved, he said before adding the “market is ready to ape, even a lame 90-day delay sent markets soaring.”  \n“Now imagine what happens when dozens of deals are made with top players ie, India, Canada, and the UK. Shit tons of money is on the sidelines, ready to ape in at a moment's notice.”\n“That fake headline might actually give Trump, Navarro, and Lutnick more confidence to keep pushing this further,” commented X user Geiger Capital, who added, “They now know that at any point they can announce a pause and the market will rally ~10% in a single day.”\nFox News asked Hasset whether Trump would consider a 90-day pause in tariffs and was given a non-committal response. “I think the president is gonna decide what the president is gonna decide,” he said, adding: “Even if you think there will be some negative effect from the trade side, that’s still a small share of GDP.” \nRelated: Billionaire investor would ‘not be surprised’ if Trump postpones tariffs\n“The idea that it's going to be a nuclear winter or something like that is completely irresponsible rhetoric,” he said. \nKILMEADE: Would Trump consider a 90 days pause in tariffs?HASSETT: I think the president is gonna decide what the president is gonna decide ... even if you think there will be some negative effect from the trade side, that's still a small share of GDP pic.twitter.com\/3KymvgOwQG\nShortly after the 90-day tariff pause post was deleted, Trump took to his own social media platform, Truth Social, to threaten China with even more tariffs. \n“If China does not withdraw its 34% increase above their already long-term trading abuses by tomorrow, April 8th, the United States will impose additional tariffs on China of 50%, effective April 9th,” he said. \nMagazine: Financial nihilism in crypto is over — It’s time to dream big again\n","date":1744105244037,"authors":[],"image_url":"","scraped_at":"2025-04-08T09:40:44.037756"}