{"id":"5316707f14957541a1973e28f4b433b9","source":"Cointelegraph","title":"Mantra exposes crypto liquidity problems, and Coinbase is bearish: Finance Redefined","url":"https:\/\/cointelegraph.com\/news\/mantra-crypto-liquidity-problems-coinbase-bearish-finance-redefined","content":" Mantra’s OM token crash exposed “critical” crypto liquidity concentration issues, which may have exacerbated the coin’s collapse on Sunday, April 13, according to Bitget CEO Gracey Chen. \nCrypto investor sentiment took another significant hit this week after Mantra’s OM token collapsed by over 90% within hours on Sunday, April 13, triggering knee-jerk comparisons to previous black swan events such as the Terra-Luna collapse.\nElsewhere, Coinbase’s report for institutional investors added to concerns by highlighting that cryptocurrencies may be in a bear market until a recovery occurs in the third quarter of 2025.\nMantra’s recent token collapse highlights an issue within the crypto industry of fluctuating weekend liquidity levels creating additional downside volatility, which may have exacerbated the token’s crash.\nThe Mantra (OM) token’s price collapsed by over 90% on Sunday, April 13, from roughly $6.30 to below $0.50, triggering market manipulation allegations among disillusioned investors, Cointelegraph reported.\nWhile blockchain analysts are still piecing together the reasons behind the OM collapse, the event highlights some crucial issues for the crypto industry, according to Gracy Chen, CEO of the cryptocurrency exchange Bitget.\n“The OM token crash exposed several critical issues that we are seeing not just in OM, but also as an industry,” Chen said during Cointelegraph’s Chainreaction daily X show, adding:\nContinue reading\nA monthly market review by publicly traded US-based crypto exchange Coinbase shows that while the crypto market has contracted, it appears to be gearing up for a better quarter.\nAccording to Coinbase’s April 15 monthly outlook for institutional investors, the altcoin market cap shrank by 41% from its December 2024 highs of $1.6 trillion to $950 billion by mid-April. BTC Tools data shows that this metric touched a low of $906.9 billion on April 9 and stood at $976.9 billion at the time of writing.\nVenture capital funding to crypto projects has reportedly decreased by 50%–60% from 2021–22. In the report, Coinbase’s global head of research, David Duong, highlighted that a new crypto winter may be upon us.\n“Several converging signals may be pointing to the start of a new ‘crypto winter’ as some extreme negative sentiment has set in due to the onset of global tariffs and the potential for further escalations,” he said.\nContinue reading\nManta Network co-founder Kenny Li said he was targeted by a sophisticated phishing attack on Zoom that used live recordings of familiar people in an attempt to lure him to download malware. \nThe meeting seemed real with the impersonated person’s camera on, but the lack of sound and a suspicious prompt to download a script raised red flags, Li said in an April 17 X post.\n“I could see their legit faces. Everything looked very real. But I couldn’t hear them. It said my Zoom needs an update. But it asked me to download a script file. I immediately left.”\nLi then asked the impersonator to verify themselves over a Telegram call, however, they didn’t comply and proceeded to erase all messages and block him soon after.\nLi said the North Korean state-backed Lazarus Group was behind the attack.\nThe Manta Network co-founder managed to screenshot his conversation with the attacker before the messages were deleted, during which Li initially suggested moving the call over to Google Meet.\nSpeaking with Cointelegraph, Li said he believed the live shots used in the video call were taken from past recordings of real team members.\n“It didn’t seem AI-generated. The quality looked like what a typical webcam quality looks like.”\nContinue reading\nThe cryptocurrency market is still recycling old narratives, with few new trends yet to emerge and replace the leading themes in the first quarter of 2025.\nArtificial intelligence tokens and memecoins were the dominant crypto narratives in the first quarter of 2025, accounting for 62.8% of investor interest, according to a quarterly research report by CoinGecko. AI tokens captured 35.7% of global investor interest, overtaking the 27.1% share of memecoins, which remained in second place.\nOut of the top 20 crypto narratives of the quarter, six were memecoin categories while five were AI-related.\n“Seems like we have yet to see another new narrative emerge and we are still following past quarters’ trends,” said Bobby Ong, the co-founder and chief operating officer of CoinGecko, in an April 17 X post. “I guess we are all tired from the same old trends repeating themselves.”\nContinue reading\nThe crypto lending market’s size remains significantly down from its $64 billion high, but decentralized finance (DeFi) borrowing has made a more than 900% recovery from bear market lows.\nCrypto lending enables borrowers to use their crypto holdings as collateral to obtain crypto or fiat loans, while lenders can use their holdings to generate interest.\nThe crypto lending market was down over 43%, from its all-time high of $64.4 billion in 2021 to $36.5 billion at the end of the fourth quarter of 2024, according to a Galaxy Digital research report published on April 14.\n“The decline can be attributed to the decimation of lenders on the supply side and funds, individuals, and corporate entities on the demand side,” according to Zack Pokorny, research associate at Galaxy Digital.\nThe decline in the crypto lending market started in 2022 when centralized finance (CeFi) lenders Genesis, Celsius Network, BlockFi and Voyager filed for bankruptcy within two years as crypto valuations fell.\nTheir collective downfall led to an estimated 78% collapse in the size of the lending market, with CeFi lending losing 82% of its open borrows, according to the report.\nContinue reading\nAccording to data from Cointelegraph Markets Pro and TradingView, most of the 100 largest cryptocurrencies by market capitalization ended the week in the green.\nDecentralized exchange (DEX) Raydium’s (RAY) token rose over 26% as the week’s biggest gainer, followed by the AB blockchain (AB) utility token, up over 19% on the weekly chart.\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.\n","date":1745068616129,"authors":[],"image_url":"","scraped_at":"2025-04-19T13:16:56.129855"}