{"id":"554e9c6a5f65af55b9da7b743314ab6a","source":"Cointelegraph","title":"Trump turned crypto from ‘oppressed industry’ to ‘centerpiece’ of US strategy","url":"https:\/\/cointelegraph.com\/news\/trump-crypto-summit-us-bitcoin-policy-shift","content":" The White House Crypto Summit marked a “truly historic day at the White House,” according to Crypto.com CEO Kris Marszalek. \nUS President Donald Trump has placed cryptocurrency at the center of his economic strategy, marking a major policy shift for the US blockchain industry, according to Crypto.com CEO Kris Marszalek.\nTrump hosted a White House Crypto Summit on March 7, signaling that he intends to make crypto policy a national priority and make the US a global hub for blockchain innovation. \nThe summit marked a “truly historic day at the White House,” Marszalek said in a March 8 X post.\nSource: Kris|Crypto.com\nMarszalek credited Trump with reversing policies like Operation Chokepoint 2.0, which allegedly led to crypto and tech firms being denied banking services under the Biden administration.\nThe difficulties of finding banking partners may indeed be a thing of the past for crypto firms after the US Office of the Comptroller of the Currency (OCC) eased its stance on how banks can engage with crypto just hours after Trump vowed to end the prolonged crackdown restricting crypto firms’ access to banking services\nRelated: US Bitcoin reserve marks ‘real step’ toward global financial integration\nThe crypto summit also comes as two major bills await congressional approval: the Stablecoin bill and the Market Structure bill, aiming to help lift the regulatory uncertainty around the US crypto industry.\nMarszalek said ongoing dialogue with key regulators, such as the Commodity Futures Trading Commission (CFTC) and the Securities and Exchange Commission (SEC), could see “landmark legislation” pass. He added:\nThe CEO’s comments come a day after Trump signed an executive order on March 7, which outlined a plan to establish a Bitcoin reserve using cryptocurrency forfeited in government criminal cases rather than actively acquiring Bitcoin (BTC) through market purchases, Cointelegraph reported.\nWhile no direct BTC purchases were announced, the bill added that the US Treasury and Commerce secretaries could make “budget-neutral strategies” to buy more Bitcoin for the reserve, “provided that those strategies impose no incremental costs on American taxpayers.”\nSome analysts see the US Bitcoin reserve plan as the first “real step” for Bitcoin’s integration into the global financial system.\n“The US has taken its first real step toward integrating Bitcoin into the fabric of global finance, acknowledging its role as a foundational asset for a more stable and sound monetary system,” Joe Burnett, head of market research at Unchained, told Cointelegraph.\nRelated: FDIC resists transparency on Operation Chokepoint 2.0 — Coinbase CLO\nWhile Trump has previously highlighted his intentions to bolster crypto innovation in the US, issuing regulatory frameworks takes time and setting the “right regulatory tone” will be crucial for the administration, according to Anastasija Plotnikova, co-founder and CEO of Fideum — a regulatory and blockchain infrastructure firm focused on institutions.\nMagazine: Meet lawyer Max Burwick — ‘The ambulance chaser of crypto’\n","date":1741454969081,"authors":[],"image_url":"","scraped_at":"2025-03-08T17:29:29.081355"}