{"id":"556d53f2df00a6ff990cbe879c202f3d","source":"Cointelegraph","title":"Trump’s Liberation Day: ‘Climax of uncertainty’ before crypto market recovery","url":"https:\/\/cointelegraph.com\/news\/trump-liberation-day-climax-uncertainty-crypto-market-recovery","content":" “In my opinion, the tariffs are the representation of the uncertainty in the markets,” Michaël van de Poppe told Cointelegraph \nCryptocurrency markets could be on track for recovery as investor sentiment begins to stabilize following US President Donald Trump’s sweeping tariff announcement — what some analysts are calling the peak of recent market uncertainty.\nTrump announced his reciprocal import tariffs on April 2, which sent tremors across global markets. The S&P 500 lost more than $5 trillion, its largest drop on record, surpassing the pandemic-induced crash in March 2020, according to Reuters.\nStill, some analysts see a silver lining to the tariff announcement.\n“In my opinion, the tariffs are the representation of the uncertainty in the markets,” Michaël van de Poppe, founder of MN Consultancy, told Cointelegraph. “Liberation Day is basically the peak of that period, the climax of uncertainty. Now it’s out in the open. Everybody knows the new playing field.”\nVan de Poppe added that he believes Trump is using tariffs as a strategic move to stimulate domestic growth and reduce yields. “Tariffs are literally the only way to do that,” he said. “I wouldn’t be surprised if they’re reversed within the next six to 12 months.”\nAverage tariff rate on US goods and imports. Source: JPMorgan, Ayesha Tariq\nPresident Trump’s plan imposes a 10% baseline tariff on all US imports from April 5 and a higher “reciprocal tariff” of up to 54% on select countries with larger trade deficits from April 9.\nRelated: Michael Saylor’s Strategy buys Bitcoin dip with $1.9B purchase\nStill, the end of the uncertainty could bring renewed investment into crypto markets, leading to a recovery, Van de Poppe said:\nHe noted that the economic impact of the tariffs may ultimately lead the US Federal Reserve to lower interest rates and begin a new round of quantitative easing (QE), a monetary policy that involves the Fed buying bonds to inject liquidity into the economy.\nArthur Hayes, co-founder of BitMEX and chief investment officer at Maelstrom, has predicted Bitcoin could climb to $250,000 if the Fed formally enters a QE cycle.\nRelated: Satoshi Nakamoto turns 50 as Bitcoin becomes US reserve asset\nOn the downside, the tariff-related uncertainty may continue pressuring risk asset appetite for weeks, according to Noelle Acheson, author of the Crypto is Macro Now newsletter.\n“We can count on President Trump changing his mind a few times within the first couple of weeks,” Acheson told Cointelegraph. She added:\n“For crypto, BTC continues to act like a risk asset short-term while its analog counterpart gold breaks through one all-time high after another,” a development that may impact crypto investor sentiment in the short term, Acheson said.\nMeanwhile, crypto intelligence firm Nansen estimated a 70% probability that the market could bottom by June, depending on how the tariff negotiations evolve.\nMagazine: Bitcoin ATH sooner than expected? XRP may drop 40%, and more: Hodler’s Digest, March 23 – 29\n","date":1743963179689,"authors":[],"image_url":"","scraped_at":"2025-04-06T18:12:59.689179"}