{"id":"5b9b96cd914f8dfd39244e55f5f2ff33","source":"Cointelegraph","title":"Analysts brace for Bitcoin slide on gloomy US manufacturing data","url":"https:\/\/cointelegraph.com\/news\/analysts-brace-bitcoin-slide-us-manufacturing-data","content":" The Federal Reserve's monthly manufacturing survey showed the sharpest decline in activity since 2020. \nBitcoin’s spot price could take a hit after the US Federal Reserve reported some of the worst manufacturing data in recent history, according to several cryptocurrency analysts.\nOn April 17, the Philadelphia Federal Reserve Manufacturing Index — a monthly survey of 250 US-based manufacturers — reported the sharpest declines in overall business activity since 2020. \nThe data puts Bitcoin (BTC) “under short term pressure,” researchers at Bitunix, a crypto exchange, said in a post on the X platform. They added that Bitcoin could still see a “strong comeback” if its price holds above $83,000 per coin.  \nAs of April 18, Bitcoin has been trading at approximately $84,000 per coin, according to data from Google Finance. The Federal Reserve’s bearish report comes as factories brace for the impact of US President Donald Trump’s plans to impose sweeping tariffs on US imports, potentially raising production costs for manufacturers. \n“[I]ndicators for general activity, new orders, and shipments all fell and turned negative… suggest[ing] subdued expectations for growth over the next six months,” the report said. \nRelated: Trade tensions to speed institutional crypto adoption — Execs\nAnalysts said the combination of rising prices and slowing production could deal a blow to financial markets, including cryptocurrencies. Rising prices limit central banks’ ability to support markets in a downturn. \n“Economic activity is falling off a cliff and any activity that remains, the prices are going up,” Felix Jauvin, a Blockworks macroeconomic analyst, said in a post on the X platform. \nIt's an “[a]bsolute worst scenario for policy makers here especially with no meaningful idea of how permanent tariffs will be,” he added.\nHowever, Bitcoin has been more resilient to recent macroeconomic shocks than stocks or other cryptocurrencies, Binance said in an April research report. \nSince Trump announced his tariff plans on April 2, Bitcoin has traded roughly flat after initially declining but more than 10%, Google Finance data shows. Meanwhile, the S&P 500 — an index of US stocks — is still down by around 7%. \n“Even in the wake of recent tariff announcements, BTC has shown some signs of resilience, holding steady or rebounding on days when traditional risk assets faltered,” Binance said. \nTrump initially sought to impose double-digit levies on virtually all foreign goods but later paused planned tariffs on certain countries. \nHe still wants to place high taxes on many Chinese imports, causing concerns among crypto executives who fear a trade war could harm blockchain networks. \nMagazine: Crypto ‘more taboo than OnlyFans,’ says Violetta Zironi, who sold song for 1 BTC\n\n","date":1745068619537,"authors":[],"image_url":"","scraped_at":"2025-04-19T13:16:59.537174"}