{"id":"5d9065ab27697108d5d473ff9551d0fb","source":"Cointelegraph","title":"States likely to adopt Bitcoin reserves first: Report","url":"https:\/\/cointelegraph.com\/news\/states-adopt-bitcoin-reserves-first-senator-lummis","content":" US Senator Cynthia Lummis expects progress toward a Bitcoin reserve to be slower at the federal level. \nStates are likely to adopt Bitcoin (BTC) reserves before the US federal government does, Senator Cynthia Lummis reportedly said on Feb. 28 during the Bitcoin Investor Week conference in New York. \n“My bets are that you’ll see a state have a Bitcoin strategic reserve before the federal government,” Lummis said, according to a Bloomberg report. \nIn July 2024, Lummis, a Wyoming Republican, proposed legislation that would require the US federal government to create a national Bitcoin stockpile. \nHer bill, dubbed the BITCOIN Act, calls for the US Treasury Department to gradually accumulate 1 million BTC, ultimately acquiring “a total stake of approximately 5% of total Bitcoin supply, mirroring the size and scope of gold reserves held by the United States,” according to Lummis’ website. \nLummis proposed the Bitcoin Act in July 2024. Source: Cynthia Lummis\nRelated: Michigan becomes latest state to propose crypto reserve bill\nIn January, US President Donald Trump signed an executive order requiring federal officials to study the feasibility of a national Bitcoin stockpile. It was one of the first actions of Trump’s second presidential term, which started on Jan. 20. \nIn February, Trump signed another order instructing the US government to create a sovereign wealth fund, which could potentially serve as a vehicle for buying BTC.\n“We’re seeing the United Arab Emirates purchase Bitcoin. You’re going to look at some of the sovereign wealth funds around the world who are not as tied up in a democratic republic like we are, be able to just make it so,” Lummis reportedly said. \nThere are currently 18 US states that have crypto reserve bills pending Senate votes, while two — Arizona and Utah —  are in the final stages of the approval process.\nState crypto investment bills have been rejected in Montana, Wyoming, North Dakota, South Dakota and Pennsylvania. \nAlthough some states run by Democrats might resist Trump’s crypto-friendly stance, others are expected to embrace crypto as a bipartisan issue. \n“[T]here are so many states out there that are pro-crypto, and they don’t necessarily follow blue or red policies,” Ashley Gunn, Coinbase’s senior manager for US policy, said during a Feb. 28 ETHDenver panel attended by Cointelegraph. \nEstablishing a strategic Bitcoin reserve in the United States would accelerate Bitcoin’s adoption even more than 2024’s exchange-traded fund (ETF) launches, cryptocurrency researcher CoinShares said in January.\n“We believe that the enactment of the Bitcoin Act in the United States would have a more profound long-term impact on Bitcoin than the launch of ETFs,” CoinShares said.\nLaunched in January 2024, US-based Bitcoin ETFs hold upward of $100 billion worth of BTC.\nMagazine: 3AC-related OX.FUN denies insolvency rumors, Bybit goes to war: Asia Express\n","date":1740785527249,"authors":[],"image_url":"","scraped_at":"2025-02-28T23:32:07.249936"}