{"id":"5d9f4f9861ac6c7c73ce0f20faf7e3d8","source":"Cointelegraph","title":"Pomp: Trump deliberately crashed markets to get interest rates down","url":"https:\/\/cointelegraph.com\/news\/trump-intentionally-crashing-markets-force-fed-lower-interest-rates","content":" Anthony Pompliano speculates US President Donald Trump may be taking matters into his own hands in an attempt to lower interest rates. \nThe Trump administration may be intentionally creating uncertainty in the stock markets to corner Federal Reserve chair Jerome Powell into lowering interest rates, according to a market commentator. \nDoing so increases the likelihood that the US won’t need to refinance around $7 trillion in debt it owes over the next few months, Bitcoin commentator Anthony Pompliano said in a March 10 X post.\nUS President Donald Trump and Secretary of the Treasury Scott Bessent are “taking matters into their own hands; they’re crashing asset prices in an attempt to force Jerome Powell to cut interest rates,” said Pompliano, who serves as the founder and CEO of Professional Capital Management and host of The Pomp Podcast. \nThe President and his team are intentionally crashing the market.Is this a master plan or are we watching uncontrolled destruction?! pic.twitter.com\/Tbc0M9Rjxu\nIn late January, Powell announced the Fed was not lowering interest rates from the current target range of 4.25% to 4.5% despite calls from Trump to do so.\nPompliano said the recent market panic has been driven in part by Trump’s tariffs — and has been used to create a more favorable bond market while lowering the 10-year Treasury yield.\nHe noted that the 10-year Treasury yield is already down from nearly 4.8% in January to 4.21% now — a sign that Trump’s purported strategy is “heading in the right direction.”\nSource: Thomas Kralow\nWhether Pompliano’s theory is correct or not, the stock market has been tanking of late, and crypto has been hit even harder.\nBroad market index funds such as State Street’s Standard & Poor’s 500 index fund (SPY) fell 2.66% on March 10 alone, while the Nasdaq-100% fell 3.8%, Google Finance data shows.\nBoth indexes are down 7.32% and 10.7% over the last month, while Bitcoin (BTC) is down 27.4% from its $108,786 all-time high, and over $1.2 trillion has been wiped from the cryptocurrency market cap since Dec. 17. \nIf the stock market continues to tank, it will come down to a “who blinks first” contest between Trump and Powell, Pompliano said.\nWhile Trump hasn’t confirmed such a strategy, Pompliano pointed to a Fox News interview on March 9 where Trump said: “Nobody ever gets rich when the interest rates are high because people can’t borrow money.”\nPompliano added that lowering interest rates would also benefit American consumers:\nRelated: Bitcoin dips to $80K in ‘ugly start,’ could retest key resistance: Hayes\nCME FedWatch, a tool used to measure expectations for a Federal Reserve interest rate change, has tipped a 96% probability that the target rate will remain between 4.25% and 4.50% following the Federal Reserve’s next meeting on March 19. \nHowever, it’s near 50-50 odds for the target rate to be lowered in the Federal Reserve’s following meeting on May 7.\nThe Federal Reserve typically avoids lowering interest rates when inflation is high, as one of its primary objectives is to maintain price stability.\nHowever, a Trump-inflicted recession, or “Trumpcession,” as some call it, could force America’s top bank to start cutting again.\nMagazine: Meet lawyer Max Burwick — ‘The ambulance chaser of crypto’\n","date":1741691704360,"authors":[],"image_url":"","scraped_at":"2025-03-11T11:15:04.360619"}