{"id":"5e7451bbddfbeb9de43b082371d6b9f4","source":"Cointelegraph","title":"US Bitcoin reserve prompts $370 million in ETF outflows: Farside","url":"https:\/\/cointelegraph.com\/news\/bitcoin-etf-flows-rise-us-reserve-aids-institutional-uptake","content":" Traders had a largely negative response to US President Donald Trump's announcement. \nBitcoin exchange-traded funds (ETFs) saw nearly $370 million worth of net outflows on March 7 as investors reacted to President Donald Trump’s plan for a US strategic Bitcoin reserve, according to data from Farside Investors. \nThe outflows indicate institutional investors are wary of Bitcoin (BTC) exposure after Trump’s March 6 executive order — which created a national Bitcoin reserve but didn’t instruct the government to buy Bitcoin — disappointed traders. \n“While [Trump’s executive order] acknowledges crypto’s role in global finance, the lack of fresh purchases disappointed markets,” Alvin Kan, chief operating officer of Bitget Wallet, told Cointelegraph. \nSource: Ryan Rasmussen\nRelated: US Bitcoin reserve ups volatility, futures recoil\nOn March 6, Trump signed an executive order creating a strategic Bitcoin reserve and, separately, a digital asset stockpile to hold other cryptocurrencies. \nThey will both initially comprise assets acquired by law enforcement and other legal proceedings. \nThe order asks officials to “develop budget-neutral strategies for acquiring additional bitcoin, provided that those strategies impose no incremental costs on American taxpayers.”\n“This limited scope fell short of market expectations and resulted in considerable disappointment,” Temujin Louie, CEO of Wanchain, a crosschain interoperability protocol, told Cointelegraph.\nHowever, Trump’s “order opens the possibility of acquiring additional Bitcoin as well, as long as the acquisitions don’t cost taxpayers,” Bryan Armour, director of passive strategies research at Morningstar, told Cointelegraph. \n“That could introduce a new buyer to the Bitcoin ecosystem.”\nBitcoin’s spot price dropped more than 2% on March 7, according to data from Google Finance. \nMeanwhile, data from the CME, the US’ largest derivatives exchange, shows declines of more than 2% across most of Bitcoin’s forward curve, which comprises futures contracts expiring at staggered dates. \nFutures are standardized contracts representing an agreement to buy or sell an asset at a particular future date.\nEven without the US government actively buying up Bitcoin, the “US Strategic Bitcoin Reserve means… Other countries will buy bitcoin… [and] Financial institutions have no excuse” not to add BTC allocations, Ryan Rasmussen, asset manager Bitwise’s head of research, said in an X post. \nThe sell-off is “a simple buy the rumor, sell the news event,” Austin Arnold, co-founder of Altcoin Daily, told Cointelegraph. “Long term, this is bullish.”\nMagazine: Trump’s crypto ventures raise conflict of interest, insider trading questions\n","date":1741454980274,"authors":[],"image_url":"","scraped_at":"2025-03-08T17:29:40.274071"}