{"id":"6034707c43205510c9f2cba261199484","source":"Cointelegraph","title":"10-year Treasury yield falls to 4% as DXY softens — Is it time to buy the Bitcoin price dip?","url":"https:\/\/cointelegraph.com\/news\/10-year-treasury-yield-falls-to-4-as-dxy-softens-is-it-time-to-buy-the-bitcoin-price-dip","content":" Will the US-led trade war lead to a golden buying opportunity in Bitcoin price or further downside in the short term? \nOn April 3, yields on long-term US government debt fell to their lowest levels in six months as investors reacted to growing concerns over the global trade war and the weakening of the US dollar. The yield on the 10-year Treasury note briefly touched 4.0%, down from 4.4% a week earlier, signaling strong demand from buyers.\nUS 10-year Treasury yield (left) vs. Bitcoin\/USD (right). Source: TradingView \/ Cointelegraph\nAt first glance, a higher risk of economic recession may seem negative for Bitcoin (BTC). However, lower returns from fixed-income investments encourage allocations to alternative assets, including cryptocurrencies. Over time, traders are likely to reduce exposure to bonds, particularly if inflation rises. As a result, the path to a Bitcoin all-time high in 2025 remains plausible.\nOne could argue that the recently announced US import tariffs negatively impact corporate profitability, forcing some companies to deleverage and, in turn, reducing market liquidity. Ultimately, any measure that increases risk aversion tends to have a short-term negative effect on Bitcoin, particularly given its strong correlation with the S&P 500 index.\nAxel Merk, chief investment officer and portfolio manager at Merk Investments, said that tariffs create a “supply shock,” meaning the reduced availability of goods and services due to rising prices causes an imbalance relative to demand. This effect is amplified if interest rates are declining, potentially paving the way for inflationary pressure.\nSource: X\/AxelMerk\nEven if one does not view Bitcoin as a hedge against inflation, the appeal of fixed-income investments diminishes significantly in such a scenario. Moreover, if just 5% of the world’s $140 trillion bond market seeks higher returns elsewhere, it could translate into $7 trillion in potential inflows into stocks, commodities, real estate, gold, and Bitcoin.\nGold surged to a $21 trillion market capitalization as it made consecutive all-time highs, and it still has the potential for significant price upside. Higher prices allow previously unprofitable mining operations to resume and it encourages further investment in exploration, extraction, and refining. As production expands, the supply growth will naturally act as a limiting factor on gold’s long-term bull run.\nRegardless of trends in US interest rates, the US dollar has weakened against a basket of foreign currencies, as measured by the DXY Index. On April 3, the index dropped to 102, its lowest level in six months. A decline in confidence in the US dollar, even in relative terms, could encourage other nations to explore alternative stores of value, including Bitcoin.\nUS Dollar Index (DXY). Source: TradingView \/ Cointelegraph\nThis transition does not happen overnight, but the trade war could lead to a gradual shift away from the US dollar, particularly among countries that feel pressured by its dominant role. While no one expects a return to the gold standard or Bitcoin to become a major component of national reserves, any movement away from the dollar strengthens Bitcoin’s long-term upside potential and reinforces its position as an alternative asset.\nRelated: Trump 'Liberation Day' tariffs create chaos in markets, recession concerns\nTo put things in perspective, Japan, China, Hong Kong, and Singapore collectively hold $2.63 trillion in US Treasuries. If these regions choose to retaliate, bond yields could reverse their trend, increasing the cost of new debt issuance for the US government and further weakening the dollar. In such a scenario, investors would likely avoid adding exposure to stocks, ultimately favoring scarce alternative assets like Bitcoin.\nTiming Bitcoin’s market bottom is nearly impossible, but the fact that the $82,000 support level held despite worsening global economic uncertainty is an encouraging sign of its resilience.\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n","date":1743722066165,"authors":[],"image_url":"","scraped_at":"2025-04-03T23:14:26.165318"}