{"id":"629c3ed731b0d351f169a939a851ab67","source":"Cointelegraph","title":"Trump-linked WLFI triples Ether holdings, Solana sees $485M outflows: Finance Redefined","url":"https:\/\/cointelegraph.com\/news\/trump-wlfi-triples-ether-holdings-solana-485-m-outflows-finance-redefined","content":" Trump’s WLFI DeFi platform tripled its Ether holdings within a week during the market downturn, ahead of the first White House Crypto Summit. \nThe blockchain platform linked to United States President Donald Trump took the crypto market downturn as an investment opportunity, tripling its Ether holdings in a week ahead of the White House’s first Crypto Summit on March 7.\nMeanwhile, Solana was hit by nearly half a billion dollars worth of outflows in February as cryptocurrency investors sought safer investments following a wave of memecoin scams and rug pulls.\nThe decentralized finance (DeFi) platform linked to US President Donald Trump significantly increased its Ether holdings over the past week as the cryptocurrency’s price briefly dipped below $2,000.\nTrump’s World Liberty Financial (WLFI) DeFi platform tripled its Ether (ETH) holdings over the past seven days as ETH dipped below the $2,000 psychological mark, Cointelegraph Markets Pro data shows.\nETH\/USD, 1-month chart. Source: Cointelegraph\nData provided by Arkham Intelligence shows WLFI now holds about $10 million more in Ether than a week earlier. Its latest acquisitions also include an additional $10 million in Wrapped Bitcoin (WBTC) and $1.5 million in Movement Network (MOVE) tokens.\nWLFI token balances history. Source: Arkham Intelligence\nTrump’s DeFi platform is currently sitting on a total unrealized loss of over $89 million across the nine tokens it invested in, Lookonchain data shows.\nSource: Lookonchain\nThe dip buying came during a period of heightened market volatility and investor concerns, driven by both macroeconomic concerns and crypto-specific events, including the $1.4 billion Bybit hack on Feb. 21, the largest exploit in crypto history.\nContinue reading\nSolana saw nearly half a billion dollars in outflows last month as investors shifted to what were perceived to be safer digital assets, reflecting growing uncertainty in the cryptocurrency market.\nSolana (SOL) was hit by over $485 million worth of outflows over the past 30 days, with investor capital mainly flowing to Ethereum, Arbitrum and the BNB Chain.\nThe capital exodus came amid a wider flight to “safety” among crypto market participants, according to a Binance Research report shared with Cointelegraph.\nSolana outflows. Source: deBridge, Binance Research\n“Overall, there is a broader flight towards safety in crypto markets, with Bitcoin dominance increasing 1% in the past month to 59.6%,” the report stated.”Some of the capital flowed into BNB Chain memecoins, driven in part by CZ’s tweets about his dog, Brocolli,” it added.\nBeyond Solana, total cryptocurrency market capitalization dropped by 20% in February, driven by growing negative sentiment, Binance Research noted.\nAlongside macroeconomic concerns, the crypto investor sentiment drop was mainly due to the $1.4 billion Bybit hack on Feb. 21, the largest exploit in crypto history. \nDisappointment in Solana-based memecoin launches has also curbed investor appetite, particularly after the launch of the Libra token, which was endorsed by Argentine President Javier Milei.\nContinue reading\nUS President Donald Trump will host the first White House Crypto Summit on March 7, bringing together industry leaders to discuss regulatory policies, stablecoin oversight and the potential role of Bitcoin in the US financial system.\nThe attendees will include “prominent founders, CEOs, and investors from the crypto industry,” along with members of the President’s Working Group on Digital Assets, according to an announcement shared by the White House “AI and crypto czar,” David Sacks, in a March 1 X post.\nThe summit will be chaired by Sacks and administered by Bo Hines, the executive director of the Working Group.\nSource: David Sacks\nSacks was appointed White House crypto and AI czar on Dec. 6, 2024, to “work on a legal framework so the Crypto industry has the clarity it has been asking for, and can thrive in the U.S.,” Trump wrote in the announcement. \nPart of Sacks’ role will be to “safeguard” online speech and “steer us away from Big Tech bias and censorship,” Trump added.\nSource: Donald Trump\nTrump has previously signaled that he intends to make crypto policy a national priority and make the US a global hub for blockchain innovation. The upcoming summit may set the tone for crypto regulations over the next four years.\nContinue reading\nVenture capital funding into blockchain and cryptocurrency startups accelerated in February, with decentralized finance (DeFi) projects attracting significant investment flows, signaling that demand for blockchain builders remained strong amid volatile market conditions. \nAccording to data from The TIE, 137 crypto companies raised a combined $1.11 billion in funding in February. \nDeFi secured nearly $176 million in total funding across 20 projects. Meanwhile, eight business service providers raised a total of $230.7 million. Startups specializing in security services, payments and artificial intelligence also drew significant interest.\nBusiness service providers and DeFi projects attracted the largest investments in February. Source: The TIE\nThe biggest venture capital investors targeted “multiple sectors, including key narratives such as AI, Developer Tools, DeFi, DePIN, Funds, and Payments,” The TIE said. \nThe data is consistent with Cointelegraph’s recent reporting, which showed a large uptick in decentralized physical infrastructure network (DePIN) deals.\nContinue reading\nThe Bybit exploiter has laundered 100% of the stolen funds after staging the biggest hack in crypto history, but some of the loot may still be recoverable by blockchain security experts.\nOn Feb. 21, Bybit was hacked for over $1.4 billion worth of liquid-staked Ether (STETH), Mantle Staked ETH (mETH) and other ERC-20 tokens, resulting in the largest crypto theft in history.\nThe hacker has since moved all 500,000 stolen Ether (ETH), primarily through the decentralized crosschain protocol THORChain, blockchain security firm Lookonchain reported in a March 4 post on X:\nSource: Lookonchain \nNorth Korea’s Lazarus Group has converted the stolen proceeds despite being identified as the main culprit behind the attack by multiple blockchain analytics firms, including Arkham Intelligence. \nThe news comes over two months after South Korean authorities sanctioned 15 North Koreans for allegedly generating funds for North Korea’s nuclear weapons development program through cryptocurrency heists and cyber theft.\nContinue reading\nAccording to data from Cointelegraph Markets Pro and TradingView, most of the 100 largest cryptocurrencies by market capitalization ended the week in the green.\nOf the top 100, the Cardano (ADA) token rose over 46% as the bigger gainer in the top 100, driven by the token’s inclusion in Trump’s upcoming Digital Asset Stockpile. Bitcoin Cash (BCH) rose over 40% as the second-biggest gainer over the past week.\nTotal value locked in DeFi. Source: DefiLlama\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.\n","date":1741454998245,"authors":[],"image_url":"","scraped_at":"2025-03-08T17:29:58.245925"}