{"id":"6df007931e01b2292542278dd71be1a2","source":"Cointelegraph","title":"Jameson Lopp sounds alarm on Bitcoin address poisoning attacks","url":"https:\/\/cointelegraph.com\/news\/jameson-lopp-sounds-alarm-bitcoin-address-poisoning","content":" The cypherpunk and crypto executive cautioned Bitcoin holders to remain vigilant and always thoroughly review destination addresses. \nJameson Lopp, the chief security officer at Bitcoin (BTC) custody company Casa, sounded the alarm on Bitcoin address poisoning attacks, a social engineering scam that uses similar addresses from a victim's transaction history to fool them into sending funds to the malicious address.\nAccording to Lopp's Feb 6 article, the threat actors generate BTC addresses that match the first and last digits of addresses from the victim's transaction history. Lopp analyzed the Bitcoin blockchain history for this type of attack and found:\n\"Over these 18 months, just shy of 48,000 transactions were sent that match this profile of potential address poisoning,\" Lopp added.\nExample of a poisoned address attack. Source: Jameson Lopp\nThe executive urged Bitcoin holders to thoroughly check addresses before sending funds and called for better wallet interfaces that fully display addresses. Lopp's warning highlights the emerging cybersecurity exploits and fraudulent schemes plaguing the industry.  \nRelated: Crypto exploit, scam losses drop to $28.8M in March after February spike\nAccording to cybersecurity firm Cyvers, over $1.2 million was stolen through address poisoning attacks in March 2025. Cyvers CEO Deddy Lavid said these types of attacks cost users $1.8 million in February.\nBlockchain security firm PeckShield estimates the total amount lost to crypto hacks in Q1 2025 to be over $1.6 billion, with the Bybit hack accounting for the vast majority of the stolen funds.\nThe Bybit hack in February was responsible for $1.4 billion in losses and represents the biggest crypto hack in history.\nCybersecurity experts have tied the attacks to North Korean state-affiliated hackers that use complex and evolving social engineering schemes to steal cryptocurrencies and sensitive data from targets.\nCommon Lazarus Group social engineering scams include fraudulent job offers, zoom meetings with fake venture capitalists, and phishing scams on social media.\nMagazine: 2 auditors miss $27M Penpie flaw, Pythia’s ‘claim rewards’ bug: Crypto-Sec\n","date":1743983951143,"authors":[],"image_url":"","scraped_at":"2025-04-06T23:59:11.143563"}