{"id":"72a3b2e9eb98f9e264f44728c79324f1","source":"Cointelegraph","title":"CEX listings outperform Nasdaq and Dow IPOs with 80% average returns","url":"https:\/\/cointelegraph.com\/news\/crypto-token-listings-outperform-stocks-80-roi","content":" CEX listings had an average return of over 80% during the past 180 days, outperforming the NYSE and Nasdaq’s average IPO returns. \nCryptocurrency listings have outperformed the average of traditional stock listings, despite recent community criticism regarding the manipulation potential of token listings on centralized exchanges.\nToken listing procedures on centralized cryptocurrency exchanges (CEXs) drew significant controversy after Changpeng “CZ” Zhao, co-founder and former CEO of Binance, called the process flawed after disappointing performances of some token listings.\nDespite the criticism, crypto exchanges have outperformed traditional stock exchanges in terms of listings with positive returns on investment (ROI) and average ROI, according to an April 3 CoinMarketCap report shared exclusively with Cointelegraph.\nOver the past 180 days, crypto exchange listings had an average return of over 80%, outperforming the largest traditional stock indexes such as the Nasdaq and Dow Jones, as well as Bitcoin (BTC) and Ether (ETH).\nCEX listings, top indexes, average ROI. Source: CoinMarketCap\nThe 80% return refers to the average performance of all listed tokens by the seven major exchanges, including Binance, Bybit, Coinbase, OKX, Bitget, Gate and KuCoin.\nMoreover, 68% of crypto exchange listings boasted a positive ROI, outperforming the New York Stock Exchange’s (NYSE) 54% and the Nasdaq’s 51%.\nSource: CoinMarketCap\n“This data suggests that crypto exchanges have made progress in refining their listing,” the report said.\nRelated: 70% chance of crypto bottoming before June amid trade fears: Nansen\nCryptocurrencies listed on CEXs generally see high demand from investors as the exchanges provide significant new liquidity that can boost the coins’ price performances after listing.\nToken-listing criteria on CEXs started garnering attention in November 2024, after Tron founder Justin Sun claimed that Coinbase allegedly asked for $330 million in total fees to list Tron (TRX), a surprising allegation since Coinbase claims to charge no fees for listing new cryptocurrencies.\nRelated: Trump-linked crypto ventures may complicate US stablecoin policy\nRecent investor disappointment with some token listings may stem from historic profit expectations due to the significant upside of numerous CEX-listed tokens.\nStill, the returns of a cryptocurrency after listing depend on the wider market appetite, a Binance spokesperson told Cointelegraph, adding:\n“Crypto investors’ expectations for new listings to perform well are understandable and often shaped by the historic success” of CEX listings, added the spokesperson.\nBinance, the world’s largest crypto exchange, listed 77 cryptocurrencies throughout 2023 and 2024, with a 0% delisting rate.\nBinance announced a community voting mechanism for token listings on March 9, to make the listing process more decentralized.\nMagazine: Memecoins are ded — But Solana ‘100x better’ despite revenue plunge\n","date":1743724106364,"authors":[],"image_url":"","scraped_at":"2025-04-03T23:48:26.364670"}