{"id":"75f70b665e1a144affcefce150463444","source":"Cointelegraph","title":"Bitcoin investors share mixed reactions to White House Crypto Summit","url":"https:\/\/cointelegraph.com\/news\/bitcoin-investors-mixed-reactions-white-house-crypto-summit","content":" Institutional crypto investors tended to view the White House Crypto Summit more favorably than retail traders and BTC maximalists. \nThe Bitcoin (BTC) community voiced mixed reactions to the March 7 White House Crypto Summit, with some investors characterizing it as a historic day for Bitcoin and cryptocurrencies, while others called the event underwhelming.\nCrypto trader Miles Deutscher said the event was a \"massive net positive\" for Bitcoin, despite the mixed reactions.\nKyle Samani, the managing partner at Multicoin Capital and an attendee of the summit, characterized it as a \"historic moment\" for the cryptocurrency industry.\nFollowing the event, Coin Bureau founder and CEO Nic Puckrin asked, \"Just looking at the charts, I can assume that nothing groundbreaking came from the White House summit?\"\nPresident Trump and cabinet members deliver comments to the White House Crypto Summit. Source: The White House\nBitcoin maximalist Justin Bechler was highly critical of the meeting. \"The White House 'crypto summit' is a gathering of rent-seeking lobbyists pushing state-approved surveillance tokens,\" Bechler wrote on X.\nThe Trump administration's White House Crypto Summit represented a drastic departure from the previous administration's stance toward the industry and followed President Trump's executive order establishing a Bitcoin strategic reserve.\nRelated: Trump turned crypto from ‘oppressed industry’ to ‘centerpiece’ of US strategy\nThe price of Bitcoin declined by approximately 7.3% following the Bitcoin strategic reserve order and the White House Crypto Summit in a widely interpreted sell-the-news event.\nPresident Trump's executive order authorized the US government to acquire additional BTC only through asset forfeiture and budget-neutral strategies that do not create additional debt, deficits, or a burden on the taxpayer.\nThis caveat was met with disappointment from some Bitcoin maximalists, who hoped the US government would actively purchase additional BTC for the reserve.\nBitcoin’s current price action. Source: TradingView\nBitcoin exchange-traded funds (ETFs) recorded $370 million in outflows in the wake of the announcement, as traders viewed the executive order as underwhelming.\nA majority of investors now predict that Bitcoin will crash to the $70,000 price level in March before reclaiming $100,000.\nThe disappointment from the recent executive order and the ensuing negative price action sparked debate about whether Bitcoin has reached its cycle top or can still reach new heights in 2025.\nMagazine: Bitcoin dominance will fall in 2025: Benjamin Cowen, X Hall of Flame\n","date":1741531246033,"authors":[],"image_url":"","scraped_at":"2025-03-09T14:40:46.033225"}