{"id":"76a435c0d7354a557f66a84580ab3ba1","source":"Cointelegraph","title":"What is Bitcoin price going to do next? — Bear trap, bottom, or oversold bounce?","url":"https:\/\/cointelegraph.com\/news\/what-is-bitcoin-price-going-to-do-next-bear-trap-bottom-or-oversold-bounce","content":" Crypto traders expect Bitcoin price to remain choppy in the short term as a new range must be established after this week’s double-digit drawdown. \nThe Bitcoin bounce to $85,000 on Feb. 28 had traders hopeful that a bottom was in could be in peril after BTC (BTC) struggled to secure a higher high candlestick for the daily close. \nData from TRDR.io shows Bitcoin received a strong spot bid at Coinbase as the price fell to a 2025 low at $78,300, but what is yet to be seen is whether or not bulls will be able to provide enough purchasing volume to sustain their current momentum. \nBTC\/USDT 1-day chart. Source. TRDR.io\nCrypto trader Magus suggested that the most likely path forward for Bitcoin is range building in the $72,000 to $85,000 range for a number of weeks. \nIn a post on X, Magus shared the following chart and said, \nBTC\/USDT 1-day chart. Source: Magus \/ X \nIn addition to the absence of strong spot demand, trader Horse added that Bitcoin returns through the weekend could trend down based on traders’ interpretation of President Trump’s comments throughout the weekend. \nWhile the consensus among traders appears to project choppy price action for Bitcoin over the coming weeks, the 29% drawdown from the $110,000 all-time high is not extraordinary for BTC. As pointed out by crypto trader ‘intern,’ 30% corrections are par for the course during Bitcoin bull markets, and historically, they have proven to be optimal purchase opportunities. \nBitcoin price drawdowns during bull markets. Source: Intern \/ X \nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1740829852858,"authors":[],"image_url":"","scraped_at":"2025-03-01T11:50:52.858492"}