{"id":"7b425f3a263b6e035d96eec9ce4978cb","source":"Cointelegraph","title":"Bitcoin price rally to $88.5K obliterates bears as spot volumes soar — Will a tariff war stop the party?","url":"https:\/\/cointelegraph.com\/news\/bitcoin-rally-to-88-5-k-obliterates-bears-as-spot-volumes-soar-will-a-tariff-war-stop-the-party","content":" Bitcoin rallied for a second day as spot volumes soared, but geopolitics and a global tariff war could put a lid on BTC’s price upside. \nBitcoin price caught an unexpected bid by rallying to a session high at $88,500, but will the price gains be capped at a multimonth overhead resistance that is aligned with the 50-day moving average? \nKey points:\nBitcoin extended its April. 1 gains as news that the Trump administration had not finalized its “Liberation Day” tariffs emerged. \nIsrael, Mexico and India have already rolled back their tariffs on US imports or suggested that they will not do “tit for tat” tariffs in response to the expected April 2 US tariffs. \nBitcoin (BTC) trades slightly below a 3-month descending trendline resistance where the price has consistentlybeen rejected during past rallies. \nTotal market liquidations over the past 12-hour trading period have reached $145 million, with $69.4 million of the figure being Bitcoin shorts.  \nData from Kingfisher, CoinGlass and Velo show short liquidations playing a role in today’s push above $88,500. \nCrypto market liquidations in the past 12-hours. Source. CoinGlass \nFor the past few months, Bitcoin price has struggled to hold the gains accrued from rallies driven by leverage. Looking beyond futures markets, there are some positives that suggest that the market structure is slowly transitioning from bearish to bullish. \nAs shown in the chart below, recent rallies were accompanied by a strong bid in the spot market and the return of the Coinbase Pro premium, leading some analysts to speculate that the shift was influenced by buying from Strategy and other companies focused on building Bitcoin reserves. \nCoinbase premium index. Source: CryptoQuant\nOver the last two weeks, GameStop, MARA, Metaplanet and Strategy all announced plans to buy more Bitcoin, with GameStop being on the verge of purchasing and Strategy actively adding to its BTC position. \nGameStop secures $1.5B for possible BTC purchase. Source: Arkham\nIn the short-term, sustained spot buy volumes at Binance and Coinbase Pro, and the crypto and equities markets’ response to President Donald Trump’s “Liberation Day” tariffs are likely to be the most impactful factors that will influence the current bullish momentum seen in Bitcoin price.  \nRelated: Bitcoin price on verge of breaking 10-week downtrend — Is $90K BTC next?\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1743688077491,"authors":[],"image_url":"","scraped_at":"2025-04-03T13:47:57.491726"}