{"id":"7b623407ea1448d1cccbfb859cb68542","source":"Cointelegraph","title":"Bitcoin price metric hits ‘optimal DCA’ zone not seen since BTC traded in $50K to $70K range","url":"https:\/\/cointelegraph.com\/news\/bitcoin-price-hits-dca-zone-not-seen-since-btc-traded-50-k-70-k-range","content":" Bitcoin’s mega sell-off presents a rare chance to dollar-cost-average into a position as key onchain indicators suggest BTC trades at a discount. \nBitcoin's (BTC) price dropped to a new yearly low of $78,258 on Feb. 27, leading some analysts to suggest that the cryptocurrency is now in an optimal purchasing zone.\nBitcoin 1-day chart. Source: Cointelegraph\/TradingView\nCrazzyblock, a Bitcoin trader and verified analyst on CryptoQuant said that Bitcoin’s 60-day RCV reached its lowest level of -1.9 in the chart, signaling an ‘optimal DCA opportunity’ for the first time since July 2024. \nBitcoin 60-day RCV chart. Source: CryptoQuant\nThe 60-day realized value to market capitalization variance (RCV) is a metric that calculates the 60-day rolling average and standard deviation of BTC price. According to the metric, whenever the RCV value is below 0.30, it indicates a low-risk investment in the asset. A value between 0.30-0.50 implies a neutral environment, and above 0.5 means a high sell-off risk. \nThe analyst pointed out that the metric has been historically accurate in identifying undervaluation and overvaluation trends for BTC, and the current normalized RCV value presents a favorable buying opportunity based on “historical risk-reward dynamics.” The BTC proponent added,\nIn 2024, the RCV value flashed a DCA signal between May and July, where Bitcoin fluctuated between $70,000 and $50,000. Thus, it is essential to note that the RCV does not signal a bottom but highlights the low-risk, high probability of making gains in the long term. \nCrypto analyst Yonsei Dent pointed out that Bitcoin’s short-term holder SOPR (Spent Output Profit Ratio), which monitors realized profit or losses, had reached a sharp deviation below the lower Bolling Band. \nBitcoin SOPR range deviation data. Source: CryptoQuant\nBased on such deviations, BTC has registered a short-term rebound between 8%-42%, with recoveries also evident during the 2022 bear market.  \nRelated: How low can the Bitcoin price go?\nData from Santiment suggests that BTC’s price has been correlated with the accumulation and distribution behavior of wallets holding 10+ BTC. Whenever these addresses accumulate, Bitcoin progressively increases in value.\n \nBitcoin whales and sharks accumulation chart by Santiment. Source: X.com\nSantiment also highlighted that the “key stakeholders” have dumped roughly 6,813 BTC over the past week, its most extensive distribution since July 2024. \nSimilarly, Ki-Young Ju pointed out that Bitcoin’s spot ETF demand is weak, suggesting that a “price recovery could take some time.”\nRelated: Is BTC price about to fill a $78K Bitcoin futures gap?\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1740785880678,"authors":[],"image_url":"","scraped_at":"2025-02-28T23:38:00.678025"}