{"id":"82eb00d24ed67a759ae76e50601ece5f","source":"Cointelegraph","title":"Bitcoin whales absorb 300% of newly mined BTC supply — Is $100K next?","url":"https:\/\/cointelegraph.com\/news\/bitcoin-whales-absorb-300-newly-mined-btc-supply","content":" A BTC price technical breakout is underway that could send Bitcoin toward $100,000 by May. \nBitcoin’s (BTC) richest traders and investors are increasingly bullish on BTC despite facing downside risks from unfavorable macroeconomic factors, the latest onchain data suggests. \nBitcoin whales and sharks are now absorbing BTC at record rates—over 300% of yearly issuance—while exchanges are losing coins at a historic pace, according to Glassnode.\nNotably, Bitcoin’s yearly absorption rate by exchanges has plunged below -200% as outflows continue. This signals a growing preference for self-custody or long-term investment.\nMeanwhile, larger holders (100–1,000+ BTC) are scooping up more than three times the new issuance, marking the fastest rate of accumulation among sharks and whales in Bitcoin’s history. \nThis marks a structural shift as traditional finance increasingly adopts BTC, particularly with the approval spot Bitcoin ETFs last year. The result is less BTC supply on crypto exchanges and long-term bullish conviction among big holders.\nBitcoin whales holding over 10,000 BTC remain in strong accumulation territory, with their Trend Accumulation Score at around 0.7 as of April 18, according to Glassnode.\nThis metric quantifies cohort behavior from distribution (0) to accumulation (1). The score implies confidence among the largest holders of Bitcoin.\nIn contrast, the sell-off in smaller cohorts that have been distributing earlier in the year appears to be slowing down. That includes the 10–100 BTC and the 1-100 BTC groups, whose scores have climbed back to a neutral zone at around 0.5.\nEven the smallest cohort (\nOnchain analyst Mignolet adds that the whale behavior is similar to what preceded Bitcoin’s 2020 bull run.\nBitcoin has broken out of a multimonth falling wedge pattern, signaling a potential bullish reversal that could drive its price toward the $100,000 mark by May.\nA falling wedge forms when price action contracts between two downward-sloping trendlines and resolves with an upside breakout. Traders typically measure the wedge’s upside target by measuring its maximum height and adding the outcome to the breakout point. \nApplying this rule of technical analysis brings Bitcoin’s target to over $101,570.\nRelated: 4 reasons why Bitcoin price could rally to $90K in April\nConversely, BTC’s price is testing its 50-day (the red wave) and 200-day (the blue wave) exponential moving averages (EMAs) around $85,300 as resistance. A bearish rejection from these EMAs risks pushing BTC’s price toward the wedge’s upper trendline near $80,000. \n“The 200-day moving average remains overhead as resistance, and the horizontal level at $88,804 is still the key barrier to flip market structure and print a higher high,” wrote market analyst Scott Melker, adding: \nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1745068623358,"authors":[],"image_url":"","scraped_at":"2025-04-19T13:17:03.358746"}