{"id":"838f1d506670fa3e17bc6f4fec855615","source":"Cointelegraph","title":"FDIC resists transparency on Operation Chokepoint 2.0 — Coinbase CLO","url":"https:\/\/cointelegraph.com\/news\/fdic-transparency-operation-chokepoint-coinbase-clo","content":" At least 30 tech and crypto founders were reportedly “secretly debanked” in the US during Operation Chokepoint 2.0. \nSome US government agencies continue to deny transparency regarding their role in Operation Chokepoint 2.0, a period during the Biden administration when crypto and tech founders were allegedly denied banking services, according to Coinbase chief legal officer Paul Grewal.\nThe collapse of crypto-friendly banks in early 2023 sparked the first allegations of Operation Chokepoint 2.0. Critics, including venture capitalist Nic Carter, described it as a government effort to pressure banks into cutting ties with cryptocurrency firms.\nDespite recent regulatory shifts, agencies like the Federal Deposit Insurance Corporation (FDIC) continue to “resist basic transparency” efforts, Grewal wrote in a March 8 post on X.\n“They haven’t gotten the message,” he wrote.\nSource: Paul Grewal\nCoinbase has requested that the FDIC provide details in court on how it conducted “due diligence” to ensure no documentation related to the event was destroyed. However, the agency “repeatedly refused to do so,” Grewal said.\nHis comments come a day after the US Office of the Comptroller of the Currency (OCC) eased its stance on how banks can engage with crypto just hours after US President Donald Trump vowed to end the prolonged crackdown restricting crypto firms’ access to banking services.\nTrump’s remarks were made during the White House Crypto Summit, where he told industry leaders he was “ending Operation Chokepoint 2.0.”\nSource: Elon Musk\nAt least 30 tech and crypto founders were “secretly debanked” in the US during Operation Chokepoint 2.0, Cointelegraph reported in November 2024.\nRelated: FDIC chair, ‘architect of Operation Chokepoint 2.0’ Martin Gruenberg to resign Jan. 19\nGrewal claimed the FDIC has also not fully cooperated with Coinbase’s documentation requests under the Freedom of Information Act (FOIA):\nMoreover, Grewal said the FDIC has redacted a total of 53 pages, with many other pages containing “heavy redactions rendering the documents unintelligible.”\nGrewal added that his team requested that the FDIC give a “sworn testimony” to the court.\nOn March 4, Coinbase also submitted a FOIA request to the Securities and Exchange Commission (SEC) to find out how many investigations and enforcement actions were brought against crypto firms between April 17, 2021, and Jan. 20, 2025.\nRelated: Paolo Ardoino: Competitors and politicians intend to ‘kill Tether’\nTrump previously signed an executive order to end some banking challenges for Web3 companies and create clearer regulations for digital assets, Cointelegraph reported on Jan. 24.\nThe executive order excludes the US Federal Reserve and FDIC from cryptocurrency working groups, in a move that may put an end to the previous crypto industry debanking efforts, according to Caitlin Long, founder and CEO of Custodia Bank.\nMagazine:  Unstablecoins: Depegging, bank runs and other risks loom\n","date":1741454976341,"authors":[],"image_url":"","scraped_at":"2025-03-08T17:29:36.341824"}