{"id":"8436d214cc93f9a6f0a6d7e1c24751ba","source":"Cointelegraph","title":"$400M Web3 investment fund ABCDE halts new investments, fundraising","url":"https:\/\/cointelegraph.com\/news\/400-m-web3-investment-fund-abcde-halts-investments-fundraising","content":" Web3 fund ABCDE halts new investments and fundraising to support existing projects and launch its new crypto incubator, Vernal. \nWeb3 and blockchain-focused investment fund ABCDE is halting new investments, but the $400 million fund remains committed to supporting its existing projects.\nIn an April 19 X post, ABCDE co-founder and Huobi exchange founder Du Jun said the $400 million fund will no longer invest in new projects or raise capital for the second phase of the fund.\nHowever, Jun said the fund will continue to “post-investment support and exit arrangements of existing projects” to ensure the firm’s commitment to entrepreneurs and liquidity providers (LPs).\n“My personal work focus will also gradually shift from financial investment in the primary market to strategic investment-led and deep incubation-based, focusing more on industrial synergy and long-term value creation,” Jun added.\nThe announcement comes nearly three months after ABCDE’s last investment into an Ethereum layer-2 (L2) solution, Soon (Solana Optimistic Network), which raised $22 million through a non-fungible token sale to mark the launch of its mainnet, Cointelegraph reported on Jan. 22.\nThe Soon mainnet claims to outperform Solana in speed and efficiency, delivering average block times of 50 milliseconds compared to Solana’s 400 milliseconds.\nABCDE is a $400 million fund, with 28% of its investments in Bitcoin (BTC) scaling technology, 16% in Ethereum liquid staking derivatives finance (LSDFi) infrastructure, and an additional 12% invested in L2s, restaking and smart contract platforms, Cryptorank data shows.\nABCDE has invested over $40 million worth of capital into over 30 projects over the past three years, with an internal rate of return (IRR) “still at the global leading level,” despite the current market environment, Jun said.\nRelated: Trump family memecoins may trigger increased SEC scrutiny on crypto\nABCDE’s suspension of fundraising efforts was announced a month after the fund’s co-founder launched a new incubator brand, Vernal.\nThe new incubator is set to announce its shareholders and incubation rules for the first batch of projects in May, along with its first investments.\nJun said that the decision to halt ABCDE’s fundraising efforts was not made due to financial constraints or lack of funds but because of a fundamental concern for the current development trajectory of the crypto industry.\nRelated: Crypto, stocks enter ‘new phase of trade war’ as US-China tensions rise.\n“Frankly speaking, I am increasingly unable to agree with the current ecological atmosphere of the primary market,” Jun said in an April 19 X post, adding:\n“What is more worrying is that some primary funds not only have no reflection on this, but also hype up their ‘listed projects’ and short-term market value performance, but never mention the value creation of the projects themselves,” he added.\nCardano founder Charles Hoskinson has urged fourth-generation cryptocurrency projects to embrace more collaborative tokenomics to compete with major centralized tech companies entering the crypto industry.\n“The problem right now, with the way we’ve done things in the cryptocurrency space, is the tokenomics and the market structure are intrinsically adversarial. It’s sum 0,” Hoskinson said at Paris Blockchain Week on April 9. “Instead of picking a fight, what you have to do is you have to find tokenomics and market structure that allows you to be in a cooperative equilibrium.”\n“You can’t build a global ecosystem this way, and you can’t win this way,” he added. “Because here’s the thing. The incumbents are much larger.”\nMagazine: Your AI ‘digital twin’ can take meetings and comfort your loved ones\n","date":1745068597495,"authors":[],"image_url":"","scraped_at":"2025-04-19T13:16:37.495608"}