{"id":"84adb395f3f4613d3034af711b686c20","source":"Cointelegraph","title":"Genius Group says it’s been banned from buying more Bitcoin","url":"https:\/\/cointelegraph.com\/news\/ai-firm-genius-group-orced-sell-bitcoin-treasury","content":" The preliminary injunction blocking Bitcoin purchases is connected with a broader dispute surrounding a merger with Fatbrain AI that went sour in October last year. \nSingapore-based artificial intelligence firm Genius Group says it’s temporarily barred from expanding its Bitcoin treasury after a US court order has banned it from selling shares, raising funds and using investor funds to buy more Bitcoin.\nA New York District court issued the preliminary injunction (PI) and temporary restraining order (TRO) on March 13 in connection with a broader dispute surrounding its merger with Fatbrain AI, the Genius Group said in an April 3 statement.\nFatbrain AI and Genius Group completed a merger and purchase agreement in March 2024, but by Oct. 30, Genius initiated arbitration procedures to terminate, alleging fraud by Fatbrain AI executives connected to the deal.\nSource: Roger James Hamilton\nIn February, Fatbrain AI executives Michael Moe and Peter Ritz filed for the TRO and permanent injunction, blocking Genius Group from selling its shares, raising funds and buying more Bitcoin pending the arbitration outcome. \nThe injunction has forced Genius Group to close divisions, halt marketing activities and sell 10 Bitcoin (BTC) from its stash of 440, worth over $23 million at current prices, to continue funding its operations. The firm hasn’t ruled out more sales in the future.\n“Genius is taking all necessary measures to minimize Bitcoin sales but anticipates that it will need to downsize its Bitcoin Treasury in the coming months in the event the PI remains in place,” the firm said.\nFatbrain AI shareholders also filed two lawsuits against Fatbrain AI executives, including Moe and Ritz, and Genius Group, in April 2024, alleging violation of federal securities laws in connection with the merger, ASX law said in an October statement. \nTwo shareholder lawsuits against Fatbrain AI alleged conduct during the merger was fraudulent, which defrauded shareholders of $30 million. Source: ASX Law\nGenius Group was subsequently voluntarily dismissed from the suits on Feb. 14. \nGenius Group says the US court injunction has also forced it to break Singapore law by halting share compensation to employees as part of its employment agreements.\n“We never dreamed that it was possible that a US court could block the company from being able to issue shares, raise funds or buy Bitcoin — all actions that would normally be decided by a public company's shareholders or Board rather than a court,” said Genius Group CEO Roger James Hamilton.\nRelated: Rumble embraces Trump-era crypto strategy with $17M BTC purchase\nHe said the firm will “continue to fly the flag for Bitcoin,” even when legally banned from building out its treasury.\nFatbrain AI didn’t immediately respond to Cointelegraph’s request for comment.\nArtificial intelligence firm Genius Group first announced in November 2024 that it had taken the first steps to build a Bitcoin treasury by purchasing 110 Bitcoin for $10 million.\nThe firm had earlier announced its overall goal of committing 90% or more of its current and future reserves to be held in Bitcoin, with an initial target of $120 million, which saw the stock price surge by 66%. \nGenius Group’s share price is down 9.80% in the last trading session to $0.23, with a further 3.74% drop after the bell to $0.22, Google Finance data shows.\nGenius Group’s share price went down during the last trading session and after the bell. Source: Google Finance \nThe stock hit an all-time high of over $96 in June 2022 but has since lost over 99% of its value. \nMagazine: XRP win leaves Ripple a ‘bad actor’ with no crypto legal precedent set\n","date":1743766025335,"authors":[],"image_url":"","scraped_at":"2025-04-04T11:27:05.335178"}