{"id":"85c187150ec8d78c364dc43d2c6cc9eb","source":"Cointelegraph","title":"Corporate Bitcoin treasuries drop more than $4B on US tariff hike impact","url":"https:\/\/cointelegraph.com\/news\/corporate-bitcoin-treasuries-down-4b-us-tariff-hike-impact","content":" Corporate Bitcoin holdings have sunk to about $54.5 billion from nearly $59 billion on April 2. \nCorporate Bitcoin (BTC) treasuries collectively shed more than $4 billion in value after US President Donald Trump’s tariffs triggered a global market sell-off, data shows. \nAs of April 7, corporate Bitcoin holdings are worth approximately $54.5 billion in the aggregate, down from roughly $59 billion before April 2, according to data from BitcoinTreasuries.net.\nThe cryptocurrency’s volatility has also weighed on publicly traded Bitcoin holders’ share prices. \nThe Bitwise Bitcoin Standard Corporations ETF (OWNB) — an exchange-traded fund (ETF) tracking a diverse basket of corporate Bitcoin holders — has lost more than 13% since Trump announced sweeping US import tariffs on April 2, according to Yahoo Finance.\nEven shares of Strategy — the de facto Bitcoin hedge fund founded by Michael Saylor that pioneered corporate Bitcoin buying — are down, clocking losses of more than 13% since April 2, Google Finance data showed. \nThe losses highlight ongoing concerns about Bitcoin’s increasing popularity as a corporate treasury asset. Historically, corporate treasuries hold extremely low-risk assets like US Treasury Bills. \n“Cryptocurrencies' high volatility and uncertain regulatory landscape are misaligned with the fundamental goals of treasury management [such as] stability, liquidity, and capital preservation,” David Krause, a finance professor at Marquette University, said in a January research publication. \nEntities holding Bitcoin. Source: BitcoinTreasuries.NET\nRelated: Bitcoin, showing 'signs of resilience', beats stocks, gold as equities fold — Binance\nIn 2024, surging Bitcoin prices pushed Strategy’s shares up more than 350%, according to data from FinanceCharts. \nStrategy’s success has inspired dozens of copycats, but investors are becoming skeptical.\nIn March, GameStop lost nearly $3 billion in market capitalization as shareholders second-guessed the videogame retailer’s plans to stockpile Bitcoin. \n“There are question marks with GameStop's model. If bitcoin is going to be the pivot, where does that leave everything else?” Bret Kenwell, US investment analyst at eToro, told Reuters on March 27. \nThe case for Bitcoin as a corporate treasury asset. Source: Fidelity Digital Assets\nStill, adding Bitcoin to corporate treasuries can “potentially be a valuable hedge against growing fiscal deficits, currency debasement, and geopolitical risks,” asset manager Fidelity Digital Assets said in a 2024 report.\nThat thesis may already be playing out as Trump’s tariffs rattle markets, Binance said in an April 7 research report.  \n“[I]n the wake of recent tariff announcements, BTC has shown some signs of resilience, holding steady or rebounding on days when traditional risk assets faltered,” Binance said.\nInvestors “will be watching closely to see if BTC is able to retain its appeal as a non-sovereign, permissionless asset in a protectionist global economy,” according to the report.\nMagazine: Bitcoin heading to $70K soon? Crypto baller funds SpaceX flight: Hodler’s Digest, March 30 – April 5\n\n\n","date":1744105255619,"authors":[],"image_url":"","scraped_at":"2025-04-08T09:40:55.619575"}