{"id":"8d5fef0cd816ea33ea9ed6f70d5bf498","source":"Cointelegraph","title":"Bitcoin hashrate tops 1 Zetahash in historic first, trackers show","url":"https:\/\/cointelegraph.com\/news\/bitcoin-hashrate-one-zetahash-first-time-ever","content":" The Bitcoin network rate briefly soared above 1 Zetahash per second, multiple data sources show, making it one of the world’s most powerful supercomputers. \nThe Bitcoin network hashrate has topped 1 Zetahash per second (ZH\/s) for the first time in Bitcoin’s 16-year history, according to several blockchain data sources.\nBitcoin’s hashrate crossed the milestone on April 5 at a peak of 1.025 ZH\/s, according to mempool.space data, while BTC Frame data said it hit 1.02 ZH\/s a day earlier.\nData from Coinwarz says that Bitcoin hashrate soared to as high as 1.1 ZH\/s on April 4 at block height 890,915 — however, the same data indicates that Bitcoin first crossed 1 ZH\/s on March 24.\nBitcoin’s hashrate has fallen back below 0.95 ZH\/s on April 7 since reaching 1 ZH\/s. Source: BTC Frame\nThe differences result from the varying approaches used to calculate hashrate — such as when block times and difficulty adjustments are measured, which Bitcoin nodes and miner pools are used to pull data from and more.\nBitcoin cypherpunk Jameson Lopp also previously pointed out that estimating Bitcoin’s hashrate with one “trailing block” as opposed to five can result in a difference of over 0.04 ZH\/s.\n“Viewing the raw Hashrate metric can be deceiving due to random variations in block times,” added Blockware Solutions head analyst Mitchell Askew, who pointed out that Bitcoin’s 30-day moving average hashrate is still around 0.845 ZH\/s mark in a note to Cointelegraph.\nDespite the discrepancies, the feat highlights the massive amount of computational power and increasing decentralization of the Bitcoin network, making it more secure than ever and significantly reducing the likelihood of a 51% attack.\nThe Bitcoin network’s reported rise to 1 ZH\/s — equivalent to 1,000 Exahashes per second — marks a 1,000x increase since late January 2016, when Bitcoin first hit 1 EH\/s for the first time. \nThe second-largest proof-of-work crypto network, Litecoin, currently boasts a hashrate of 2.49 Petahashes per second according to Coinwarz — making it around 40,000 times less computationally powerful than Bitcoin.\nSource: Pierre Rochard\nAskew noted that the huge rise in hashrate has coincided with more commercial Bitcoin mining firms competing to solve Bitcoin blocks in recent years.\n“Miners are doubling down: expanding sites and plugging in more efficient machines,” Askew said, adding that less efficient miners could soon be washed out unless Bitcoin’s (BTC) price rallies again in the coming months.\nMARA Holdings is the largest Bitcoin miner with more than 50 EH\/s of compute power, while the largest share of hashrate is channeled to Bitcoin mining pools Foundry USA Pool and AntPool, according to the Hashrate Index.\nRelated: Bitcoin price drops below $80K as stocks face 1987 Black Monday rerun\nAt least 24 publicly listed Bitcoin companies have machines set up to mine Bitcoin, according to CompaniesMarketCap.com. \nAmong the other large miners contributing hashrate are Riot Platforms, Core Scientific, CleanSpark, Hut 8 Mining and TeraWulf.\nThe new all-time high in Bitcoin hashrate came in the middle of a sharp market downturn — with Bitcoin (BTC) falling nearly 10% over the last four days to $78,750, while US stocks saw an estimated $6.6 trillion loss on April 3 and 4 — the largest two-day loss ever.\nMuch of the fall has been attributed to US President Donald Trump’s tariff plans, which many industry analysts say are sparking recession fears.\nMagazine: Financial nihilism in crypto is over — It’s time to dream big again\n","date":1744039781750,"authors":[],"image_url":"","scraped_at":"2025-04-07T15:29:41.750948"}