{"id":"94a4a7c9a3b987392227cc34157576ab","source":"Cointelegraph","title":"Crypto stocks down, IPOs punted amid tariff tumult","url":"https:\/\/cointelegraph.com\/news\/crypto-stocks-down-ipos-punted-amid-tariff-tumult","content":" Crypto firms take a hit as Trump’s new tariffs rattle markets, sinking stocks and stalling IPO ambitions across sectors. \nCryptocurrency firms felt the heat from US President Donald Trump’s sweeping tariff rollout this week as market turbulence sent share prices tumbling and foiled initial public offering (IPO) plans. \nFrom exchanges to Bitcoin (BTC) miners, crypto stocks suffered as much, if not more, than shares of other companies — despite the industry’s warm relationship with the US president. \nOn April 2, Trump announced he was placing tariffs of at least 10% on practically all imports into the United States and adding additional \"reciprocal\" tariffs on some 57 countries. \nSince then, major US stock indices — including the S&P 500 and Nasdaq — tumbled by roughly 10% as traders braced for a looming trade war. \nBitcoin miners sold off on Trump’s tariff news. Source: Morningstar\nRelated: Bitcoin ‘decouples,’ stocks lose $3.5T amid Trump tariff war and Fed warning of ‘higher inflation’\nCrypto exchange Coinbase — a prominent ally of Trump during the November US elections — experienced a similarly severe sell-off, with its stock price dropping by roughly 12% during the same period, according to data from Google Finance.\nBitcoin miners are also taking a hit. The CoinShares Crypto Miners ETF (WGMI) — which tracks a diverse basket of Bitcoin mining stocks — has lost roughly 13% of its value since immediately prior to Trump’s April 2 announcement, according to data from Morningstar. \nEven Strategy, one of the best-performing stocks of 2024, wasn’t immune. Its share price has fallen by around 6% on the news, Google Finance data showed.\nAccording to Reuters, investment bank JPMorgan has raised its estimated odds of a global economic recession in 2025 to 60% from 40% previously. \n\"Disruptive U.S. policies have been recognized as the biggest risk to the global outlook all year,\" JP Morgan reportedly said.\n\"The effect ... is likely to be magnified through (tariff) retaliation, a slide in U.S. business sentiment and supply-chain disruptions.\"\nStrategy’s shares also dropped this week. Source: Google Finance\nThe impact of US tariffs hasn’t been limited to stock price volatility. Stablecoin issuer Circle has reportedly paused plans for a 2025 IPO, citing market turbulence. \nAccording to The Wall Street Journal, Circle is “waiting anxiously” before taking further steps after filing to take the company public on April 1. \nIt is among several companies — including fintech Klarna and ticketing service StubHub — reportedly considering altering or shelving IPO plans. \nOne exception may be Bitcoin itself, which some analysts say is finally “decoupling” from the broader market. \nBitcoin’s spot price has held above $82,000 this week, even as US equities markets collapsed.\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n","date":1743859909600,"authors":[],"image_url":"","scraped_at":"2025-04-05T13:31:49.600676"}