{"id":"94c12da125c5bf8e30117dbf94629660","source":"Cointelegraph","title":"Why is the crypto market down today?","url":"https:\/\/cointelegraph.com\/news\/why-is-the-crypto-market-down-today","content":" The cryptocurrency market is down today as investors view crypto products funds outflows and Trump’s policies as cues for bearish market momentum. \nThe cryptocurrency market erased all gains from President Trump’s US Crypto Strategic Reserve announcement, plunging by over 14.7% in seven days to reach $2.7 trillion on March 10.\nTop cryptocurrencies and their 24-hour performances. Source: Coin360\nSeveral factors have contributed to the latest drop in crypto prices, including:\nTrump’s acknowledgement that his policies will cause short-term pain to the economy.\nInvestors are risk-off amid the continued outflows from crypto investment products.\nTOTAL drops toward the technical target of a descending triangle.\nPresident Trump’s recent statements have cast a shadow over the crypto market, tempering the enthusiasm that followed his pro-crypto rhetoric earlier in 2025. \nKey points:\nBitcoin  (BTC) declined 4% in the last 24 hours.\nEther (ETH) is down 3.2% over the last 24 hours to trade just above $2,000.\nSolana (SOL) and XRP (XRP) have also recorded losses, down 7.2% and 4.5%, respectively.\nCompounding the issue are the significant liquidations in the derivatives market. \nA total of $650.80 million in liquidations has been recorded in the past 24 hours.\nLong positions took the hardest hit, with $595.75 million liquidated.\nCrypto market liquidation heatmap. Source: CoinGlass\nBitcoin and Ethereum were the biggest casualties, with $264.22 million and $114.76 million in liquidations, respectively.\nWhen long positions are liquidated, traders’ holdings are automatically sold, increasing market supply and driving prices lower.\nMore critically, US President Donald Trump acknowledged that markets could see short-term pain from his policies, including the trade tariffs on Canada, Mexico, and China and budget-cutting plans.\n“There could be a little disruption,\" said Trump in an interview with Fox News, adding:\nThe market, which surged post-election on hopes of a deregulated, crypto-friendly administration, is now grappling with the reality that Trump’s broader economic agenda may introduce headwinds before any crypto-specific benefits materialize.\nThe crypto market’s ongoing correction aligns with the huge capital outflows from crypto investment products. \nKey takeaways:\nDigital asset investment products saw outflows for the fourth week in a row, totaling $876 million during the week ending March 7, as per CoinShares report.\nThis brings outflows to $4.75 billion in the last four weeks, reducing the year-to-date inflows to $2.6 billion.\nThis indicates institutional investors decreased their exposure to digital assets.\nBitcoin saw the biggest share of outflows, totaling $756 million.\nTotal assets under management have declined by $39 billion from their peak to the current value of $142 billion, the lowest point since mid-November 2024. \nCapital flows for crypto investment products. Source: CoinShares\nCoinShares head of research James Butterfill attributed this to “negative sentiment,” suggesting “capitulation” among investors.\nAdditionally, the Crypto Fear & Greed Index plummeted to 10 on March 10, its lowest since July 2022, indicating “extreme fear.”\nThe Crypto Fear & Greed Index. Source: Alternative.me\nFrom a technical perspective, today’s crypto market’s decline is part of a correction trend that saw TOTAL—the total market capitalization of all cryptocurrencies—drop below a descending triangle pattern.\nA descending triangle is a bearish continuation pattern, forming when the price makes lower highs while maintaining a flat support level at the bottom.\nThe pattern is confirmed when the price breaks below the support level with high volume and drops by as much as the triangle’s maximum height.\nAs of March 10, TOTAL had fallen to the pattern’s target of $2.6 trillion at the 50-weekly simple moving average (SMA).\nTOTAL\/USD weekly chart. Source: Cointelegraph\/TradingView\nIf selling pressure persists, the 100–week SMA at $2 trillion could become the next downside target.\nHolding the 50-week SMA as support may strengthen the ongoing rebound toward the pattern’s lower trendline, aligning with the $3.1 trillion level.\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1741616518702,"authors":[],"image_url":"","scraped_at":"2025-03-10T14:21:58.702429"}