{"id":"9b0d26a9e9a28c771fd3ac65ba6094da","source":"Cointelegraph","title":"Trump to host first White House crypto summit on March 7","url":"https:\/\/cointelegraph.com\/news\/trump-white-house-crypto-summit-march-7","content":" President Trump will host the first White House Crypto Summit on March 7, bringing together industry leaders to discuss regulations, stablecoins and Bitcoin reserve legislation. \nUS President Donald Trump will host the first White House Crypto Summit on March 7, bringing together industry leaders to discuss regulatory policies, stablecoin oversight, and the potential role of Bitcoin in the US financial system.\nThe attendees will include “prominent founders, CEOs, and investors from the crypto industry,” along with members of the President’s Working Group on Digital Assets, according to an announcement shared by the White House “AI and crypto czar,” David Sacks, in a March 1 X post.\nThe summit will be chaired by Sacks and administered by Bo Hines, the executive director of the Working Group.\nSource: David Sacks\nSacks was appointed White House Crypto and AI and Czar on Dec. 6, 2024, to “work on a legal framework so the Crypto industry has the clarity it has been asking for, and can thrive in the U.S.,” Trump wrote in the announcement. \nPart of Sacks’ role will be to “safeguard” online speech and “steer us away from Big Tech bias and censorship,” Trump added.\nSource: Donald Trump\nTrump has previously signaled that he intends to make crypto policy a national priority and make the US a global hub for blockchain innovation. The upcoming summit may set the tone for crypto regulations over the next four years.\nSacks only has two years to push through pro-crypto policies before the 2026 midterm elections in the US, Joe Doll, the general counsel for NFT marketplace Magic Eden, told Cointelegraph in an interview.\nAccording to Doll, the threat of a gridlocked government could stifle regulations, and the current administration must push through pro-crypto policies while still in control of both chambers of Congress.\nRelated: Bitcoin risks deeper drop if $75K support fails amid macro concerns\nWhile there are no additional details about the summit’s agenda, stablecoin regulation and legislation related to a potential strategic Bitcoin (BTC) reserve have been at the forefront of regulatory discussions in the US.\nThe White House announcement came days after Jeremy Allaire, co-founder of Circle, the company behind the world’s second-largest stablecoin, said that stablecoin issuers worldwide should be required to register with US authorities.\nCiting consumer protection, Allaire argued that US dollar-based stablecoin issuers should not get a “free pass,” enabling them to “ignore the US law and go do whatever the hell you want wherever and sell into the United States.” Allaire told Bloomberg:\nThe upcoming summit may shed more light on upcoming stablecoin legislation, considering Sacks previously stated that stablecoins could “extend the dollar's dominance internationally.”\nRelated: Altseason 2025: ‘Most altcoins won’t make it,’ CryptoQuant CEO says\nInterest in a US-based strategic Bitcoin reserve is also on the rise. So far, at least 24 states have introduced legislation related to a potential Bitcoin reserve, Bitcoinlaws data shows.\nUS states with Bitcoin reserve bill propositions. Source: Bitcoinlaws\nHowever, the state-level Bitcoin reserve initiatives may not represent a pivotal moment for Bitcoin; they are only a “symbolic move” unless a significant purchase is announced, according to Iliya Kalchev, dispatch analyst at Nexo.\n“Unless the hearing unveils a near-term purchase plan or a major policy shift, the market’s response will likely be mild, as Texas’ pro-crypto stance is already well known,” Kalchev told Cointelegraph.\nBitcoin has averaged over 1,077% returns over the past five years, showing the lucrative potential of a long-term holding strategy.\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n","date":1740830382015,"authors":[],"image_url":"","scraped_at":"2025-03-01T11:59:42.015572"}