{"id":"9be075ba66996c0bce0cea3411e8c5af","source":"Cointelegraph","title":"Black Monday 2.0? 5 things to know in Bitcoin this week","url":"https:\/\/cointelegraph.com\/news\/black-monday-2-0-5-things-bitcoin-this-week","content":" Bitcoin battles everything from a \"death cross\" to record low sentiment as US trade tariffs wreak havoc across global markets. Will 2021 prices return? \nBitcoin (BTC) is turning back the clock this week as tariff mayhem drags BTC price action toward 2021.\nBitcoin is giving up bull market support lines left and right as a new “death cross” completes on the BTC\/USD daily chart.\nCPI week is firmly overshadowed by US trade tariffs and their increasingly global impact on stock markets.\nBoth crypto and TradFi market participants are drawing comparisons to “Black Monday” 1987 and the COVID-19 cross-market crash.\nBitcoin’s speculative investor base is firmly out of pocket and likely increasingly tempted to panic sell.\nSentiment everywhere is nonexistent, with the TradFi Fear & Greed Index recording its lowest score in history.\nBitcoin risks falling below its old all-time highs from March 2024 next, Data from Cointelegraph Markets Pro and TradingView shows.\nBTC\/USD 1-hour chart. Source: Cointelegraph\/TradingView\nAfter slipping below $75,000 for the first time since November, BTC\/USD is rapidly reawakening long-forgotten bull market support lines. These include $69,000, a level that first appeared in 2021.\nThe dive, which came as a copycat move several days after stock markets began to suffer major losses, caught many by surprise.\nIs our uncorrelated hedge in the room right now?\n“This is $ BTC’s last chance to maintain its macro uptrend structure,” analyst Kevin Svenson summarized in a warning on X.\nBTC\/USD 1-day chart. Source: Kevin Svenson\/X\nAmong the trend lines now lost as support is the 50-week exponential moving average (EMA) at around $77,000.\nIn an X thread on the coming week, trader CrypNuevo described price violating that level as the “only short triggerr I’ll be paying attention to.”\n“If we drop below support and get back above it, then I’ll consider this as a deviation and that will be my long trigger fo a push up back to $87k,” he wrote.\nBTC\/USDT 1-week chart with 50EMA. Source: CrypNuevo\/X\nTrading resource Material Indicators flagged a telltale “death cross” on daily timeframes. This typical bearish signal involves the 50-day simple moving average (SMA) crossing below its 200-day equivalent.\n“The momentum carrying through that Death Cross, puts BTC at a critical macro support test,” it told X followers. \nBTC\/USD 1-day chart with 50, 200 SMA. Source: Cointelegraph\/TradingView\nLike last week, US trade tariffs are the major talking point across financial markets worldwide.\nThe impact of measures announced last week continues to be felt, as downside momentum on risk assets now becomes fueled by the prospect of more tariffs set for release on April 9.\nSpeaking to mainstream media over the weekend, Commerce Secretary Howard Lutnick confirmed that the US government would go ahead with the measures without delay.\n“The tariffs are coming,” he told CBS News.\nWith sentiment diving and panic among market participants from trading desks to hedge funds, little attention is paid to the week’s other potential volatility catalysts.\nThese will come in the form of US inflation data, itself a key topic as tariffs risk causing unexpected price growth.\nThe March prints of the Consumer Price Index (CPI) and Producer Price Index (PPI) are due on April 10 and 11, respectively.\nPreviously, Jerome Powell, chair of the Federal Reserve, said that while tariffs would have a palpable effect on the US inflation battle, it would be difficult to assess this accurately in advance.\n“As the new policies and their likely economic effects become clear, we will have a better sense of the implications for the economy and for monetary policy,” he subsequently said during a speech last week.\nFed target rate probability comparison for May FOMC meeting. Source: CME Group\nMarket expectations of the Fed easing policy to compensate for the tariffs are clearly reflected in interest rate forecasts.\nThe latest data from CME Group’s FedWatch Tool now shows that consensus favors a 0.25% rate cut at the Fed’s May meeting — sooner than the June deadline assumed until this weekend.\nIn informal circles, including social media and prediction platforms such as Polymarket, bets of an “emergency” rate cut coming sooner are rising rapidly.\n“The Federal Reserve may have to make an emergency rate cut soon,” Professional Capital Management founder and CEO Anthony Pompliano predicted at the weekend. \nOdds for 2025 Fed rate cut as of April 7 (screenshot). Source: Polymarket\nIn the short term, the “effects” of tariffs are feared to include a marketwide crash similar to “Black Monday” in 1987. \nAs Cointelegraph reported, market responses to the first round of reciprocal tariffs laid the foundations for turmoil at the upcoming Wall Street open.\nA 10% dip in two consecutive days has only happened for the fourth time in history.October 1987.October 2008.March 2020.April 2025.In 1987 & 2020, it marked the bottom.In 2008, it took one more month to mark the bottom.\nFor trader, analyst and entrepreneur Michaël van de Poppe, crypto’s Black Monday moment is already here.\n“I think we’ll see a rollercoaster 1-2 weeks in which we’re having a test of the lows for Bitcoin. It can go as deep as $70K from here,” he warned X followers on April 7.\nVan de Poppe saw an emergency Fed rate cut as the only logical escape path for stemming the risk-asset bleed.\nBTC\/USDT 1-day chart with RSI data. Source: Michaël van de Poppe\/X\nTrading resource The Kobeissi Letter pointed to heavy losses in both Chinese and Japanese stocks during the week’s first Asia trading session.\n“We are seeing the market’s first circuit breakers since March 2020,” it reported.\nKobeissi described market sentiment as “polarized,” drawing multiple comparisons to the COVID-19 cross-market crash in March 2020 and beyond.\n“This is by far the most panic we have seen in the market since March 2020. In fact, we may be nearing investor panic levels ABOVE March 2020,” it added. \nOn Bitcoin, the investor cohort likely first to capitulate are short-term holders (STHs), the market’s more speculative entities with a buy-in date within the last six months.\nAs Cointelegraph reported, these investors are highly sensitive to BTC price volatility, and that their panic selling creates a vicious circle for the market.\nData from onchain analytics platform CryptoQuant now shows that the STH cohort is falling increasingly into the red.\nThe Spent Output Profit Ratio (SOPR) metric, which tracks STH coins moving in profit or loss, is currently below breakeven.\n“When STH-SOPR falls below 1.0, it reflects that short-term investors are realizing losses — a classic signal of capitulation,” CryptoQuant contributor Yonsei Dent noted in one of its “Quicktake” blog posts.\nBitcoin STH-SOPR chart. Source: CryptoQuant\nBelow $80,000, BTC\/USD is now comfortably under the aggregate cost basis for STH investors, CryptoQuant confirms.\nBitcoin’s total aggregate cost basis, which includes long-term holders, currently sits at $43,000.\nBitcoin STH cost bases. Source: CryptoQuant\nIn a sobering yet arguably bizarre move, the extent of bearish sentiment on traditional markets, as measured by the Fear & Greed Index, has fallen to extremes.\nRelated: Bitcoin crash risk to $70K in 10 days increasing — Analyst says it’s BTC’s ‘practical bottom’\nThe latest data from the Index, which uses a basket of factors to compute the market mood, gives a reading of just 4\/100.\n“It’s never been this low: not in COVID, not after FTX collapse,” crypto commentator Atlas noted.\nFear & Greed Index (screenshot). Source: CNN\nCrypto continues to weather the storm somewhat better, with the Crypto Fear & Greed Index at 23\/100 on April 7.\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\nBeyond the panic, some voices are cautiously hinting that now is an ideal moment to “buy the dip,” whether on stocks or crypto.\n“This doesn’t necessarily mean the absolute bottom is in, but is generally at least a local opportunity,” Charles Edwards, the founder of quantitative Bitcoin and digital asset fund Capriole Investments, argued in an X thread.\nEdwards tallied up both bullish and bearish arguments, and concluded that much risk remained, especially to Bitcoin’s bull market.\n“To be fair Bitcoin did very well last week, but has played catch up (to the downside) over the weekend. Pending some large unforeseen news, it’s going to be hard for Bitcoin to fight a correlation=1 event across risk assets, we saw something similar in early 2020,” he commented. \nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\n","date":1744039777348,"authors":[],"image_url":"","scraped_at":"2025-04-07T15:29:37.348445"}