{"id":"9e571cb048329b032725bc5beaac7cf2","source":"Cointelegraph","title":"Crypto, DeFi may widen wealth gap, destabilize finance: BIS report","url":"https:\/\/cointelegraph.com\/news\/crypto-adoption-critical-mass-regulation-wealth-gap-bis","content":" The Bank for International Settlements warns that crypto and stablecoins may destabilize finance and widen inequality, urging stronger regulation in response. \nThe growing adoption of cryptocurrencies may pose risks to the traditional financial system and exacerbate wealth inequality, according to the Bank for International Settlements (BIS).\nIn an April 15 report, the BIS warned that the number of investors and amount of capital in crypto and decentralized finance (DeFi) have “reached a critical mass,” with investor protection becoming a “significant concern for regulators.”\nThe size of the crypto market signals that authorities should be worried about the “stability of crypto over and above the role it may have for TradFi and the real economy,” the report states, highlighting the role of stablecoins, which the BIS said have “become the means through which participants transfer value within crypto.”\nThe report calls for targeted stablecoin regulation on stability and reserve asset requirements that will guarantee the redemption of stablecoins for US dollars during “stressed market conditions.”\nRelated: Spar supermarket in Switzerland starts accepting Bitcoin payments\nThe report comes two weeks after the US House Financial Services Committee passed the Stablecoin Transparency and Accountability for a Better Ledger Economy, or STABLE Act, with a 32–17 vote on April 2.\nThe STABLE Act aims to create a clear regulatory framework for dollar-denominated payment stablecoins, emphasizing transparency and consumer protection.\nOn March 13, the GENIUS Act, short for Guiding and Establishing National Innovation for US Stablecoins, passed the Senate Banking Committee by a vote of 18–6. The act aims to establish collateralization guidelines and require full compliance with Anti-Money Laundering laws from stablecoin issuers.\nRelated: $400M Web3 investment fund ABCDE halts new investments, fundraising\nThe BIS also raised concerns about how crypto markets may worsen income inequality by enabling larger investors to capitalize on the emotions of less sophisticated retail participants, as seen during the FTX collapse in 2022.\n“As prices tumbled in 2022, users actually traded more,” the BIS report noted. “Most disturbingly, large bitcoin holders (“whales”) were selling as ordinary retail investors (“krill”) were buying.” It added:\nThe report concludes that DeFi and TradFi have similar underlying economic drivers, but DeFi’s “distinctive features,” like “smart contract and composability,” present new challenges that need proactive regulatory interventions to “safeguard financial stability, while fostering innovation.”\nMagazine: Uni students crypto ‘grooming’ scandal, 67K scammed by fake women: Asia Express\n","date":1745068593742,"authors":[],"image_url":"","scraped_at":"2025-04-19T13:16:33.742578"}