{"id":"a1c3663c4289dc88f8a83b9dff3c34c2","source":"Cointelegraph","title":"Smart money still hunting for memecoins despite end of ‘supercycle’","url":"https:\/\/cointelegraph.com\/news\/smart-money-hunting-meme-tokens-end-memecoin-supercycle","content":" Smart money traders continue seeking speculative investment opportunities despite signs the memecoin “supercycle” has ended. \nThe most successful cryptocurrency traders are still chasing quick profits in memecoins, despite signs that the broader “supercycle” for the speculative assets may be winding down. The shift follows recent disappointment tied to memecoin launches associated with US President Donald Trump.\nThe industry’s most successful cryptocurrency traders by returns — tracked as “smart money” traders on Nansen’s blockchain intelligence platform — continue hunting for quick memecoin returns.\nWhile growing stablecoin holdings show increased caution, smart money remains open to speculative plays, according to Nicolai Sondergaard, a research analyst at Nansen.\n“There was the recent meme surge and smart money is always happy to capitulate on that. But they’re also happy to rotate out of these quickly as well,” he said during Cointelegraph’s Chainreaction live show on X.\n“The recent meme frenzy was just a fun play they worked on, while the broader market is sorting out the direction because memecoins aren’t necessarily affected by the same macroeconomy as Bitcoin and Ethereum,” he added.\nRelated: Bitcoin holds firm as stocks lose $5T in record Trump tariff sell-off\nThe analyst’s insights came a week after a savvy trader turned an initial investment of just $2,000 into $43 million with the popular Pepe (PEPE) cryptocurrency, Cointelegraph reported on March 30.\nSavvy Pepe trader, transactions. Source: Lookonchain\nHowever, the trader didn’t manage to sell the top but still made a realized profit of over $10 million, despite Pepe’s over 70% decline from its all-time high.\nRelated: Trump family memecoins may trigger increased SEC scrutiny on crypto\nThe launch of the Official Trump (TRUMP) memecoin on Jan. 18 may have signaled the end of the memecoin “supercycle.”\n“Pump.fun has been synonymous with the “memecoin supercycle,” as it accounts for over 70% of tokens launched on Solana, according to a Binance research report shared with Cointelegraph.\nPump.fun usage metrics. Source: Binance research report\nThe memecoin launchpad’s weekly usage metrics peaked on the week of Trump’s inauguration and have since declined. Total active wallets on Pump.fun fell from 2.85 million on the week of Jan. 20 to just 1.44 million as of March 31.\nThe decline is mainly attributed to a decay in investor sentiment, a Binance spokesperson told Cointelegraph, adding:\n“Broader macroeconomic uncertainty, including volatility driven by global tariff policies, may have further dampened speculative appetite for memecoins more generally,” the spokesperson said.\nTRUMP\/USD, all-time chart. Source: CoinMarketCap\nMeanwhile, the TRUMP token is down more than 87% from its peak of $75.35, reached on Jan. 19. The token fell over 8% in the past week, CoinMarketCap data shows.\nMagazine: BTC’s ‘reasonable’ $180K target, NFTs plunge in 2024, and more: Hodler’s Digest Jan 12–18\n","date":1743868541586,"authors":[],"image_url":"","scraped_at":"2025-04-05T15:55:41.586411"}