{"id":"a2414c5f6662bc7a067651d7f9474b6a","source":"Cointelegraph","title":"US federal agencies to report crypto holdings to Treasury by April 7","url":"https:\/\/cointelegraph.com\/news\/federal-agencies-crypto-holdings-disclosure-deadline","content":" While federal agencies are required to report their holdings to the Treasury secretary, they are not required to disclose their holdings to the public. \nUS federal agencies are expected to disclose their cryptocurrency holdings to the Department of the Treasury by April 7, following an executive order signed by President Donald Trump earlier this year.\nCiting an unidentified White House official, journalist Eleanor Terrett reported that the deadline for federal agencies to report their crypto holdings to Treasury Secretary Scott Bessent is April 7. \nThe disclosures will remain confidential for now. “Unclear as of now if and when the findings could be made public,” Terrett wrote.\nSource: Eleanor Terret\nThe reporting requirement followed an executive order signed on March 7 that directed the creation of a Strategic Bitcoin Reserve and a broader Digital Asset Stockpile. The Bitcoin (BTC) reserve will be seeded with BTC forfeited to federal agencies through civil or criminal asset seizures.\nWhite House AI and crypto czar David Sacks described the reserve as a “digital Fort Knox for the cryptocurrency,” saying that the US will not sell any BTC held in the reserve. “It will be kept as a store of value,” Sacks added. \nSacks previously lamented the US government’s sales of 195,000 BTC for $366 million. The official said the BTC sold by the US government could’ve gone for billions if it had only held on to the assets. \nThe reserve will initially be seeded by the BTC kept by the Treasury, while the other federal agencies will “evaluate their legal authority” to transfer their BTC into the reserve. \nRegarding the digital asset stockpile, Sacks said it would promote “responsible stewardship” of the government’s crypto assets under the Treasury. This includes potential sales from the stockpiles. \nOn March 2, Trump said that the crypto reserve would include assets like XRP (XRP), Solana (SOL) and Cardano (ADA). The president later added Ether (ETH) and Bitcoin (BTC) to his crypto reserves list. \nRelated: 10-year Treasury yield falls to 4% as DXY softens — Is it time to buy the Bitcoin price dip?\nWhile Trump’s election may have positively impacted crypto markets, the US president’s next move has resulted in a market crash. \nOn April 5, the Trump administration hit all countries with a 10% tariff. Some countries were given higher rates, including China at 34% and Japan at 24%. The European Union was also hit with a 20% tariff.  \nFollowing Trump’s move, the overall crypto market capitalization declined by over 8%, slipping to $2.5 trillion. \nMagazine: Financial nihilism in crypto is over — It’s time to dream big again\n\n","date":1744039767896,"authors":[],"image_url":"","scraped_at":"2025-04-07T15:29:27.896649"}