{"id":"a42f5b758b5b06c995e8a4d9e7bda7dc","source":"Cointelegraph","title":"Satoshi Nakamoto turns 50 as Bitcoin becomes US reserve asset","url":"https:\/\/cointelegraph.com\/news\/satoshi-nakamoto-50-bitcoin-becomes-us-reserve-asset","content":" Nakamoto’s legacy grew from a simple experiment to a “cornerstone of economic sovereignty.” \nSatoshi Nakamoto, the pseudonymous creator of Bitcoin, marks their 50th birthday amid a year of rising institutional and geopolitical adoption of the world’s first cryptocurrency.\nThe identity of Nakamoto remains one of the biggest mysteries in crypto, with speculation ranging from cryptographers like Adam Back and Nick Szabo to broader theories involving government intelligence agencies.\nWhile Nakamoto’s identity remains anonymous, the Bitcoin (BTC) creator is believed to have turned 50 on April 5 based on details shared in the past. \nAccording to archived data from his P2P Foundation profile, Nakamoto once claimed to be a 37-year-old man living in Japan and listed his birthdate as April 5, 1975.\nSource: Web.archive.org\nNakamoto’s anonymity has played a vital role in maintaining the decentralized nature of the Bitcoin network, which has no central authority or leadership.\nThe Bitcoin wallet associated with Nakamoto, which holds over 1 million BTC, has laid dormant for more than 16 years despite BTC rising from $0 to an all-time high above $109,000 in January.\nSatoshi Nakamoto statue in Lugano, Switzerland. Source: Cointelegraph\nNakamoto’s 50th birthday comes nearly a month after US President Donald Trump signed an executive order creating a Strategic Bitcoin Reserve and a Digital Asset Stockpile, marking the first major step toward integrating Bitcoin into the US financial system.\nRelated: Bitcoin at 16: From experiment to trillion-dollar asset\n“At 50, Nakamoto’s legacy is no longer just code; it’s a cornerstone of economic sovereignty,” according to Anndy Lian, author and intergovernmental blockchain expert.\n“Bitcoin’s reserve status signals trust in its scarcity and resilience,” Lian told Cointelegraph, adding: \nHowever, lingering questions about Nakamoto remain unanswered, including whether they still hold the keys to their wallet, which is “a fortune now tied to US policy,” Lian said.\nRelated: Bitcoin’s next catalyst: End of $36T US debt ceiling suspension\nIn February, Arkham Intelligence published findings that attribute 1.096 million BTC — then valued at more than $108 billion — to Nakamoto. That would place him above Microsoft co-founder Bill Gates on the global wealth rankings, according to data shared by Coinbase director Conor Grogan.\nSatoshi’s new addresses. Source: Conor Grogan\nIf accurate, this would make Nakamoto the world’s 16th richest person.\nDespite the growing interest in Nakamoto’s identity and holdings, his early decision to remain anonymous and inactive has helped preserve Bitcoin’s decentralized ethos — a principle that continues to define the cryptocurrency to this day.\nMagazine: 10 crypto theories that missed as badly as ‘Peter Todd is Satoshi’\n","date":1743859899978,"authors":[],"image_url":"","scraped_at":"2025-04-05T13:31:39.978636"}