{"id":"a4459ea80f1468a35331fd97a6d4e1f0","source":"Cointelegraph","title":"China’s tariff response may mean more capital flight to crypto: Hayes","url":"https:\/\/cointelegraph.com\/news\/china-tariff-response-may-mean-more-capital-flight-to-crypto-hayes","content":" The People’s Bank of China could provide the catalyst to resume the Bitcoin bull market, according to BitMEX founder Arthur Hayes. \nChina’s response to America’s sweeping trade tariffs could result in capital flight to Bitcoin and crypto, according to BitMEX founder Arthur Hayes.\n“If not the Fed [Federal Reserve], then the PBOC [People’s Bank of China] will give us the Yahtzee ingredients,” said Hayes on X on April 8 in reference to the catalyst needed to resume the crypto market bull run.\nHayes said that if the Chinese central bank devalued its currency, the yuan, the “narrative [is] that Chinese capital flight will flow into Bitcoin,” adding that “it worked in 2013, 2015, and can work in 2025.” \nBybit co-founder and CEO Ben Zhou said that China will try to lower the yuan to counter the tariff, adding that historically, whenever the yuan drops, “a lot of Chinese capital flows into BTC,” which is bullish for Bitcoin (BTC).\nThe yuan has weakened against the greenback since 2022. Source. Google Finance\nChina devalued the yuan by nearly 2% against the US dollar, which saw the largest single-day drop in decades in August 2015. Bitcoin did see some increased interest during this period, though the direct causative relationship is debated.\nWhen the yuan fell below the symbolic 7:1 ratio against the USD in August 2019, Bitcoin also saw price increases in the same timeframe. Some analysts suggested that Chinese investors were using Bitcoin as a hedge as the asset jumped 20% in the first week of that month. \nIn 2019, crypto asset manager Grayscale noted the depreciation in the Chinese yuan at attributed it as a factor that spurred Bitcoin markets at the time. \nWealthy Chinese citizens may have used crypto in the past to preserve their wealth, move it beyond government reach, and avoid capital controls and restrictions within the country, according to analysts. \nIt is also believed that currency devaluations also damage trust in central banks and government financial management, pushing people toward decentralized alternatives like Bitcoin.\nRelated: $2T fake tariff news pump shows ‘market is ready to ape’\nOn April 7, the US president vowed to ratchet up additional tariffs against China, which responded by stating it “will fight to the end.”\n“If the US implements escalated tariff measures, China will resolutely take countermeasures to defend its own interests,” the Chinese Commerce Ministry said in a statement.\nMagazine: Financial nihilism in crypto is over — It’s time to dream big again\n","date":1744105237962,"authors":[],"image_url":"","scraped_at":"2025-04-08T09:40:37.962806"}