{"id":"a459072d362210bea4ac07f999d7f937","source":"Cointelegraph","title":"Bitcoin risks weekly close below $82K on US BTC reserve disappointment","url":"https:\/\/cointelegraph.com\/news\/bitcoin-risks-close-below-82k-btc-reserve-disappointment","content":" Bitcoin risks triggering $1.13 billion worth of cumulative leveraged long liquidations if it falls below the $82,000 price support. \nBitcoin could face increased downside volatility if it closes the week below the key $82,000 support level as investor sentiment remains subdued following short-term disappointment in the US Strategic Bitcoin Reserve.\nPresident Donald Trump’s executive order, signed on March 7, outlined a plan to create a Bitcoin reserve using cryptocurrency forfeited in government criminal cases rather than actively acquiring Bitcoin (BTC) through market purchases.\nThe lack of direct federal Bitcoin investment has “led to a near-term negative market reaction and a decline in Bitcoin’s price,” according to Bitfinex analysts.\nBitcoin needs to close the week above the key $82,000 support to avoid a further decline due to this short-term investor disappointment, the analysts told Cointelegraph, adding:\n“It demonstrates the sensitivity of cryptocurrency markets to government actions and policies,” the analysts added.\nBTC\/USD, 1-month chart. Source: Cointelegraph\nMeanwhile, Bitcoin has lacked significant price momentum, trading under the $90,000 psychological mark since March 7, when Trump hosted the first White House Crypto Summit.\nClosing the week above the key $82,000 support may signal a shift in Bitcoin sentiment as investors digest the nuances of Trump’s Bitcoin reserve proposition, which may still see the inclusion of “budget-neutral strategies” to buy more Bitcoin.\nRelated: Trump turned crypto from ‘oppressed industry’ to ‘centerpiece’ of US strategy\nBeyond crypto-related legislation announcements, Bitcoin price continues to be pressured by macroeconomic developments and global trade concerns, according to Iliya Kalchev, dispatch analyst at digital asset investment platform Nexo.\nBitcoin’s “short-term movements will be heavily influenced by macroeconomic factors,” the analyst told Cointelegraph:\nRelated: Rising Bitcoin activity hints at market bottom, potential reversal\nStill, a weekly close below $82,000 may introduce significant volatility for crypto markets.\nBitcoin Exchange Liquidation Map. Source: CoinGlass \nA potential Bitcoin correction below this level would trigger over $1.13 billion worth of cumulative leveraged long liquidations across all exchanges, CoinGlass data shows.\nOn the bright side, Bitcoin may be nearing its local bottom based on a key technical indicator, the relative strength index (RSI), which measures whether an asset is oversold or overbought.\nBTC\/USD, 1-day chart, RSI. Source: Rekt Capital\nBitcoin’s RSI stood at 28 on the daily chart, signaling that the asset is oversold. Each time Bitcoin’s RSI reached 28 during this current cycle, Bitcoin price would “either bottom or be between -2% to -8% away from a bottom,” popular crypto analyst Rekt Capital wrote in a March 8 X post.\nMagazine: Bitcoin vs. the quantum computer threat: Timeline and solutions (2025–2035)\n","date":1741531232558,"authors":[],"image_url":"","scraped_at":"2025-03-09T14:40:32.558682"}