{"id":"a8b2acc36ea6cebee0ecec4d70d9459c","source":"Cointelegraph","title":"Bitcoin holds firm as stocks lose $5T in record Trump tariff sell-off","url":"https:\/\/cointelegraph.com\/news\/bitcoin-outperforms-stock-market-during-trump-tariff-selloff","content":" Bitcoin’s resilience to the record $5 trillion sell-off signals an “evolution in Bitcoin’s market positioning” that may fortify Bitcoin’s status as a hedge against financial instability. \nBitcoin is gaining renewed attention as a hedge against financial instability after holding relatively steady during a record-breaking stock market downturn that saw $5 trillion wiped from the S&P 500.\nThe S&P 500 posted a $5 trillion loss in market capitalization over two days, its largest drop on record, surpassing the $3.3 trillion decline in March 2020 during the initial wave of the COVID-19 pandemic, according to an April 5 report by Reuters.\nThe record sell-off occurred after US President Donald Trump announced his reciprocal import tariffs on April 2. The measures aim to shrink the country’s estimated trade deficit of $1.2 trillion in goods and boost domestic manufacturing.\nS&P 500 record $5.4 trillion loss. Source: Zerohedge\nBitcoin’s (BTC) dip after the tariff announcement was significantly smaller than traditional markets, proving Bitcoin’s growing maturity as a global asset, according to Marcin Kazmierczak, co-founder and chief operating officer of RedStone blockchain oracle firm.\n“What we’re potentially witnessing is an evolution in Bitcoin’s market positioning,” the co-founder told Cointelegraph, adding:\n“Bitcoin’s fixed supply architecture inherently contrasts with fiat currencies that may face inflationary pressure under tariff-driven economic changes,” he added.\nRelated: 70% chance of crypto bottoming before June amid trade fears: Nansen\nWhile stocks plunged, Bitcoin dipped just 3.7% over the same two-day period, trading at around $83,600 as of April 5, according to TradingView data.\nBTC\/USD, 1-hour chart. Source: Cointelegraph\/TradingView\nDespite the $5 trillion sell-off in traditional markets, “BTC shows its worth, staying above its $82,000 key support level — a sign that structural demand remains intact even amid forced selling and elevated volatility,” Nexo dispatch analyst Iliya Kalchev told Cointelegraph.\nRelated: Michael Saylor’s Strategy buys Bitcoin dip with $1.9B purchase\nDespite Bitcoin’s decoupling from traditional stocks, its initial plunge in price signals that some investors still see Bitcoin as a risk asset, according to James Wo, the founder and CEO of venture capital firm DFG.\n“With Bitcoin ETFs enabling greater institutional exposure, it is now even more influenced by macroeconomic trends,” Wo told Cointelegraph, adding:\nDespite the current lack of momentum, analysts are confident in Bitcoin’s upside potential for the rest of 2025.\nBTC projected to reach $132,000 based on M2 money supply growth. Source: Jamie Coutts\nThe growing money supply could push Bitcoin’s price above $132,000 before the end of 2025, according to estimates from Jamie Coutts, chief crypto analyst at Real Vision.\nMagazine: Bitcoin ATH sooner than expected? XRP may drop 40%, and more: Hodler’s Digest, March 23 – 29\n","date":1743859896438,"authors":[],"image_url":"","scraped_at":"2025-04-05T13:31:36.438627"}