{"id":"a980f554043ac200f410cdfa85aafc42","source":"Cointelegraph","title":"Bitcoin miner CleanSpark to join S&P SmallCap 600 Index","url":"https:\/\/cointelegraph.com\/news\/cleanspark-join-sp-small-cap-600-index","content":" The Bitcoin mining company has seen its profitability surge over the past year thanks to efficiency gains and rising BTC values. \nBitcoin miner CleanSpark will join an important benchmark for US small-cap stocks, underscoring the company’s recent string of profitability despite industry volatility following the April 2024 halving. \nBeginning March 24, CleanSpark’s stock will be included in the S&P SmallCap 600 Index. As the name implies, the index measures the performance of small US companies that meet specific liquidity and stability criteria. \nAs of March 2025, the index’s constituents must have a market capitalization of between $1.1 billion and $7.4 billion, maintain a public float of at least 10% of shares outstanding, and have positive trailing earnings for four consecutive quarters. \nCleanSpark CEO Zach Bradford said the company’s inclusion in the small-cap index demonstrates “the value of being a pure play, vertically integrated Bitcoin mining company,” which makes “exposure to our model more broadly available.”\nSource: CleanSpark\nCleanSpark’s profits surged to $241.7 million, or $0.85 per share, in the final quarter of 2024, up from just $25.9 million a year earlier. Company-wide revenues jumped 120% on a year-over-year basis to $162.3 million.\nIn February, the company further bolstered its Bitcoin (BTC) stockpile by 6% and now holds 11,177 BTC on its books. Only four other publicly traded companies own more Bitcoin.\nRelated: Monthly Bitcoin production drops as miners fight rising hashrate\nBitcoin miners have seen their revenues decline since the April 2024 halving event, forcing several industry players to diversify their business models. Several are pivoting toward artificial intelligence data centers, which can generate higher revenue than traditional mining. \nIn September, Hive Digital executives Frank Holmes and Aydin Kilic told Cointelegraph that repurposing Nvidia GPUs for AI tasks could generate up to $2.50 per hour in revenues, up from just 0.$12 per hour for crypto mining.\nFor this reason, “institutions are much more interested in us with our AI than Bitcoin,” Holmes said.\nBitcoin miners are increasingly turning toward AI applications to boost revenues. Source: VanEck\nOther mining companies are turning to mergers and acquisitions to reduce mining costs and increase hashrate, according to an August report by JPMorgan. The Wall Street bank singled out companies like Riot Platforms and CleanSaprk for increasing their M&A activity in the post-halving environment. \nMeanwhile, “Capital-constrained miners like IREN and [Cipher] focused on securing greenfield opportunities, which require less immediate capital,” JPMorgan said.\nMagazine: How Chinese traders and miners get around China’s crypto ban\n","date":1741691722777,"authors":[],"image_url":"","scraped_at":"2025-03-11T11:15:22.777893"}