{"id":"add1f78252b245911a920ab8f616acf0","source":"Cointelegraph","title":"Bitcoin crash triggered by erosion of ETF cash and carry trade — Analyst","url":"https:\/\/cointelegraph.com\/news\/bitcoin-crash-triggered-erosion-etf-cash-carry-trade-analyst","content":" The arrival of institutional investors has been both a blessing and a curse for long-term Bitcoin holders. \nSince reaching all-time highs on Jan. 20, Bitcoin’s price has been suppressed by hedge funds exploiting a low-risk yield trade involving spot exchange-traded funds (ETFs) and CME futures, signaling once again that institutional adoption of crypto assets isn’t a one-way street.\nThis is the general takeaway of analyst Kyle Chassé, who dissected the latest Bitcoin (BTC) price crash in a thread on the X social media platform. \n“For months, hedge funds were exploiting a low-risk yield trade using BTC spot ETFs & CME futures,” said Chassé. Now, this cash and carry trade is “imploding,” he said.\nSource: Kyle Chassé\nThe cash and carry trade involved buying spot Bitcoin ETFs and shorting Bitcoin futures on CME, which allowed traders to earn up to 5.68% in annualized returns by Chassé’s calculation. \nThe success of this trade depended mainly on Bitcoin futures trading at a premium to the cryptocurrency’s spot price. However, “with recent market weakness, that premium has collapsed,” said Chassé.\nWith the trade no longer profitable, hedge funds are exiting the market, which is evidenced by the record outflows from US spot Bitcoin ETFs this week.\n“The same trade that kept Bitcoin stable on the way up is accelerating the crash now,” he said. This is happening because “hedge funds don’t care about Bitcoin. They weren’t betting on BTC mooning. They were farming low-risk yield.”\nRelated: Bitcoin futures and spot ETF traders capitulate as BTC looks for a bottom\nBitcoin’s sell-off accelerated on Feb. 27, as the cryptocurrency retraced all the way back to the sub-$79,000 region for the first time in more than three months.\nHowever, a closer look at onchain data reveals that the losses are mainly concentrated among Bitcoin tourists, or new traders who only entered the market recently. \nData from Glassnode shows that 74% of the realized losses came from holders who bought in the last month. \nSource: Carl B Menger\nNevertheless, unrealized losses from the recent sell-off exceeded crypto exchange FTX’s capitulation event, according to analyst Milkybull Crypto. A drop of this magnitude is a strong sign of a bottom formation in Bitcoin’s price. \nMagazine: 3AC-related OX.FUN denies insolvency rumors, Bybit goes to war: Asia Express\n","date":1740785877120,"authors":[],"image_url":"","scraped_at":"2025-02-28T23:37:57.120348"}