{"id":"b4f1c4a87f5a85ff7314d2cece130b9c","source":"Cointelegraph","title":"Malta regulator fines OKX crypto exchange $1.2M for past AML breaches","url":"https:\/\/cointelegraph.com\/news\/malta-fines-okx-crypto-exchange-1-2-million-aml-breaches","content":" MiCA-licensed OKX has significantly improved compliance in the past 18 months, but the Maltese regulator said it could not ignore its past failures. \nUpdate (April 4, 1:45 pm UTC: This article has been updated to add a comment from an OKX spokesperson.\nCryptocurrency exchange OKX is under regulatory scrutiny in Europe after Maltese authorities issued a fine for violations of Anti-Money Laundering (AML) laws in the past.\nMalta’s Financial Intelligence Analysis Unit (FIAU) fined Okcoin Europe — OKX’s Europe-based arm — 1.1 million euros ($1.2 million) after detecting multiple AML failures on the platform in 2023, the authority announced on April 3.\nWhile admitting that OKX has significantly improved its AML policies in the past 18 months, the authority “could not ignore” its compliance failures from 2023, “some of which were deemed to be serious and systematic,” the FIAU said.\nOKX was among the first crypto exchanges to receive a license under Europe’s new Markets in Crypto-Assets (MiCA) regulation via its Malta hub in January 2025.\nThe FIAU stated that at the time of the compliance examination in 2023, OKX compiled a business risk assessment (BRA) in an attempt to identify threats and vulnerabilities.\nThe regulators found multiple deficiencies within the BRA’s methodology, making OKX unable to properly access the money laundering risks it was exposed to and to take necessary measures to manage them, it said.\nSome of those risks included potential threats from the use of cryptocurrency mixers or tumblers, privacy coins, stablecoins and the usage of tokens on decentralized exchanges.\nAn excerpt from FIAU’s penalty statement to Okcoin Europe. Source: FIAU\nThe FIAU statement also mentioned money laundering risks associated with Okcoin Europe’s exposure to other jurisdictions despite its pledge to only service European customers. It stated:\nA spokesperson for OKX did not respond to Cointelegraph’s request to comment on whether the exchange admitted to such wrongdoing in the past.\n“With this chapter behind us, OKX remains focused on the future — continuing to build a secure, transparent, and compliant platform for our users worldwide,” the representative said.\nThe news on the $1.2 million penalty in Malta came soon after Bloomberg in March reported that European Union regulators were probing OKX over its potential role in facilitating the laundering of $100 million in funds from the Bybit hack.\nBybit CEO Ben Zhou previously claimed that OKX’s Web3 proxy allowed hackers to launder roughly $100 million, or 40,233 Ether (ETH), from the $1.5 billion hack, which occurred in February 2025.\nRelated: Binance ends Tether USDT trading in Europe to comply with MiCA rules\nIn response to Zhou’s allegations, OKX denied claims that there were any ongoing investigations by the EU authorities, adding that “Bybit’s statements are spreading misinformation.”\nSource: OKX\nThe latest news from Malta’s FIAU also followed recent reports suggesting that OKX hired former New York Governor Andrew Cuomo to advise it over the federal criminal investigation leading to its plea and a $505 million penalty payment in the US.\nOKX’s new penalty in Malta sets a precedent in the context of regulators dealing with past compliance violations by MiCA-licensed companies, showing that the license does not spare the firms from responsibility for past breaches.\nMagazine: Stablecoin for cyber-scammers launches, Sony L2 drama: Asia Express\n\n","date":1743782404031,"authors":[],"image_url":"","scraped_at":"2025-04-04T16:00:04.031976"}