{"id":"b58552c6e28ae6cc89ff69b5b4c784ca","source":"Cointelegraph","title":"Bitcoin slides another 3% — Is BTC price headed for $69K next?","url":"https:\/\/cointelegraph.com\/news\/bitcoin-slides-3-btc-price-69k-next","content":" Bitcoin bears are stopping at nothing to seal some last-minute BTC price downside into the weekly close — but how much? \nBitcoin (BTC) still risks a crash to $75,000 as BTC price weakness accelerates into the weekly close.\nHow low can BTC price action go before finding a bottom? Popular market participants weigh in as data from Cointelegraph Markets Pro and TradingView shows BTC\/USD down over 3% on March 9.\nExchange order books are forming an area of intense interest among Bitcoin traders as the weekly candle close nears.\nLiquidation levels on either side of the spot price look ripe for the taking, with longs already paying as BTC\/USD sags to $83,000.\n“Liquidation map says: Whales hunting stops!” popular trader TheKingfisher wrote in a warning to X followers on the day.\nBitcoin exchange liquidity data. Source: TheKingfisher\/X\nData from monitoring resource CoinGlass currently puts aggregate 24-hour crypto liquidations at over $300 million.\nThe thickest bid liquidity across exchanges stood at just below $83,000 at the time of writing, with the spot price dangerously close to breaking lower.\nBTC liquidation heatmap (screenshot). Source: CoinGlass\nCould February’s multimonth lows of $78,000 be just the start?\nA bearish BTC price take suggests that the market is not done retesting levels not seen since November last year.\nFor popular trader Mikybull Crypto, there is a clear chance that Bitcoin will retest its 50-week simple moving average (SMA).\n“$BTC likely heading for the MA support for a potential local bottom,” he predicted.\nBTC\/USD 1-week chart with 50SMA. Source: Mikybull Crypto\/X\nBTC\/USD last interacted with the 50-week SMA in September but has avoided a weekly candle close below it since March 2023.\nThe 200-day SMA, meanwhile, is also back on the radar as price challenges it as support for the first time since October.\nBTC\/USD 1-week chart with 50-week, 200-day SMA. Source: Cointelegraph\/TradingView\nAs Cointelegraph reported last week, a historically accurate BTC price mechanism suggests that the real floor now lies at around $69,000.\nRelated: Bitcoin gets March 25 'blast-off date' as US dollar hits 4-month low\nThis would take BTC\/USD back to its old 2021 all-time high and mark a 37% correction versus its current one.\nThe Lowest Price Forward tool gives 95% certainty that Bitcoin will not go any lower. Its track record is impressive, having correctly stated that BTC\/USD would never revisit $10,000 after September 2020.\nBitcoin Lowest Price Forward chart. Source: Timothy Peterson\/X\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\n","date":1741544063784,"authors":[],"image_url":"","scraped_at":"2025-03-09T18:14:23.784360"}