{"id":"b8941102d9c42e3fd988e85fd81e600d","source":"Cointelegraph","title":"Price predictions 4\/18: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, LEO, LINK, AVAX","url":"https:\/\/cointelegraph.com\/news\/price-predictions-4-18-btc-eth-xrp-bnb-sol-doge-ada-leo-link-avax","content":" Bitcoin trades in a tightening range, signalling that range expansion is likely to occur in the near future. \nBitcoin (BTC) has been trading in a tight range for a few days, but a minor positive is that the bulls have kept the price above $83,000. Usually, a low volatility period is followed by a range expansion, but it is difficult to predict the direction of the breakout with certainty.\nCryptocurrency analysts remain bullish on Bitcoin’s prospects because gold’s rally in 2017 and 2020 was followed by a sharp rise in Bitcoin's price. Theya head of growth Joe Consorti said in a post on X that Bitcoin follows gold with a lag of roughly 100 to 150 days. \nIf Bitcoin moves as per Consorti’s expectations, a new all-time high could be hit between Q3 and Q4 of 2025. On similar lines, trading and analytics account Cryptollica projected a medium-term target of $155,000 for Bitcoin.\nAlong with Bitcoin, analysts are also bullish on altcoins. Swiss bank Sygnum said in its Q2 2025 investment outlook that improved regulations for crypto use cases have prepared the ground for a strong altcoins rally in the second quarter, as “none of the positive developments have been priced in.”\nCould Bitcoin and the altcoins break above their respective overhead resistance levels and start a recovery? Let’s analyze the charts of the top 10 cryptocurrencies to find out.\nBitcoin has been trading between the 20-day exponential moving average ($83,463) and the 200-day simple moving average ($87,857), indicating a tough battle between the bulls and the bears.\nIf the 20-day EMA cracks, the selling could pick up, and the BTC\/USDT pair may slide to $78,500 and then to $73,777. Buyers are expected to defend the $73,777 level with all their might because a break below it may signal the start of a downtrend.\nOn the contrary, a break and close above the 200-day SMA indicates that the corrective phase may be over. The pair could climb to $95,000 and eventually to the psychologically critical level of $100,000.\nEther (ETH) has been trading between the $1,368 support and the $1,754 resistance, indicating indecision between the bulls and the bears.\nThe downsloping moving averages and the RSI in the negative territory suggest a slight edge to the sellers. If the price slips below $1,471, the ETH\/USDT pair could descend to $1,368. Buyers are expected to vigorously defend the $1,368 support because a break below it may sink the pair to $1,150.\nOn the upside, the bulls are likely to face stiff resistance in the zone between the 20-day EMA ($1,676) and $1,754. A break and close above the resistance zone could propel the pair to the breakdown level of $2,111.\nThe bears have failed to sink XRP (XRP) below the $2 support, suggesting a lack of selling pressure at lower levels.\nThe bulls will try to start a recovery, which could reach the 50-day SMA ($2.23). This is an essential short-term level to keep an eye on because a break above it opens the doors for a rally to the resistance line. Buyers will have to push the price above the resistance line to signal a short-term trend change.\nAlternatively, a break below the $2 support tilts the advantage in favor of the bears. The XRP\/USDT pair could then plunge to the $1.72 to $1.61 support zone.\nBNB (BNB) has been trading just below the downtrend line, indicating that the bulls have held on to their positions as they anticipate a breakout.\nIf buyers propel the price above the downtrend line, the BNB\/USDT pair could pick up momentum and rally to $644. Sellers will try to defend the $644 resistance, but the bulls are expected to buy the dips to the 20-day EMA ($588). If that happens, the likelihood of a rally to $680 increases.\nThis optimistic view will be invalidated in the near term if the price turns down from the downtrend line and breaks below $566. That could keep the pair stuck inside the triangle for some more time.\nSolana (SOL) rebounded off the 20-day EMA ($126) on April 16 and rose above the 50-day SMA ($130), indicating buying on dips.\nThe SOL\/USDT pair could rise to the overhead resistance at $153, where the bears are expected to mount a stiff resistance. If buyers pierce the $153 level, the pair could surge toward $180.\nBuyers are expected to guard the zone between the 20-day EMA and $120. If the zone gives way, it suggests that the bears are active at higher levels. The pair could then descend to the $110 support.\nDogecoin (DOGE) has been trading between the 20-day EMA ($0.16) and the crucial support at $0.14 for the past few days.\nThe flattening 20-day EMA and the positive divergence on the RSI suggest reduced selling pressure. Buyers will have to drive the price above the 50-day SMA ($0.17) to gain the upper hand. The DOGE\/USDT pair could climb to $0.20, an essential level to watch out for as a break above it completes a double bottom pattern.\nContrarily, a break and close below the $0.14 support signals the start of the next leg of the downtrend. The pair could then plummet to $0.10.\nBuyers have kept Cardano (ADA) above the $0.59 support but are struggling to push the price above the 20-day EMA ($0.63).\nIf the price turns down and breaks below $0.59, the ADA\/USDT pair could slide toward the solid support at $0.50. This is an important level for the bulls to defend because a break below it signals the resumption of the downtrend. The next support on the downside is at $0.40.\nBuyers will be back in the driver’s seat on a break and close above the 50-day SMA ($0.70). The pair could then rally to $0.83.\nRelated: Bitcoin price volatility 'imminent' as speculators move 170K BTC — CryptoQuant\nUNUS SED LEO’s (LEO) failure to rise above the uptrend line may have tempted short-term buyers to book profits.\nThe 20-day EMA ($9.34) has started to turn down gradually, and the RSI is in the negative zone, signaling a slight edge to the bears. If the price tumbles below the immediate support at $8.95, the LEO\/USD pair could retest the vital level at $8.79. A break below $8.79 could sink the pair to $8.30.\nThis negative view will be invalidated in the near term if the price rises above the 50-day SMA ($9.56). The pair could then retest the stiff overhead resistance at $9.90. \nChainlink (LINK) has been trading below the 20-day EMA ($12.77), but the bears have failed to pull the price below $11.68, signaling a lack of sellers at lower levels.\nThe bulls will try to push the price above the moving averages. If they manage to do that, the LINK\/USDT pair could rally to $16. Sellers will try to halt the rally at $16, but the pair could reach the resistance line if the bulls prevail.\nIf sellers want to retain the advantage, they will have to sink the price below the $11.68 support. The pair could then decline to the support line of the descending channel, which is likely to attract buyers.\nAvalanche (AVAX) has been trading near the moving averages, indicating a balance between supply and demand.\nThe flattish 20-day EMA ($18.97) and the RSI near the midpoint do not give a clear advantage either to the bulls or the bears. A break above the downtrend line could open the doors for a rally to the overhead resistance at $23.50. Buyers will have to overcome this barrier to start a new up move.\nOn the downside, a break and close below $17.50 may sink the AVAX\/USDT pair to $15.27. This is an essential level for the bulls to defend, as a break below $15.27 may signal the resumption of the downtrend.\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1745068612380,"authors":[],"image_url":"","scraped_at":"2025-04-19T13:16:52.380668"}