{"id":"c1032fb9984030e39c27a08ff0ead532","source":"Cointelegraph","title":"Crypto ETPs see 4th straight week of outflows, totaling $876M — CoinShares","url":"https:\/\/cointelegraph.com\/news\/crypto-etps-4th-consecutive-outflows-at-876m-coin-shares","content":" With cumulative outflows reaching $4.75 billion over the past four weeks, the year-to-date inflows have dropped to $2.6 billion, according to CoinShares. \nCryptocurrency exchange-traded products (ETPs) recorded a fourth straight week of outflows, with $876 million in losses during the past trading week.\nAfter posting record weekly outflows of $2.9 billion last week, crypto ETPs continued their downward trend, bringing the four-week total outflows to $4.75 billion, CoinShares reported on March 10.\nWhile the pace of outflows slowed, investor sentiment remained bearish, according to James Butterfill, head of research at CoinShares.\nThe analyst also suggested that the market has shown signs of capitulation.\nBitcoin (BTC) ETPs were the primary driver of outflows, accounting for $756 million, or 85% of last week’s total. Short-Bitcoin ETPs also saw outflows of $19.8 million, the most since December 2024. \nWith cumulative outflows reaching $4.75 billion over the past four weeks, the year-to-date inflows dropped to $2.6 billion.\nWeekly crypto ETP flows since late 2024. Source: CoinShares\nTotal assets under management (AUM) declined by $39 billion to $142 billion, the lowest point since mid-November 2024, driven by both negative price movements and sustained outflows, Butterfill noted.\nThis bearish sentiment was also observed among a wide range of altcoins last week, with Ether (ETH) ETPs seeing $89 million of outflows.\nTron (TRX) and Aave (AAVE) were also among the most notable ETP losers, seeing $32 million and $2.4 million in outflows, respectively, according to the report.\nFlows by asset (in millions of US dollars). Source: CoinShares\nConversely, Solana (SOL), XRP (XRP) and Sui (SUI) continued to see inflows totaling $16.4 million, $5.6 million and $2.7 million, respectively, Butterfill wrote.\nAmong crypto ETP issuers, Fidelity Investments saw the largest outflows last week at $201 million, bringing its YTD outflows to $159 million.\nBlackRock’s iShares exchange-traded funds (ETF) were the second largest loser, with weekly outflows amounting to $193 million.\nRelated: US Bitcoin reserve prompts $370 million in ETF outflows: Farside\nDespite seeing significant selling in the past few weeks, BlackRock is still the biggest crypto holder among other issuers, with $52.8 billion in AuM and $3 billion in YTD outflows.\nFlows by issuer (in millions of US dollars). Source: CoinShares\nOther major losses in the United States were seen by ARK Invest and 21Shares, which recorded $164 million in outflows, with YTD flows still standing positive at $110 million.\nProShares ETFs were again among the few US crypto ETFs that did not see outflows, recording $15 million of inflows.\nMagazine: Bitcoin’s odds of June highs, SOL’s $485M outflows, and more: Hodler’s Digest, March 2 – 8\n","date":1741616540707,"authors":[],"image_url":"","scraped_at":"2025-03-10T14:22:20.707611"}