{"id":"c43f72eb84509cddc953e82486627eca","source":"Cointelegraph","title":"Here’s what happened in crypto today","url":"https:\/\/cointelegraph.com\/news\/what-happened-in-crypto-today","content":" Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation. \nToday in crypto, the Chicago Mercantile Exchange (CME) Group announced the launch of Solana futures contracts in March. Meanwhile, global trade concerns continue pressuring investor sentiment, risking a potential Bitcoin correction below the key $75,000 support level. In addition, the US Securities and Exchange Commission has released a statement saying it does not view memecoins as securities.\nThe Chicago Mercantile Exchange (CME) Group, a globally recognized derivatives exchange, announced it will launch Solana (SOL) futures contracts on March 17, pending a review by United States financial regulators.\nAccording to the Feb. 28 announcement, market participants will have access to micro contracts of 25 SOL or standard contract sizes of 500 SOL, and all contracts will be cash-settled. CME Group already provides futures and options contracts for Bitcoin (BTC) and Ether (ETH) to investors looking to hedge against the highly volatile nature of these digital assets.\nThe addition of Solana futures contracts gives traditional finance investors additional exposure to the crypto markets and provides the crypto markets with fresh capital injections that should support prices.\nCME open interest on derivatives contracts quarter-by-quarter 2024. Source: CME Group\nBitcoin risks more downside if it loses a “key” $75,000 support amid growing concerns over a potential trade war between the United States and China.\nBitcoin’s (BTC) price has fallen more than 6.5% during the past 24 hours to sink below a low of $78,197, which was last seen on Nov. 10, 2024, Cointelegraph Markets Pro data shows.\nAnalysts attribute the current decline to macroeconomic concerns related to a potential trade war between the US and China caused by US President Donald Trump’s decision to impose import tariffs.\nBTC\/USD, 1-year chart. Source: Cointelegraph\nThese macroeconomic concerns were the main reason for Bitcoin losing the $80,000 support, according to Ryan Lee, chief analyst at Bitget Research.\nThe analyst told Cointelegraph:\nStill, some analysts are concerned that Bitcoin’s correction may see the world’s first cryptocurrency revisit $70,000.\nBased on its correlation with the global liquidity index, Bitcoin’s right-hand side (RHS), which marks the lowest bid price someone is willing to sell the currency for, may fall below $70,000 around the end of February, after it peaked near $110,000 in January.\nThe US Securities and Exchange Commission says it does not view memecoins as securities but warned any fraudulent tokens could still be subject to enforcement actions by other regulators.\nThe agency’s Division of Corporation Finance said in a Feb. 27 statement that, in its view, memecoins “do not involve the offer and sale of securities under the federal securities laws” and “are akin to collectibles.”\nSource: David Sacks\n“As such, persons who participate in the offer and sale of meme coins do not need to register their transactions with the Commission,” the SEC said.\nIt added that memecoin buyers and holders wouldn’t be protected by US securities laws but said the fraudulent offer and sale of memecoins “may be subject to enforcement action or prosecution by other federal or state agencies.”\n","date":1740780816989,"authors":[],"image_url":"","scraped_at":"2025-02-28T22:13:36.989672"}