{"id":"c7a9428f65496f696ffdbfdfc664dcf4","source":"Cointelegraph","title":"Competitors want to ‘kill Tether,’ most altcoins ‘won’t make it’ in 2025: Finance Redefined","url":"https:\/\/cointelegraph.com\/news\/competitors-kill-tether-altcoins-won-t-make-it-2025-finance-redefined","content":" Only the altcoins with potential ETF approvals and solid revenue-generation models will outperform the crypto market in 2025. \nTether’s competitors are exerting increasingly more pressure to push the world’s largest stablecoin issuer out of the crypto market, including political pressure aimed at reducing the firm’s leading market share.\nIn the wider crypto markets, analysts are suggesting that most cryptocurrencies won’t see a widespread “altcoin season” rally in 2025, and only select tokens with sustainable investor interest and revenue-generating models will be able to outperform the rest of the tokens.\nTether’s competitors are working to push the world’s largest stablecoin issuer out of the crypto market, according to the company’s CEO, Paolo Ardoino.\nTether, the issuer of the world’s largest stablecoin, USDt (USDT), has a market capitalization of more than $142 billion — over twice as large as Circle’s USD Coin’s (USDC) $56 billion, according to Cointelegraph data.\nHowever, the stablecoin issuer faces mounting pressure from competing firms and politicians, Ardoino said in a Feb. 25 X post.\n“I’ll leave it to you to define a competitor trying to use lawfare to kill an opponent, instead of focusing on better products,” Ardoino added.\nTether will continue focusing on its mission to promote global financial inclusion, particularly in underdeveloped economies, Ardoino said, noting that USDT is used by more than 400 million people and gains 35 million new wallets each quarter.\nArdoino’s comments followed Tether’s exclusion from the list of 10 firms approved to issue stablecoins under the European Union’s Markets in Crypto-Assets (MiCA) regulatory framework.\nContinue reading\nMost cryptocurrencies beyond Bitcoin and Ether may not experience a widespread “altcoin season” rally in 2025, but projects with strong fundamentals and revenue-generating models could outperform the broader market, according to Ki Young Ju, the founder and CEO of CryptoQuant.\n“Most altcoins won’t make it” during the 2025 market cycle, Ju wrote in a Feb. 25 X post.\nCryptocurrencies with potential exchange-traded fund (ETF) approvals, robust revenue-generating models and sustained investor attention may outperform the rest of the market, Ju said. Still, “The era of everything pumping is over,” he added.\nSource: Ki Young Ju\nJu’s outlook comes as 24% of the 200 largest cryptocurrencies have fallen to their lowest levels in more than a year, sparking speculation about possible market capitulation.\nTop 200 cryptocurrencies. Source: Jamie Coutts\nThe current downturn may signal an incoming market capitulation, according to Juan Pellicer, senior research analyst at crypto intelligence platform IntoTheBlock.\n“The recent market correction, with significant liquidations (especially in assets like Solana) and a drop in total crypto market cap to $3.13 trillion, points toward possible capitulation as overleveraged positions are flushed out,” Pellicer told Cointelegraph.\nContinue reading\nThe hacker behind the $1.4 billion Bybit exploit has laundered more than $335 million in digital assets, with investigators continuing to track the movement of stolen funds.\nCrypto investor sentiment was hit by the largest hack in crypto history on Feb. 21, when Bybit lost over $1.4 billion in liquid-staked Ether (STETH), Mantle Staked ETH (mETH) and other digital assets.\nOnchain data shows that the hacker has moved 45,900 Ether (ETH) — worth about $113 million — in the past 24 hours, bringing the total amount laundered to more than 135,000 ETH, valued at $335 million.\nThat left the hacker with about 363,900 ETH, worth around $900 million, according to pseudonymous blockchain analyst EmberCN.\nContinue reading\nUS lawmakers in the House of Representatives have advanced a resolution to repeal the “DeFi broker rule,” which requires brokers to report digital asset transactions to the Internal Revenue Service.\nSet to take effect in 2027, the IRS broker regulation was approved on Dec. 5 and would expand existing reporting requirements to include decentralized exchanges. It would require brokers to disclose gross proceeds from sales of cryptocurrencies, including information regarding the taxpayers involved in the transactions.\nDuring its Feb. 26 committee markup, the House Ways and Means Committee, a key group within the House that deals with financial issues, voted 26 to 16 to advance the resolution.\nSource: Ways and Means Committee\nIn a statement, Miller Whitehouse-Levine, the CEO of DeFi advocacy group the DeFi Education Fund, said the rule is an “unlawful and unconstitutional overreach” and needed to be overturned to “protect Americans’ freedom of choice in how they transact.”\nContinue reading\nEthereum-based cryptocurrency wallet MetaMask is expanding its fiat off-ramp services to support 10 additional blockchain networks. The move, in partnership with payments provider Transak, is aimed at simplifying the process of converting digital assets into traditional currency.\nMetaMask users were previously forced to swap assets into Ether (ETH) tokens before being able to convert them into fiat money, adding extra steps and transaction fees.\nHowever, as part of MetaMask’s ongoing partnership with Transak, the wallet will add support to 10 new networks: the Arbitrum mainnet, Avalanche C-Chain mainnet, Base, BNB Chain, Celo, Fantom, Moonbeam, Moonriver, Optimism and Polygon.\nThe first four tokens to receive immediate off-ramping support include ETH on Ethereum, ETH on Optimisim, BNB (BNB) and the Polygon (POL) token. Support for the additional six networks will be gradually rolled out.\n“By expanding off-ramping capabilities with Transak, MetaMask is removing barriers between crypto and traditional currency, allowing users to convert a broader range of tokens directly to cash,” said Lorenzo Santos, senior product manager at Consensys.\nContinue reading\nAccording to data from Cointelegraph Markets Pro and TradingView, most of the 100 largest cryptocurrencies by market capitalization ended the week in the red.\nThe Solana-based decentralized exchange Raydium’s (RAY) token fell over 55% as the week’s biggest loser, followed by the Lido DAO (LDO) token, down over 34% on the weekly chart.\nTotal value locked in DeFi. Source: DefiLlama\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.\n","date":1740780821889,"authors":[],"image_url":"","scraped_at":"2025-02-28T22:13:41.889354"}