{"id":"cb3de184bd241473a9c4b26b9ce101d5","source":"Cointelegraph","title":"Funding Bitcoin: Budget-neutral strategies for US to acquire BTC","url":"https:\/\/cointelegraph.com\/news\/assets-us-convert-purchase-btc-budget-neutral-way","content":" Budget-neutral strategies require that assets be purchased without using additional taxpayer dollars to fund acquisitions. \nUS President Donald Trump’s executive order establishing a strategic Bitcoin (BTC) reserve called for a budget-neutral strategy to acquire more coins, which includes adding more BTC through asset forfeitures and possibly converting other reserve assets to the cryptocurrency.\nThe US government maintains strategic reserves covering a range of assets and commodities, including gold, petroleum, natural gas, foreign currency, medicine, land, critical rare-earth minerals and even cheese.\nThe most liquid of these strategic reserve assets are petroleum, gold and foreign currency.\nAccording to the US Department of Energy, the US Strategic Petroleum Reserve has approximately 395 million barrels of crude oil as of Feb. 28, with a total holding capacity of over 713 million barrels.\nA visual illustration of the salt caverns that house the US Strategic Petroleum Reserve. Source: US Department of Energy\nAssuming a price of $67 per barrel of West Texas Crude Oil, this gives the US petroleum reserve a value of over $26.4 billion.\nData from the US Treasury shows that the department currently holds over 258.6 million troy ounces of gold, valued at over $10.9 billion as of Feb. 28.\nThe Treasury Department’s convertible foreign currency reserves, as of Jan. 31, total over $35 billion. Sygnum Bank estimates that the US Bitcoin reserve could grow BTC’s market capitalization by roughly 25%, or approximately $460 billion.\nUS Treasury convertible foreign reserves. Source: US Treasury\nRelated: Treasury Secretary Scott Bessent says US should bring BTC onshore\nIn July 2024, Wyoming Senator Cynthia Lummis introduced the Bitcoin Act to the US Senate, outlining a plan for the US government to acquire 5% of Bitcoin's total supply — 1 million BTC.\nThe bill also proposed the US government hold Bitcoin for 20 years as a hedge against inflation.\nIn November 2024, Senator Lummis suggested converting some US gold reserves to Bitcoin as a budget-neutral way to purchase the 1 million BTC, which would have cost approximately $90 billion at the time.\nBTC is the US government’s largest digital asset held by a dollar amount at roughly $17.4 billion. Source: Arkham Intelligence\nLummis had previously argued that the US Treasury should convert some of its assets to purchase BTC but did not specify which assets should be converted.\nWhite House adviser David Sacks also called Bitcoin digital gold and the recently established Bitcoin strategic reserve “a digital Fort Knox” for the supply-capped, decentralized cryptocurrency.\nSacks added that the scarce nature of BTC sets it apart from other cryptocurrencies as a unique store of value.\nMagazine: Bitcoin vs. the quantum computer threat: Timeline and solutions (2025–2035)\n","date":1741454994686,"authors":[],"image_url":"","scraped_at":"2025-03-08T17:29:54.686458"}