{"id":"d4207d6466da29a8be0d9cdc4a490201","source":"Cointelegraph","title":"Bitcoin price bounces 4% as data gives '89% chance' stocks bottom is in","url":"https:\/\/cointelegraph.com\/news\/bitcoin-price-bounces-4-data-89-chance-stocks-bottom-is-in","content":" Bitcoin joins US stock futures in a relief rally after a bruising US trading session sent BTC price action to new four-month lows and punished stocks. \nBitcoin (BTC) rebounded above $81,000 on March 11 as US stocks’ futures sought relief from a brutal sell-off.\nBTC\/USD 1-hour chart. Source: Cointelegraph\/TradingView\nData from Cointelegraph Markets Pro and TradingView showed daily BTC price gains approaching 4%.\nNew four-month lows had accompanied the previous day’s Wall Street trading session as recession fears sent risk-asset investors fleeing.\nThe S&P 500 and Nasdaq Composite Index finished the day down 2.7% and 4%, respectively. At the time of writing, Nasdaq 100 futures had recovered around 0.4% from a trip to their lowest levels since September 2024.\nCommenting, trading resource The Kobeissi Letter suggested that markets had entered an unsustainable downtrend.\n“Are we overdue for a massive short squeeze?” it queried in a thread on X, noting risk-asset sentiment in “extreme fear” territory.\nNasdaq 100 futures 1-day chart. Source: Cointelegraph\/TradingView\nKobeissi and others referenced unusually high readings from the VIX volatility index while making the case for a sustained recovery.\n“$VIX has only been higher 11% of the time, going back to 1990,” network economist Timothy Peterson, creator of several Bitcoin price forecasting tools, continued.\nVIX volatility index. Source: Timothy Peterson\/X\nBitcoin thus saw some much-needed upside on short timeframes after reaching $76,600 on Bitstamp.\nRelated: Biggest red weekly candle ever: 5 things to know in Bitcoin this week\n“$BTC just had a bullish divergence on the 4H timeframe,” trader Cas Abbe said while analyzing relative strength index (RSI) signals. \nBTC\/USD 4-hour chart with RSI data. Source: Case Abbe\/X\nPreviously, trader and analyst Rekt Capital told X followers to watch for similar RSI cues from the daily chart to confirm a more sustainable BTC price comeback.\nZooming out, other popular crypto market participants remained gloomy. Among them was the pseudonymous X trader HTL-NL, who concluded that BTC\/USD was unlikely to match all-time highs.\nBTC\/USDT 1-day chart. Source: HTL-NL\/X\n“Before anyone of you think this is specifically happening in crypto: it’s not,” another of his latest posts said alongside a chart of S&P 500 futures. \nS&P 500 futures 1-day chart. Source: HTL-NL\/X\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1741695357599,"authors":[],"image_url":"","scraped_at":"2025-03-11T12:15:57.599797"}