{"id":"d66dfaa66a50a65e2a5640b598a4e73e","source":"Cointelegraph","title":"Bitcoin reserve backlash signals unrealistic industry expectations","url":"https:\/\/cointelegraph.com\/news\/us-bitcoin-reserve-disappoints-investors-trump-crypto-summit","content":" “Not that long ago, even the idea of BTC Reserve held and supported by a federal government was a revolutionary idea,” a blockchain regulatory expert told Cointelegraph. \nThe widespread disappointment surrounding the US Strategic Bitcoin Reserve — hailed as a historic step for Bitcoin adoption — suggests unrealistic investor expectations, according to regulatory experts.\nPresident Donald Trump signed an executive order on March 7, which will utilize Bitcoin (BTC) seized in government criminal cases rather than purchasing the asset directly from the market. The announcement triggered a more than 6% drop in Bitcoin’s price, falling from $90,400 to $84,979, according to Cointelegraph Markets Pro data.\nThe reaction signals unrealistic industry expectations, according to Anastasija Plotnikova, co-founder and CEO of Fideum, a regulatory and blockchain infrastructure firm focused on institutions.\nBTC\/USD, 1-month chart. Source: Cointelegraph\n“It was very clear that the US government could utilize the existing BTC in their possession, aka seized funds,” she told Cointelegraph, adding:\nThe Bitcoin reserve is a “cautious” approach with taxpayer funds, which “make this decision well aligned with the messaging from this administration,” added the regulatory expert.\nSource: Margo Martin\nAlthough the current plan does not involve government Bitcoin purchases, the order does not rule them out in the future. The order authorizes the US Treasury and Commerce secretaries to develop “budget-neutral strategies” to buy more Bitcoin for the reserve, provided there are no additional costs to taxpayers.\nStill, the short-term investor disappointment paired with ongoing macroeconomic concerns related to import tariffs may push Bitcoin to a weekly close below $82,000, risking more downside volatility, analysts told Cointelegraph. \nRelated: US Bitcoin reserve marks ‘real step’ toward global financial integration\nTrump signed the historic Bitcoin reserve order a day ahead of hosting the first White House Crypto Summit, which also received mixed reactions from the crypto community.\nDespite its divided reception, the summit marks a pivotal moment for the White House’s engagement with the crypto industry, according to Alexander Urbelis, general counsel and chief information security officer at Ethereum Name Service.\nUrbelis told Cointelegraph:\nRelated: Trump turned crypto from ‘oppressed industry’ to ‘centerpiece’ of US strategy\n“There are high hopes for the outcome of the Crypto Summit. One of those hopes is that engagement like this with the White House will continue long after the initial meeting,” he added.\nMagazine: SCB tips $500K BTC, SEC delays Ether ETF options, and more: Hodler’s Digest, Feb. 23 – Mar. 1\n","date":1741531229029,"authors":[],"image_url":"","scraped_at":"2025-03-09T14:40:29.029747"}