{"id":"dda19cbad2c58f32a3bac58528e57dc2","source":"Cointelegraph","title":"Bitcoin price bounces 5% as analyst sees crypto slump end in March","url":"https:\/\/cointelegraph.com\/news\/bitcoin-price-bounces-analyst-crypto-slump-end-march","content":" Bitcoin price relief accompanies an on-point PCE index release, with optimism growing over macroeconomic conditions easing next month. \nBitcoin (BTC) recrossed $82,000 into the Feb. 28 Wall Street open as analysis pointed to a March BTC price comeback.\nBTC\/USD 1-hour chart. Source: Cointelegraph\/TradingView\nData from Cointelegraph Markets Pro and TradingView showed BTC\/USD bouncing more than 5% from its latest multimonth lows of $78,197 on Bitstamp.\nOngoing selling pressure only eased as the latest US macroeconomic data conformed to expectations on inflation.\nThe January print of the Personal Consumption Expenditures (PCE) index, known to be the Federal Reserve’s “preferred” inflation gauge, came in at 0.3% and 2.5% month-on-month and year-on-year, respectively.\nMarkets immediately sensed relief after several recent overshoots in inflation data. In a boost to both risk assets and crypto, US dollar strength began falling from local highs of 107.45, a level not seen in two weeks.\nUS dollar index (DXY) 1-hour chart. Source: Cointelegraph\/TradingView\n“This marks the first decline in PCE inflation since September 2024,” trading resource The Kobeissi Letter wrote in part of a reaction on X.\nKobeissi described both the PCE and core PCE results as “constructive.”\n“However, since the data was released, interest rate cut expectations are little changed,” it noted. \nFed target rate probabilities. Source: CME Group\nThe latest data from CME Group’s FedWatch Tool put the odds of a rate cut at the Fed’s March meeting at just 5.5% at the time of writing.\nCommenting on the impact that the macro climate could have on Bitcoin, meanwhile, Julien Bittel, head of macro research at Global Macro Investor, had good news for bulls.\nRelated: When will Bitcoin price bottom?\n“Everything happening in markets right now, especially in crypto, is a direct consequence of the tightening of financial conditions in Q4 last year,” he argued in part of his latest X analysis on the day. \nBTC\/USD vs. GMI Financial Conditions index % performance. Source: Julien Bittel\/X\nBittel suggested that the “scare” affecting markets would not last much longer.\n“Here’s the thing: This will all reverse next month,” he forecast. \nBitcoin at $80,000, he concluded, means tighter conditions were “fully reflected” in BTC price action.\n“Everyone’s already on the same side of the trade – sentiment is extremely bearish, and Bitcoin is sitting at an RSI of 23, the most oversold level since August 2023,” he noted.\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1740785883634,"authors":[],"image_url":"","scraped_at":"2025-02-28T23:38:03.634670"}