{"id":"e0c74406d23d81bdc1182d599c4a5b91","source":"Cointelegraph","title":"BBVA gets regulatory nod to offer Bitcoin and Ether trading in Spain","url":"https:\/\/cointelegraph.com\/news\/bbva-bitcoin-ether-trading-spain-regulatory-approval","content":" Spain’s second-largest lender will allow its clients to buy, sell and manage cryptocurrencies on its mobile banking app. \nBanco Bilbao Vizcaya Argentaria (BBVA) announced on March 10 that it had received the nod from Spain’s securities regulator, the Comisión Nacional del Mercado de Valores (CNMV), to offer Bitcoin (BTC) and Ether (ETH) trading services to its customers. \nSpain’s second-largest bank’s crypto offerings in Spain will enable users to buy, sell and manage digital assets through its mobile app. The lender said it will use its own cryptographic key custody platform to maintain full control over customer holdings without third-party involvement. \nInitially, the rollout will be limited to a select group of users before gradually expanding to all private customers across the Iberian nation in the coming months.\nRelated: Bitcoin and Ether can ‘greatly improve’ portfolio performance: BBVA\nBBVA’s foray into crypto began in Switzerland, where it launched Bitcoin custody and trading services for private banking clients in June 2021. The Swiss branch has since broadened its offerings to include Ether and the USDC (USDC) stablecoin.\nIn January 2025, BBVA’s Turkish subsidiary Garanti BBVA Kripto launched its crypto trading services to the public. With Spain now entering the fold, BBVA is broadening its crypto services in line with evolving European regulations.\nBBVA’s expansion comes as the Markets in Crypto-Assets Regulation (MiCA) reached full implementation at the end of 2024. While the framework is now in effect, crypto companies in the EU have until July 2026 to fully comply with its requirements under an 18-month transitional phase.\nThe grandfather period, or transitional phase, for crypto firms to become MiCA-compliant lasts until July 2026. Source: ESMA\nSince MiCA’s rollout, traditional finance firms have accelerated their efforts to secure MiCA licenses and integrate crypto services. Prime brokerage Hidden Road obtained its MiCA license in the Netherlands on Dec. 30, 2024. Standard Chartered followed on Jan. 9, receiving approval in Luxembourg, while Boerse Stuttgart Digital Custody became Germany’s first MiCA-licensed crypto service provider on Jan. 17.\nCrypto-native companies are also adjusting to the new regulatory landscape. In January 2025, major exchanges OKX, Crypto.com and HashKey all secured MiCA approval. Bybit, which suffered the largest hack in crypto history, was recently removed from France’s blacklist and has expressed intent to obtain a MiCA license next.\nMagazine: SEC’s U-turn on crypto leaves key questions unanswered \n","date":1741616544574,"authors":[],"image_url":"","scraped_at":"2025-03-10T14:22:24.574496"}