{"id":"e33f43bff6d73a0907a42ea081706b62","source":"Cointelegraph","title":"American Bitcoin’s ambition is to dominate mining — Hut 8 CEO","url":"https:\/\/cointelegraph.com\/news\/inside-the-trump-linked-american-bitcoin-mining-ambitions-to-dominate-the-industry-hut-8-ceo","content":" In an exclusive interview, Hut 8 CEO Asher Genoot reveals how the Trump-backed American Bitcoin venture is aiming to dominate US mining and ultimately take its vision public. \nEarlier this week, Bitcoin mining giant Hut 8 revealed a partnership that includes two members of the Trump family — Donald Jr. and Eric — and its plans to launch a new mining venture, American Bitcoin. \nIn an exclusive interview on Decentralize with Cointelegraph’s Byte-Sized Insight series, Hut 8 CEO Asher Genoot shared new details about the venture’s vision, why the timing was right and how the company plans to scale.\n“We’ve thought about splitting out our Bitcoin mining and energy infrastructure businesses for some time,” Genoot said. “Meeting Eric and Don Jr., and seeing their deep passion for Bitcoin and infrastructure, was the perfect catalyst.”\nAccording to Genoot, the goal is clear: to build one of the world’s largest and most efficient Bitcoin mining platforms, rooted in American soil and aligned with pro-Bitcoin sentiment growing under President Donald  Trump’s administration. “Eric told me, ‘I don’t want to get involved in anything that isn’t the biggest and the best,’” he said.\nThe move comes at a pivotal moment for US-based mining. With China out of the picture post-2021 crackdown, and Washington now openly exploring the idea of a strategic Bitcoin reserve, America’s place in the global mining ecosystem is under transformation.\nStill, size isn’t everything. Genoot emphasized that efficiency and cost-effectiveness are core to the strategy.\nRelated: Bitcoin miner Hut 8 argues to toss ‘short and distort’ shareholder suit\nAmerican Bitcoin’s structure allows it to mine BTC at low cost, accumulate more when the market allows, and potentially expand into other Bitcoin ecosystem services. Hut 8 currently holds over 10,000 BTC on its balance sheet, worth up to $1 billion depending on market conditions. American Bitcoin aims to surpass that.\nAnd the company isn’t just bullish on Bitcoin; it’s bullish on power consumption. Genoot pushed back on criticism that mining wastes energy: \nLooking ahead, Hut 8’s mining spinoff has big ambitions. “Our focus is scaling. Our focus is taking this company public on a US exchange,” Genoot said. “You’ll hear more from us soon.”\nListen to the full episode of Byte-Sized Insight for the complete interview on Cointelegraph’s Podcasts page, Apple Podcasts or Spotify. And don’t forget to check out Cointelegraph’s full lineup of other shows! \nGot thoughts? Join the conversation on X or email us at savannah@cointelegraph.com.\nMagazine: SEC’s U-turn on crypto leaves key questions unanswered\n\n\n\n\n","date":1743784119070,"authors":[],"image_url":"","scraped_at":"2025-04-04T16:28:39.070828"}