{"id":"ec1ae19103b2dc74b4b1844b304a22a0","source":"Cointelegraph","title":"Arthur Hayes loves tariffs as printed money pain is good for Bitcoin","url":"https:\/\/cointelegraph.com\/news\/arthur-hayes-donald-trump-tariffs-bitcoin-price-pump","content":" Arthur Hayes says that tariffs will correct “global imbalances,” which will positively impact Bitcoin's price over the medium term. \nBitMEX co-founder Arthur Hayes says US President Donald Trump's tariffs may rattle the global economy in some ways, but that same disruption could be exactly what Bitcoin needs to rally.\n“Global imbalances will be corrected, and the pain papered over with printed money, which is good for BTC,” Hayes said in an April 3 X post.\n“Some of y'all are running scurred, but I LOVE TARIFFS,” Hayes said. \nHis comments come just a day after it was announced that the Trump administration will hit all countries with a 10% tariff starting April 5, with some countries facing even larger rates, such as China facing a 34% tariff, the European Union 20%, and Japan 24%. \nHayes explained that tariffs positively impact Bitcoin's (BTC) price for several reasons. \nBitcoin is trading at $83,150 at the time of publication. Source: CoinMarketCap\nOne of them, he said, is the “weakening” of the US Dollar Index (DXY), as overseas investors continue to sell off US stocks and “bring money home.” \nApril 3 marked “the largest single-day point loss for the Nasdaq 100 in history,” according to the trading resource account The Kobeissi Letter.\n“The index lost a total of -1060 points and came just 1.5% away from triggering the first circuit breaker since March 2020,” The Kobeissi Letter said.\n\"This is good for BTC and gold over the medium term.\"\nHayes also said that the stringent tariff placed on China may weaken the yuan (CNY). “With a 65% effective tariff levied, China could respond by allowing CNY to weaken past 8.00,” Hayes said. \nA weakening yuan may force the hand of Chinese investors to look at riskier assets such as Bitcoin to preserve their wealth.\nMeanwhile, Hayes said that “we need Fed easing,” noting that the two-year Treasury yield “dumped” following the tariff announcement. \nRelated: Bitcoin sales at $109K all-time high 'significantly below' cycle tops — Glassnode\nHe explained this as a signal that markets expect the Federal Reserve to cut rates and potentially restart quantitative easing (QE) to offset the negative economic impact. \nFed rate cuts increase liquidity, also making riskier assets like crypto more attractive to investors.\nSource: Arthur Hayes\nMeanwhile, Jeff Park, head of alpha strategies at Bitwise Invest, has long argued that Trump's tariffs will ultimately benefit Bitcoin.\nHe said on Feb. 3 that in a “world of weaker dollar and weaker US rates…risk assets in the US will fly through the roof beyond your wildest imagination.”\n“Bookmark this and revisit as the financial war unravels, sending Bitcoin violently higher,” Parks said on Feb. 3.\nMagazine: XRP win leaves Ripple a 'bad actor' with no crypto legal precedent set\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1743766018056,"authors":[],"image_url":"","scraped_at":"2025-04-04T11:26:58.056159"}