{"id":"eeddd0bab51b432a2e806783399a36e8","source":"Cointelegraph","title":"Bitcoin price on verge of breaking 10-week downtrend — Is $90K BTC next?","url":"https:\/\/cointelegraph.com\/news\/bitcoin-price-on-verge-of-breaking-10-week-downtrend-is-90-k-btc-next","content":" Bitcoin’s market structure is shifting back to bulls, increasing the chance of BTC price seeking new all-time highs. \nBitcoin’s (BTC) price is off to a swift start in Q2, rallying by 5.53% to an intraday high of $87,333 on April 2. Currently, Bitcoin is emerging from a ten-week downtrend that began on Jan. 20 when the price peaked at $110,000. \nA decisive close above the trendline might lead to continued bullish momentum for Bitcoin in the coming days.\nBitcoin 1-day chart. Source: Cointelegraph\/TradingView\nThroughout March, spot traders on Binance and Coinbase held opposite stances in the market. Binance traders were aggressive BTC sellers, while Coinbase showed significant spot bids around the $80,000 price level. This dynamic contributed to the sideways price action during the majority of March. \nFast forward to April, and spot traders on major exchanges have collectively turned bullish over the past three days. \nBinance, Coinbase spot buyers data. Source: Aggr.trade\nData from aggr.trade highlights that Coinbase and Binance spot bids are driving positive action for BTC. The buying pressure is particularly high on Coinbase, with spot bids increasing as high as $7.98 million over the past few hours. \nLikewise, Dom, a crypto markets analyst, pointed out that Bitcoin’s current rally is possibly due to Binance sellers tapering off. The analyst said, \nRelated: Bitcoin breaks $86K as US tariff 'Liberation Day' risks 11% BTC price dip\nFrom a technical perspective, Bitcoin has flipped an important resistance range between $84,000 and $85,000 into support. Likewise, the cryptocurrency has attained a bullish position above the 50-day, 100-day and 200-day exponentially moving averages (EMAs). \nBitcoin 4-hour chart. Source: Cointelegraph\/TradingView\nHowever, based on the external liquidity levels between $87,700 and $88,700, which formed the previous highs, BTC prices might struggle to break this range immediately. Consolidation between the green box (as illustrated in the chart) is likely a net positive, which might fuel BTC’s $90,000 retest for the first time since March 7. \nOn the flip side, an immediate correction to the current support at $84,000 and $85,000 could possibly discourage bulls, and short sellers might take control of price action. \nBullish invalidation could be on the cards if BTC price closes below $85,000 over the next few days. \nWith markets bracing for further market volatility ahead of President Trump’s  “Liberation Day” tariffs, Bitcoin price is expected to react further during today’s White House press conference at 4 pm Eastern Time. \nRelated: Bitcoin price can hit $250K in 2025 if Fed shifts to QE: Arthur Hayes\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1743688084503,"authors":[],"image_url":"","scraped_at":"2025-04-03T13:48:04.503917"}