{"id":"ef6256240789dee6ea7231bb1d4b2ef7","source":"Cointelegraph","title":"Lyn Alden lowers Bitcoin forecast after ‘tariff kerfuffle,’ eyes liquidity","url":"https:\/\/cointelegraph.com\/news\/bitcoin-price-year-end-prediction-lowered-lyn-alden-liquidity-tariffs","content":" Macroeconomist Lyn Alden says a period similar to the 2003–2007 run-up before the global financial crisis could play in Bitcoin’s favor. \nMacroeconomist Lyn Alden expects Bitcoin to finish 2025 higher than its current price of around $85,000, though she says it would have been much higher if not for US President Donald Trump’s tariff announcement in February.\n“Before all this tariff kerfuffle, I would have had a higher price target,” Alden told Natalie Brunell on the April 17 episode of Coin Stories. “My guess is that we end up higher at the end of the year than we are now, at least,” she added.\nHowever, she said that a “massive liquidity unlock” could be the catalyst needed for Bitcoin (BTC) to reach more optimistic targets, similar to those before the tariffs were introduced.\nFor example, if the US bond market “broke” and the US Federal Reserve had to step in with measures like yield curve control or heavy quantitative easing (QE), Alden explained.\nWhile Alden said that there is a “good chance” Bitcoin reclaims the $100,000 price level before the end of the year, she emphasized that broader financial market “down days” will remain a challenge for the asset, especially since Bitcoin trades 24\/7, unlike traditional stock markets with trading hours.\n“Because it trades 24\/7, if people are worried about how things are going to open on Monday, some pools of capital can sell their Bitcoin on a Sunday and prepare,” she said. \nAlden explained that crypto's round-the-clock trading contributes to its \"volatile pricing,\" particularly when traditional financial markets are “freaking out.”\nAt the time of publication, Bitcoin is trading at $84,950, according to CoinMarketCap data.\nHowever, Alden said Bitcoin can “disconnect” from the Nasdaq 100, especially in situations that “hurt Nasdaq margins” without affecting global liquidity. As an example, she pointed to a potential repeat of the five years leading up to the 2008 global financial crisis, which she believes could be favorable for Bitcoin.\nRelated: Bitcoin whales absorb 300% of newly mined BTC supply — Is $100K next?\nShe pointed to the 2003–2007 period, where there was a weaker US dollar cycle, and while there wasn’t a mass exodus of capital, it did flow into “emerging markets,” commodities, gold, and other assets — with US stocks not “really being the place to be.”\nAlden wrote in a September research report that Bitcoin moves in the direction of global M2 83% of the time in a given 12-month period. \nThe research termed “Bitcoin a Global Liquidity Barometer” compared Bitcoin to other major asset classes such as SPX, gold and VT, and BTC topped the correlation index concerning global liquidity.\nMagazine: Uni students crypto ‘grooming’ scandal, 67K scammed by fake women: Asia Express\n","date":1745068605136,"authors":[],"image_url":"","scraped_at":"2025-04-19T13:16:45.136271"}