{"id":"f21e65fcd2f2b1cf8ba74d75c8c10d91","source":"Cointelegraph","title":"Singapore Exchange to list Bitcoin futures in H2 2025: Report","url":"https:\/\/cointelegraph.com\/news\/singapore-exchange-bitcoin-futures-second-half-2025","content":" Futures have emerged as a growing crypto trend, with major global groups, such as SGX and Japan’s Osaka Dojima, reportedly looking to introduce Bitcoin futures in 2025. \nSingapore Exchange (SGX), the largest exchange group in Singapore, reportedly plans to debut Bitcoin perpetual futures in the second half of 2025.\nSGX is working to introduce Bitcoin (BTC) perpetual futures for institutional and professional investors in an effort to “expand institutional market access,” Bloomberg reported on March 10.\nA spokesperson at SGX reportedly said that the company expects to offer a trusted alternative for trading cryptocurrency futures, with its Aa2 rating by Moody’s.\nStrictly restricting retail investors, SGX’s planned Bitcoin products are awaiting approval from the Monetary Authority of Singapore (MAS), the report stated.\nBitcoin futures fall under the category of cryptocurrency derivatives, which offer investors the ability to trade on the value derived from the price of an underlying cryptocurrency and speculate on future price movements without holding the asset.\nCrypto futures allow investors to speculate on the price by a certain date and time, while perpetual futures offer no expiration date.\nThe potential arrival of perpetual Bitcoin futures to SGX comes amid Singapore becoming a global leader in cryptocurrency and blockchain acceptance, with the MAS adopting crypto-friendly regulations and doubling the number of crypto licenses in 2024.\nAccording to Bloomberg, SGX is not the only exchange seeking the launch of Bitcoin futures trading in Singapore.\nEDX Markets, a crypto asset firm backed by Citadel Securities, reportedly announced plans to offer crypto futures in the city-state in January 2025.\nRelated: Sygnum adds off-exchange crypto custody to Deribit with Fireblocks tech\nOn March 4, Bloomberg News also reported that Japan’s Osaka Dojima Exchange — a Japanese-listed derivatives exchange — was also looking for approval to list Bitcoin futures in Japan.\nIf approved, Dojima could become one of the first traditional exchanges in Asia to handle Bitcoin futures.\nCointelegraph approached SGX and the MAS for a comment regarding the potential introduction of Bitcoin perpetual futures on the exchange but did not receive a response by the time of publication.\nMagazine: Bitcoin’s odds of June highs, SOL’s $485M outflows, and more: Hodler’s Digest, March 2 – 8\n","date":1741616526519,"authors":[],"image_url":"","scraped_at":"2025-03-10T14:22:06.519519"}