{"id":"f297218106db3a1c9cb3c2727955db48","source":"Cointelegraph","title":"Michael Saylor’s Strategy halts Bitcoin buys despite dip below $87K","url":"https:\/\/cointelegraph.com\/news\/saylor-strategy-skip-bitcoin-buy-87000-drop","content":" Strategy paused Bitcoin purchases last week as BTC fell below $87,000, disclosing a $5.91 billion unrealized loss in Q1, according to SEC filings. \nMichael Saylor’s firm Strategy, the world’s largest publicly listed corporate holder of Bitcoin, did not add to its BTC holdings last week as the cryptocurrency’s price dropped below $87,000.\nIn a filing with the US Securities and Exchange Commission on April 7, Strategy announced it made no Bitcoin (BTC) purchases during the week of March 31 to April 6.\nThe decision followed a week of heightened market volatility, with BTC surging to as high as $87,000 on April 2 after starting the week at around $82,000, according to data from CoinGecko.\nBitcoin price from March 31, 2025, to April 6, 2025. Source: CoinGecko\nBTC fell below $80,000 on April 6, a significant discount from the average BTC price of Strategy’s previous 22,000 BTC purchase announced on March 31.\nIn the period from March 31 to April 6, Strategy also did not sell any shares of class A common stock, which it tends to use for financing its Bitcoin buys, the filing stated.\nAs of April 7, Strategy held an aggregate amount of 528,185 Bitcoin bought at $35.6 billion, or at an average price of 67,458 per BTC, it added.\nAn excerpt from Strategy’s Form 8-K report. Source: SEC\n“Our unrealized loss on digital assets for the quarter ended March 31, 2025, was $5.91 billion, which we expect will result in a net loss for the quarter ended March 31, 2025, partially offset by a related income tax benefit of $1.69 billion,” the filing added.\nWhile Strategy avoided buying Bitcoin last week, its co-founder and former CEO, Saylor, continued posting about the crypto asset’s superiority on social media.\n“Bitcoin is most volatile because it is most useful,” Saylor wrote in an X post on April 3, soon after BTC tumbled from the intra-week high of $87,100 on April 2 below $82,000, following the tariffs announcement by US President Donald Trump.\nRelated: Has Michael Saylor’s Strategy built a house of cards?\nSource: Michael Saylor\n“Today’s market reaction to tariffs is a reminder: inflation is just the tip of the iceberg,” Saylor wrote in another X post.\n“Capital faces dilution from taxes, regulation, competition, obsolescence, and unforeseen events. Bitcoin offers resilience in a world full of hidden risks,” he added.\nMagazine: New ‘MemeStrategy’ Bitcoin firm by 9GAG, jailed CEO’s $3.5M bonus: Asia Express\n\n\n","date":1744039763999,"authors":[],"image_url":"","scraped_at":"2025-04-07T15:29:23.999933"}