{"id":"f7e63717003ecd0443095326d814c17a","source":"Cointelegraph","title":"Deutsche Boerse to launch Bitcoin, Ether institutional custody: Report","url":"https:\/\/cointelegraph.com\/news\/deutsche-boerse-to-launch-btc-eth-services-to-institutions-report","content":" Deutsche Boerse’s Clearstream to offer crypto custody and settlement services for institutional clients, expanding its Bitcoin and Ether offerings in 2025. \nDeutsche Boerse’s trading unit, Clearstream, is preparing to launch cryptocurrency custody and settlement services for institutional clients in 2025 amid increasing demand for regulated digital asset infrastructure.\nThe German exchange group plans to offer Bitcoin (BTC) and Ether (ETH) custody to its more than 2,500 institutional clients, with services expected to begin in April, according to a Bloomberg report on March 11.\nClearstream will provide these digital asset services through Crypto Finance AG, a Switzerland-based subsidiary in which Deutsche Boerse acquired a majority stake in 2021.\nDeutsche Boerse’s trading unit also aims to launch support for other cryptocurrencies and diversified services such as staking, lending and brokerage capabilities.\n“With this offering, we are creating a one-stop shop around custody, brokerage and settlement,” Jens Hachmeister, head of issuer services and new digital markets at Clearstream, told Bloomberg.\nThe move aligns with a growing institutional push toward regulated crypto services in Europe following the implementation of Markets in Crypto-Assets Regulation (MiCA), which went into full effect for crypto asset service providers on Dec. 30, 2024.\nThe institutional offering came nearly two months after Boerse Stuttgart Digital Custody became Germany’s first crypto asset service provider to receive a full license under MiCA, Cointelegraph reported on Jan. 17.\nBoerse Stuttgart’s license was part of the firm’s efforts to become a regulated infrastructure provider for banks, brokers and asset managers.\nRelated: EU MiCA rules pose ‘systemic’ banking risks for stablecoins — Tether CEO\nWhile MiCA is widely viewed as a positive step for global crypto regulation, some industry experts worry about potential regulatory overreach that could impact retail investors and drive crypto firms out of Europe.\nWhile the regulation is a significant step toward a more mature industry, it also seeks to identify the “weak points of control” in the crypto space, which could mean more scrutiny for retail investors and the end-users of crypto platforms, according to Dmitrij Radin, the founder of Zekret and chief technology officer of Fideum, a regulatory and blockchain infrastructure firm focused on institutions.\n“Retail users will be way more obligated to provide information, data which will be screened. They will be accounted for. Most Europeans will see taxation,” Radin told Cointelegraph.\nRelated: 20% of Gen Z, Alpha sees crypto as retirement alternative: Report\nThe regulation also raises the possibility of enforcement actions against blockchain protocols that fail to comply with MiCA standards. European governments may pursue legal cases against noncompliant platforms during the early implementation phase.\nOther blockchain regulatory experts fear that MiCA will introduce consolidation among crypto firms with limited capital, leading to a potential crypto firm exodus to the Middle East due to more lenient regulations.\nMagazine: SEC’s U-turn on crypto leaves key questions unanswered\n","date":1741691695652,"authors":[],"image_url":"","scraped_at":"2025-03-11T11:14:55.652719"}