{"id":"f7ebc0550d19a75a5453abfd5d310e0c","source":"Cointelegraph","title":"Bitcoin sentiment falls to 2023 low, but ‘risk on’ environment may emerge to spark BTC price rally","url":"https:\/\/cointelegraph.com\/news\/bitcoin-sentiment-falls-to-2023-low-but-risk-on-environment-may-emerge-to-spark-btc-price-rally","content":" A Bitcoin sentiment metric fell to bear market lows this week, but clever counter-traders may interpret this as a risk-on, go-long opportunity for BTC. \nBitcoin (BTC) sits in one of its least bullish phases since January 2023. According to Bitcoin’s “bull score index,” investor sentiment is showing its lowest reading in two years. \nBitcoin bull score index. Source: CryptoQuant\nCryptoQuant’s “Crypto Weekly Report” newsletter explained that “bull score index” readings that sit below 40 for extended periods increase the likelihood of a bear market. The bull score remained above 40 throughout 2024, only dipping below this threshold in February 2025, as identified in the chart above. \nHowever, over the past 24 hours, Bitcoin price has displayed resilience when compared against the massive losses seen in the US stock market. On April 3, Bitcoin closed the day with a green candle, while the S&P 500 was down 4.5%, a historic first.  \nThe S&P 500 and Dow Jones extended their decline on April 4, dropping 3.87% and 3.44%, respectively, while Bitcoin held steady near the breakeven point. \nRelated: Arthur Hayes loves tariffs as printed money pain is good for Bitcoin\nData from CryptoQuant indicates that Bitcoin’s Value Days Destroyed (VDD) metric currently sits around 0.72, suggesting that Bitcoin price is in a transitional phase. Since 2023, such periods have preceded either price consolidation or renewed accumulation before a bullish breakout.\nBitcoin value days destroyed. Source: CryptoQuant\nThe Bitcoin VDD metric tracks the movement of long-term held coins, and it has signaled a notable market trend since late 2024. The metric peaked at 2.27 on Dec. 12, signaling aggressive profit-taking and this dynamic matched the highs seen in 2021 and 2017. However, VDD dropped to 0.65 in April, reflecting a cooling-off period where profit-taking has subsided. \nThis opens the possibility of a “risk-on” market for Bitcoin. In financial terms, a \"risk-on\" scenario occurs when investors embrace higher-risk assets like cryptocurrencies, often driven by optimism and mean reversions in trends. \nAmid ongoing market uncertainty that has been fueled by the US-led trade war, Bitcoin could unexpectedly gain from these tense conditions. \nSpeaking on Bitcoin and the crypto market’s potential as a hedge against traditional market volatility, crypto trader Jackis said, \nSimilarly, the Crypto Fear & Greed Index also exhibited a “fear” category with a score of 28 on April 4. The index registered an \"extreme fear\" score of 25 on April 3, suggesting that the current price may present a compelling buying opportunity.\nCrypto Fear & Greed Index. Source: alternative.me\nRelated: 10-year Treasury yield falls to 4% as DXY softens — Is it time to buy the Bitcoin price dip?\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n","date":1743851184574,"authors":[],"image_url":"","scraped_at":"2025-04-05T11:06:24.574921"}