{"id":"fbe1ab222b5a12f5e4f2ac826531b7fc","source":"Cointelegraph","title":"Bitcoin price drops below $80K as stocks face 1987 Black Monday rerun","url":"https:\/\/cointelegraph.com\/news\/bitcoin-price-drops-below-80k-stocks-face-1987-black-monday-rerun","content":" BTC price predictions diverge from stocks as Bitcoin shows surprising resilience to market downside over US trade tariffs — traders see that continuing next week. \nBitcoin (BTC) turned up volatility into the April 6 weekly close as fears of a stock market crash contrasted with bullish BTC price targets.\nBTC\/USD 1-hour chart. Source: Cointelegraph\/TradingView\nData from Cointelegraph Markets Pro and TradingView showed BTC\/USD dropping below $80,000 on the day, down 3% since the start of the week.\nThe days in between had seen several bouts of flash volatility as US trade tariffs and recession concerns stoked major losses across risk assets.\nUS stocks in particular recorded significant losses, with both the S&P 500 and Nasdaq Composite Index finishing the April 4 trading session down nearly 6%.\n“Trump's tariff announcement this week has wiped out $8.2 TRILLION in stock market value — more than was lost during the worst week of the 2008 financial crisis,” author and financial commentator Holger Zchaepitz summarized in a response on X.\nBloomberg World Exchange Market Capitalization chart. Source: Holger Zschaepitz\/X\nThe poor close caused some to wonder how the coming week would open, with comparisons to the “Black Monday” 1987 crash surfacing across social media.\n“It's tough to build a new, weaker, world order on the fly,” Jim Cramer, host of CNBC’s “Mad Money” segment, argued on X over the weekend.\nS&P 500 1-day chart. Source: Cointelegraph\/TradingView\nCramer had previously warned over a 1987 scenario playing out live on air, but subsequently reasoned that control mechanisms in the form of market circuit breakers “could slow things down.”\nBitcoin circles also saw some daring predictions of how markets would behave in the short term. Max Keiser, the popular yet controversial Bitcoin supporter, even called for BTC\/USD hitting a giant $220,000 before the end of the month.\n“A 1987 style mega crash will push Bitcoin to $220,000 this month as trillions in wealth seek the ultimate safe haven: Bitcoin,” he wrote in part of an X response to Cramer. \nAmong traders, the diverging sentiment over Bitcoin and stocks was increasingly apparent.\nRelated: Bitcoin crash risk to $70K in 10 days increasing — Analyst says it’s BTC’s ‘practical bottom’\nAfter withstanding the worst of the tariff shock last week, many argued that the coming days could even result in pronounced BTC price upside.\n$BTC - #Bitcoin: Ofcourse we can go lower first. However I think we will see the last push of this cycle soon. pic.twitter.com\/dp6otpgE16\nBitcoin is gearing up for a breakout next week — the $150K run might just be starting!$BTC #Bitcoin pic.twitter.com\/jNWNoiHnwo\n“$BTC Volatility going lower and lower while the $VIX (Volatility Index) on Stocks has closed at the highest level since the Covid Crash in 2020,” popular trader Daan Crypto Trades acknowledged in his latest analysis.\nBTC\/USD vs. VIX volatility index chart. Source: Daan Crypto Trades\/X\nFellow trader Cas Abbe suggested that recent $76,000 lows on BTC\/USD may end up as a classic fake breakdown.\n“This looks no different than the post-ETF dump and August 2024 crash,” he told X followers. \nBTC\/USDT 1-week chart. Source: Cas Abbe\/X\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\n","date":1743969208770,"authors":[],"image_url":"","scraped_at":"2025-04-06T19:53:28.770446"}