{"id":"fc2145323cb61260e4baa66cc78d72d8","source":"Cointelegraph","title":"California financial regulator warns of 7 new types of crypto, AI scams","url":"https:\/\/cointelegraph.com\/news\/californian-regulator-warns-7-new-crypto-ai-scams","content":" California’s Department of Justice says it took down 42 crypto scam websites in 2024 that haad stolen $6.5 million from users. \nA California financial regulator says users reported seven new types of crypto and AI scams that it hadn’t seen before through thousands of complaints in 2024. \nThe California Department of Financial Protection and Innovation (DFPI) said in a March 10 statement that it received 2,668 complaints in 2024 and found seven types of scams they didn’t have on record yet, such as fake Bitcoin (BTC) mining schemes, where fraudsters offer fake investments in mining. \nThe DFPI also received complaints about fake crypto gaming schemes, where users are encouraged to deposit funds only to have their wallets drained, and fraudsters offering fake jobs that require victims to transfer crypto and provide private information.\nSource: California Department of Financial Protection and Innovation\nVictims also reported the theft of private keys through fake airdrops, fake investment group scams in WhatsApp or Telegram, AI Investment scams offering unusually high returns and losing their crypto after interacting with certain sham websites. \nThe AI industry experienced significant growth in 2024, reaching a market cap of $638 billion, according to Precedence Research. \nThere was also a notable rise in crimeware-as-a-service (CaaS), where experienced hackers and cybercriminals sell their tools and services to less experienced offenders for a price.\nDFPI Commissioner KC Mohseni said the regulator is urging caution when interacting with unknown platforms and to “verify website domains to avoid fraudulent imitations, and stay wary of crypto recovery scam sites.”\nThrough its partnership with the State, the DFPI says it shut down more than 26 fraudulent crypto websites and uncovered $4.6 million in user losses last year. \nCalifornia’s Department of Justice (DOJ) took down 42 crypto scam websites in 2024 that stole $6.5 million from victims, with an average loss per person of $146,306.\nIn a March 10 statement, the California DOJ said that because international fraudsters often carry out scams, they are difficult to prosecute and arrest.\nCommon threads among the scam websites were promises of high returns, no contact information, offers of prizes for signing up, and no listings on legitimate crypto industry websites such as CoinMarketCap, the California DOJ said. \nRelated: Crypto lost to exploits, scams, hits $1.5B in February with Bybit hack: CertiK\nA report from on-chain security firm Cyvers identified pig butchering schemes as one of the most costly in 2024, estimating the scam cost the industry over $5.5 billion across 200,000 identified cases. \nMeanwhile, blockchain security firm CertiK’s annual Web3 security report flagged crypto phishing attacks, which cost users $1 billion across 296 incidents, as the most significant security threat of 2024.\nMagazine: Bitcoin’s odds of June highs, SOL’s $485M outflows, and more: Hodler’s Digest, March 2 – 8\n","date":1741691707167,"authors":[],"image_url":"","scraped_at":"2025-03-11T11:15:07.167446"}